{
  "name": "168 Sea Food Palace ",
  "address": "8 Sea View Avenue Colombo 3",
  "open_until": " Open 11:30 AM to 2:45 PM, 6 PM to 10:45 PM",
  "telephone": "0718644403",
  "description": "168 Sea Food Palace is a veteran among Chinese eateries in Colombo and is still hugely popular among locals. They do a decent take on Sri Lankan Chinese with efficient, but the place looks quite run down now.\n",
  "reviews": "168 Sea Food Palace is a veteran among Chinese eateries in Colombo and is still hugely popular among locals. They do a decent take on Sri Lankan Chinese with efficient service, but the place looks quite run down now.\nAs the name suggests, they've got lots of seafood. 168 has everything from shark fin (boo), abalone, lobster, shellfish and crab, with a good variety of dishes for each. Besides the seafood, they've also got the usual chicken, beef, lamb and pork as well. Rates are also quite reasonable with small portions (enough for 3) priced between Rs. 450 - Rs. 750.\nFrom what we tried, The fried rice with salted fish and chicken (Rs. 468 for S) was underwhelming. The issue with this one was that it was just so ordinary. The \"salted fish\" were pretty much just fried fish cubes and the chicken was shredded and mixed in which is something I generally associate with fried rice from street side eateries.\nWe had no such complaints about the hot butter cuttlefish (Rs. 598). The cuttlefish were cooked just right with a batter that was crunchy and flavourful, if a bit mild on the spice. Two things we appreciated about this was that while the batter was crispy, it wasn't dripping with oil and the pieces were just the right size. A portion for three at Rs. 600 is also a pretty tough price to beat.\nThe double cooked pork (Rs. 498) also ticked the right boxes. They've got a bunch of other dishes for pork but I have a particular affinity for pork belly. Unlike other places that mix in a ton of onions with this type of preparation, you get a good amount of meat. It had a good balance of flavours with a bit of sweetness and the flavour of the oyster sauce and soy sauce coming through nicely. The catch however, is that this is dish is very much Sri Lankanized and extremely oily.\nThe sizzling prawns (Rs. 698) were very mediocre. When the dish came to the table and the sizzle had settled, we had a feeling this wasn't going to be very impressive just by looking at it. The prawns were just pan fried then mixed in with the sauce. They tasted as bland as they looked with hardly any seasoning. The sauce helped a bit but there was no where near enough of it.\nThe service at 168, like most other Chinese restaurants, was very fast with the food being ready in about 15 minutes. The waiters - clad in bright yellow waistcoats - were efficient and attentive. But most of them did seem exhausted. All in all it's a very streamlined service.\nWish we could say the same about the interior of the restaurant though. You get generic metal chairs with cushions which aren't the most comfortable, along with table cloths with more than just a few holes in them. We can imagine the state being such at a restaurant with hardly any customers but 168 is quite the opposite. Which is ironic since they call it a \"Palace\".\n168 Sea Food Palace hasn't had much publicity in the recent past, but still has a strong local following and judging by some of their dishes we can see why. We feel they could be in much stronger position if they tidy up the place and make it more presentable.\n168 Sea Food Palace is a veteran among Chinese eateries in Colombo and is still hugely popular among locals. They do a decent take on Sri Lankan Chinese with efficient, but the place looks quite run down now.\nThere was a positive review of the Chill Crab at 168 by LT's Gourmand so I decided, perhaps ill-advisedly, to take a Singaporean visitor to try it out.\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/168-seafood-palace/review-36792",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2014/11/yimg_AZZCPm-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2014/11/yimg_tV5Gtw-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2014/11/yimg_2ZtDwt-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2014/11/yimg_HyuuUC-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2014/11/yimg_72natK-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://www.yamu.lk/uploads/files/2014/11/yimg_tV5Gtw-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2014/11/yimg_AZZCPm-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2014/11/yimg_2ZtDwt-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2014/11/yimg_HyuuUC-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2014/11/yimg_72natK-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/11/yimg_tabxl7-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_YBjNF1-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2018/02/XHTdwTjCNdYk8m5oSx.jpg",
    "https://www.yamu.lk/uploads/dp/2018/02/XHTdwTjCNdYk8m5oSx.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2014/11/yimg_AZZCPm-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2014/11/yimg_tV5Gtw-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2014/11/yimg_2ZtDwt-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2014/11/yimg_HyuuUC-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}