{
  "name": "41 Sugar",
  "address": "Rooftop, 41 Maitland Crescent, Colombo 7",
  "open_until": " Open 5 PM–12 AM",
  "telephone": "112682122",
  "description": "41 Sugar might be pricier than  other contemporary bars, but both its cocktails and food are honestly excellent. With an excellent rooftop setting to boot, the only thing they really need to fix is the attitude of their staff.",
  "reviews": "41 Sugar might be priced a bit higher than other contemporary bars in Colombo, but both its cocktails and food are honestly excellent. With a brilliant rooftop setting to boot, the only thing they really need to fix is the attitude of their staff.\nColombo actually boasts a pretty respectable repetoire of bars, but the issue we run into quite often is that the ones that excel at cocktails usually fall short in terms of food or vice versa. So the handful that manage to do justice to both make up our top tier — and that's exactly where we'd rate 41 Sugar, along with the likes of\n,\nand\n. In terms of variety, 41 Sugar offers one of the best selections of wines anywhere in Colombo, with a glass coming to around Rs. 700. They've also got cockails covered with the usual array of international cocktails, in addition to their own range of signature cocktails, all priced between Rs. 450 and Rs. 1,200. We actually dropped in for their\nduring which they offer a one-for-one deal on a small selection of their signature cocktails.\nOur passion fruit daiquiris (Rs. 600) were a terrific blend of sweet and sour from the passion fruit and intensity from the white rum. I'm not usually a fan of white rum but the acidity and sweetness from the passion fruit balanced out the entire cocktail, so I can't really picture anyone hating this. Another tiny detail we appreciated was that they kept the passion fruit seeds in there. The occassional crunch was a welcome addition.\nWhile not as unanimously popular as the daiquiri, the caipirinha (Rs. 450) was still a worthy rendition of Brazil's national cocktail. However, the one thing that some may not like is the fact that it is pretty darn sour. I'm a fan of sour drinks so I didn't have much of a problem with this one, but the citrusy tang did tend to overpower the ca\nWhile 41 Sugar is mostly known for its drinks, we definitely think that it also offers one of the best dining experiences in the Maitland Cresent area, which has no shortage of restaurants. As with the drinks, the food also falls into the upper bracket, so expect to pay upwards of Rs. 2,000 per head if you're looking to get both food and cocktails. We were impressed with everything we tried, but the only caveat was that their portions weren't particularly large. So if you're here on a limited budget, we'd suggest skipping the starters and going straight for the mains.\nOur crab cakes (Rs. 800) came to the table in no time at all. We got four, fun-sized crab cakes along with a mildly sweet tomato dipping sauce. At Rs. 200 a pop, these are definitely expensive. So whether it's worth ordering the dish is up for debate. That being said, these little crab cakes were packed full of flavour and promptly disappeared in minutes. Though they were small, we could still taste most of the ingredients. The flavour of the crab meat came through beautifully, with the bell peppers adding a bit of texture and diced chillies for heat.\nThe Sugar burger (Rs. 950), though not the same as the one they sell in their\n, was still one of the best burgers we had had in a very long time. This was a cheese burger, topped with a good amount of crispy bacon stuffed between two soft buns, served with tomato ketchup, pickled veggies and fries. The sides were fine, but this was all about that patty-bacon combo. We loved the fact that the beef patty was cooked to medium, which meant that it maintained its form while still having a light pink centre. It was also lightly seasoned, since the fried bacon on top brought the required saltiness. This is easily one of the best burgers in the city.\nThough we were quite full at this point, we still went ahead and got their layered mutton rice (Rs. 1,300). At first glance, it may seem like a pretty small portion for the price, but there's actually a respectable amount of rice in there. The mutton was tender, well seasoned and just a great match for the fragrant rice, which was the real highlight of the dish for me. Having been cooked in broth, we could really taste the savouriness of the rice. What set it apart was the beautifully moist texture, which bound all the flavours together. This was served along with a mango chutney, which added a welcome sweetness to complete the flavour combo.\n41 Sugar is also one of the few places in Colombo that actually serves up churros (Rs. 450). We got six pretty sizeable churros along with a berry dip and chocolate sauce. Though quite large, the churros were crisp and not overly doughy, with a healthy dusting of sugar on top. The slightly tart berry dip was fine in terms of flavour, but quite thick enough. The chocolate sauce, on the other hand, was perfect in terms of consistency, with a beautiful sheen. We liked the fact that neither dip was too sweet since the sugar coating on the churros took care of that aspect.\n41 Sugar offers a refreshing change from the usual indoor pub setting that is commonplace in Colombo. Unless you visit on a weekend evening, it also doesn't get too crowded. The al fresco setting, combined with the soft lighting, actually makes it a great place for a dinner date. We'd recommend visiting around 6.30 PM so that you can experience the sunset. In addition to their outdoor setup, they've also got a very snazzy lounge complete with black leather couches, a small stage to host a band as well as a massive yet tasteful chandelier.\nWe dropped in pretty early on a Wednesday evening so we had the entire place to ourselves, but we all felt that the service was sub-par and really detracted from an otherwise brilliant dining experience. The waiters seemed almost annoyed that we had arrived so early, even though we were there during the designated happy hour. They promptly informed us that we wouldn't be able to order tapas at the time since the kitchen would not open for another half an hour. The manager was also quite hostile about us taking photos, which baffled us since this was a rooftop bar where people come for the view. A real shame, since this took away what would have otherwise been a perfect score.\n41 Sugar may not be an everyday drinking spot, but if you're looking to head out for some good drinks and exceptional food, this place is one of your best bets. The service was the only area we had an issue with. If they can fix that, they'd be covered on all fronts.\n41 Sugar might be pricier than  other contemporary bars, but both its cocktails and food are honestly excellent. With an excellent rooftop setting to boot, the only thing they really need to fix is the attitude of their staff.\nWe like it. Colombo needs more adult bars where you can have decent drinks, be treated civilly, hear each others conversation and listen to music. 41 Sugar has all of the above in a beautiful and open location. Cheers.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/41-sugar/review-60493",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_CNUkb0-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_YqFkwT-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_7iGIfO-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_qDxQSs-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_GHmHcE-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_UmAFpv-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_IUsPEC-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_FZO0w4-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_EGXkOV-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_WC5NI1-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_XRjGKJ-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_c7nGGO-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_8hdQ0x-150x100.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/01/DSCF7022-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/01/DSCF7006-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/01/DSCF7014-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/01/DSCF6981-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/01/DSCF6991-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/01/DSCF6999-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/01/DSCF7011-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/01/DSCF7015-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/01/DSCF7018-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/01/DSCF7028-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/01/DSCF7030-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/01/DSCF7032-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/01/DSCF7033-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/01/DSCF7035-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/01/DSCF7036-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/01/DSCF7037-150x105.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_EGXkOV-292x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_WC5NI1-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_IUsPEC-288x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_YqFkwT-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_CNUkb0-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_UmAFpv-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_qDxQSs-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_FZO0w4-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_c7nGGO-319x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_GHmHcE-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/12/yimg_m5n55O-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/06/yimg_0J2JqE-600x250.JPG",
    "https://www.yamu.lk/uploads/dp/2018/03/NA9XQ23Q2Phk8BufEY.jpg",
    "https://www.yamu.lk/uploads/dp/2018/03/NA9XQ23Q2Phk8BufEY.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_CNUkb0-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_YqFkwT-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_7iGIfO-640x355.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_qDxQSs-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}