{
  "name": "88 Restaurant (Dehiwela)",
  "address": "84 Galle Road, Dehiwela",
  "open_until": " Open 11AM - 3PM and 6PM - 11PM",
  "telephone": "112731364",
  "description": "The longstanding 88 Chinese Restaurant has opened up a branch in Dehiwela, serving most items except for all pork dishes.",
  "reviews": "Growing up in Dehiwela, eating Chinese food was a big deal. It involved the whole family heading out to Colombo. Today, there's a Chinese restaurant in the very neighbourhood where I grew up. The 88 Restaurant, claiming to be a branch of the 88 in Havelock Town, just opened up and I've been waiting patiently to try its fare.\nWe enjoyed the service, and mostly the novelty of a Chinese restaurant in our neck of the woods. They dished out pretty decent fried cuttlefish balls and steamed chicken with black mushroom. Oh, and in case you're wondering, yes, Dehiwela is quite conservative when it comes to serving pork dishes. And, no, this 88 does not serve any pork products.\n\n\nWhile you won't find such delicacies as chicken feet on the Dehiwela menu, there's quite a variety of dishes offered. From lamb, chicken and beef to crab, lobster and prawns, they've got you covered for most of the go to proteins. Prices range from Rs 500 to Rs 4000, depending on how extravagant your order turns out to be. We found that three people can easily share the small portions, most of which cost between Rs 500 and Rs 1000.\nWe decided on the fried cuttlefish balls (Rs. 798), and were quite pleased. The croutons were crunchy, and there was plenty of cuttlefish inside.\n\n\nThe cuttlefish itself was a little bland, so we doused ours in soy sauce. The chili paste at the Dehiwela 88 is a little strange looking. Else, we would've tried that combination instead.\nWe felt like having soup, and our courteous waiter recommended the Tom Yam Seafood Soup (Rs. 528). He said it would be a clear soup. It wasn't. It was an oily, orange-ochre soup. There was more soup than seafood, and it was a little aggressive on the tangy note.\nFrom the noodles, we tried the Seafood Wet Noodles (Crispy) (Rs. 518) because the contradiction sounded promising. We were served by the waiter quite courteously, but the dish itself was nothing to write home about. In fact, you could easily pull this off at home with a packet of instant noodles. Just keep one packet uncooked, and cook the other. Make a corn starchy sauce for your veggies and prawns. It's quite simple. We weren't too impressed with their take on it. While the noodle wasn't as disappointing as being served Harischandra grade noodles, it wasn't that strong in terms of flavour. It just tasted like a soup packet.\nAlongside our noodles, we had the Steamed Chicken with Black Mushroom (Rs. 588) and we quite enjoyed it. Despite being a little strong on the soy sauce, there was plenty of meat and mushrooms. Three people could share this side dish, and it's just a small portion. Actually, make that four, if you're not gluttonous.\nYou can choose from fruit juices, iced teas and mocktails, ranging from Rs 150 to Rs 400. We tried the Fresh Iced Tea (Rs. 178) and it was too sweet. There was lots of lime, and the ice tea flavour quite good, but maybe the sweetness is catered to the location's clientele.\nThe 88 Special (Rs. 378), a mocktail with mango, lychee and papaya and pineapple, is best avoided. Mine was served at room temperature. I had to ask for ice. While the components of this mocktail were not combined, they each tasted alright. Once stirred, it turned into a thick smoothie consistency, and we do not understand why they'd call this a mocktail.\nThe staff seem quite happy, and not stressed at all. They're getting quite a bit of attention since they opened, and everyone seems to be on their feet at all times. We were served by a curly haired dude, baring chest hair. We didn't get his name. You'll spot him. He was quite nice and made our experience quite pleasant despite the food not blowing us away.\nThe place feels fairly spacious. It's just one large dining hall. There's no private dining rooms. They play noughties hip hop over the PA, so, if you're into 50 Cent, you may dig this place.\nWe're not blown away by the new 88 branch, and we've got mixed feelings about the lack of pork on the menu. While it scores them points on cultural sensitivity, it takes away from the original 88's reputation. This place is worth checking out if you live in the area. You might be more satisfied with the likes of Barracuda and The Station, given that they are by the beach. Still, those are geared towards Sri Lankan Chinese, and the 88 at Dehiwela is still the closest you can get to real Chinese. We're hoping they improve soon and stick around.\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/88-restaurant-dehiwela/review-63047",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_5kH7qF-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_pobPI4-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_0VJg1U-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_utZwxq-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_yDuYtL-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_hGt8yC-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_WR5A5G-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_SvoqZ0-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_3CP6BB-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_XngODr-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_4i0olz-150x100.JPG",
    "https://www.yamu.lk/uploads/dp/2015/12/0F34X3pTfLr7btifJN.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_5kH7qF-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_utZwxq-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_pobPI4-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_0VJg1U-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_hGt8yC-320x480.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_WR5A5G-320x480.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_XngODr-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_4i0olz-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_yDuYtL-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oKIYgP-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_zFF92D-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_5kH7qF-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_pobPI4-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_0VJg1U-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_utZwxq-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}