{
  "name": "Adma Agro",
  "address": "Peradeniya-Badulla-Chenkaladi Highway, Nuwara Eliya",
  "open_until": " Open 9.30 AM - 6.00 PM",
  "telephone": "0522235455",
  "description": "Adma Agro in Nuwara Eliya is well known for their fresh strawberries and strawberry products. The store itself isn't in the best shape, but thankfully their desserts are still pretty tasty.\n",
  "reviews": "Adma Agro in Nuwara Eliya is well known for their strawberries and strawberry products. The store itself isn't in the best shape, but thankfully their desserts haven't suffered the same fate.\nWhen you think of strawberries in Sri Lanka, Nuwara Eliya is most probably the first place that comes to mind. N'Eliya's year-round cold climate is ideal for growing strawberries so you'll come across a multitude of vendors when you visit. Here in Colombo\nhas made quite a name for themselves over the past few years. Adma Agro in N'Eliya offers somewhat similar desserts, albeit with less variety. Strawberries are generally expensive so the products here reflect that with everything priced between Rs. 300 - Rs. 1000. One thing that Adma Agro can boast of is that their strawberries are almost always very fresh, since they come straight from their strawberry farm which located just outside the shop.\nThe fresh strawberry juice (Rs. 320) was just that- tasty and just very refreshing. I used to drink the strawberry juice from Roots in Colombo quite often, and while it wasn't terrible in any way, this one was a lot less watered down with the flavour of the strawberries really coming through distinctly.\nBefore you ask, yes we did try the strawberries & cream (Rs. 320). The cream here is slightly sweetened which is necessary since the strawberries themselves aren't really sweet. While both the elements here were fine, we would have liked a bit more strawberries.\nWe also tried out the strawberry pancake with ice cream (Rs. 390) which was also quite nice. You can get this with either fresh cream or ice cream, and after trying both, we found that we actually preferred the latter. I like to think of this more as a large strawberry pancake-lavaria since the pancake here was quite thin with a smooth texture. The ice cream also works well here since you get a nice contrast of cold and warm. We tried two of these, one which came with a good amount of strawberries and the other not so much, so your mileage may vary.\nLike we mentioned earlier, the shop itself isn't the prettiest states (to put it lightly). It's clean enough, but the entire space has this green-red colour scheme, which may work during Christmas time, but just looks quite awful in general. The metal seats and tables  don't really help the cause either, giving it this unpleasant cafeteria kind of vibe.\nThere's also some random old couches thrown in there as well. The one thing that they do have going for them is the fact that the shop is located just a bit passed the Lake Gregory park.\nAdma Agro may not look like much but their strawberry based desserts and products are still fresh and tasty. Here's hoping they do some much needed renovations in the future.\nAdma Agro in Nuwara Eliya is well known for their strawberries and strawberry products. The store itself isn't in the best shape, but thankfully their desserts are still pretty tasty.\nNuwara Eliya is perfect for year round cultivation of strawberries. Nearly every vendor in town has stacks of strawberries for sale. But if you want to experience something a bit different, we recommend going to Adma Agro. They have an exclusive menu commemorating their lovely home-grown strawberries: Jams, Milkshakes, Cream, Delicious Strawberry Crepes, and get this - Strawberry Pizza!\n\nඅවුරුද්ද පුරාම ස්ට්‍රෝබෙරි වගාවට නුවර එළිය කදිමයි. එහෙ හැම වෙළෙන්දෙක් ලංගම වගේ ස්ට්‍රෝබෙරි ගොඩවල් තියෙනවා. ඒත් ඔබට ටිකක් වෙනස් දෙයක් අත්විඳින්න ඕනේ නම් අපේ නිර්දේශය තමයි ඇඩ්මා ඇග්‍රෝ එකට ගිහින් බලන්න කියන එක. එයාලගේ වත්තේ හදපු ස්ට්‍රෝබෙරිවලින් එයාලා වෙන කොහෙවත් නැති විදිහේ මෙනූ එකක් හදලා තියෙනවා. ස්ට්‍රෝබෙරි ජෑම්, මිල්ක්ෂේක්, රසවත් ස්ට්‍රෝබෙරි ක්‍රේප්ස්, ඒ ඔක්කොටම වඩා මෙන්න මේක ගන්න - ස්ට්‍රෝබෙරි පීට්සා!\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/adma-agro/review-47694",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_VB7Vd0-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_E7ZnGV-150x100.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/05/straw-150x105.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_OOkwl6-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_xjGW8L-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_2r02Ct-150x100.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/05/straw-2-150x105.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_2r02Ct-318x480.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_VB7Vd0-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_E7ZnGV-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_xjGW8L-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_OOkwl6-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_IYar0a-600x250.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/03/dutch-bank-benches-588x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_VB7Vd0-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_E7ZnGV-640x425.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/05/straw-600x450.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_OOkwl6-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}