{
  "name": "Alexandra & Ward Fashion Cafe (ODEL)",
  "address": "5, Alexandra Place, Colombo 07",
  "open_until": " Open until 09:00 PM",
  "telephone": "0114718758",
  "description": "A multi-cuisine cafe that showcases everything from fresh seafood to Oro 1889's Neapolitan pizza.",
  "reviews": "ODEL's seasonal makeover this year featured more than just tinsel and\n. You're walking into a whole new world -\n, the\nand the sleek and shiny new Alexandra & Ward Fashion Cafe. Restaurateur\n's newest project, the space also plays host to Cafe Nihonbashi (albeit on a separate menu).\nWe'll focus on Alexandra & Ward's menu in this review, and Cafe Nihonbashi's later this week.\nWe opened with one of Dharshan's Signature Spreads, a creamy concoction of Wasabi Crab Spread (Rs. 700) that came served with some grilled white bread and a nest of fried potato slivers. Don't let the uninspiring aesthetic of the dish fool you - the nuanced flavours that come to play in the crab spread are compelling. We feel as though the dish pays homage to both Japanese and Lankan cuisines.\nNext up was the Ciro pizza at Rs. 2200. Despite the price tag, we just had to try it since it was under the Oro 1889 section. Our erstwhile Napoletano darling,\nfor the last couple of years prior to its closure. They're back now under the Alexandra & Ward flag, and we couldn't be happier.\nThe Ciro is a full service pizza, featuring mozarella, fresh Italian sausage, aubergines, fresh red chilli, and of course basil. The sourdough gives the pizza a distinctly Neapolitan softness, with the typical \"well\" of soft sauce in the middle, fresh vibrant ingredients, and delicious crust. Overall perfectly executed, authentic, and more than enough for two to share.\n, so watch out for that.\n\nFor dessert, we just had to opt for the Chocolate Biscuit Pudding Petit Four. With a variety of toppings, you can order it by the cup (Rs. 200) or as a set of four (Rs.700). Our toppings were fresh strawberries, whipped cream, dark chocolate, and pani kadju. We absolutely loved this. It's not your\n, nor is it as sweet as your grandma's secret recipe.\nIt's a grown up, mature CBP that started off in Colombo but went off to finishing school in Lausanne. Made with Belgian dark chocolate and elegant toppings, we found this perfect for two to share and drool over.\nThe drinks selection isn't vast. If you ask nicely they'll let you get a bottle of wine from the neighbouring Sugar Wine Bar, but not during 2 - 5 PM. We opted for the Iced Tea Soda (Rs. 300) and Lime Juice (Rs. 300), which were both properly executed and furnished with sugar separately, which we appreciated. (But not as much as we would have appreciated a cocktail.)\nImagine a gilded birdcage inside an aquarium. With glass walls, an open plan kitchen, espresso machine, and pizza oven on one end, and lots of seating awash in natural light, it's a lovely dining space. The birdcage breaks up the open plan, lending the space a bit of quirky character.\nSeating could be more comfortable, with rexine couches and woven plastic chairs, but the glass tables are elegant. The service was friendly, and our waiters all knew their way around the menu, could suggest dishes, and even recommend crowd favourites. It does take some time to get someone's attention though, especially at night when the place is bustling.\nWhat's not to enjoy, really? Great ambience that complements anything from a business lunch to a family dinner, quick service, and inventive food at prices that don't make us wince. Colombo's new hot spot is definitely worth your buck.\nThe fancy new dining spot in ODEL's Promenade area.\n\nඇලෙක්සැන්ඩ්‍රා එකයි නිහොන්බාෂි එකයි දෙකම තියෙන්නේ එකම තැනක. එකම මෙනු එකේ දෙපැත්ත. ඒත් දර්ශන් කියන විදියට මේක රෙස්ටූරන්ට් දෙකක්ලුනේ.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/alexandra-ward-fashion-cafe-odel/review-149694",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_nBv1aV-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_1D4dOf-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_It9E4x-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_c699oJ-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_nM8MbG-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_Zg35xh-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_XxtQWk-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/01/yimg_yhPs6T-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2017/04/KE2F77hW9uoRt7RHja.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_nBv1aV-640x398.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_nM8MbG-640x385.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_1D4dOf-287x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_It9E4x-640x395.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_c699oJ-640x457.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_XxtQWk-640x401.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_nBv1aV-640x398.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/11/yimg_KXQ1s2-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_mOENRl-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2017/04/KE2F77hW9uoRt7RHja.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_nBv1aV-640x398.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_1D4dOf-287x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_It9E4x-640x395.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_c699oJ-640x457.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}