{
  "name": "Alhambra (Ramada)",
  "address": "Ground Floor, No. 30, Sir Mohamed Macan Markar Mawatha, Colombo 3",
  "open_until": null,
  "telephone": "0112422001",
  "description": "Alhambra is the Ramada Hotel's North Indian restaurant.",
  "reviews": "The Alhambra was originally known as the Qalat Al-Hamra and was a palace and fortress complex in old Andalusia, Grenada, Spain. So imagine how high I raised an eyebrow when I found out that Alhambra at the Ramada is a Moghul themed restaurant that serves North Indian food. Of course we decided to pop in and see what they were trying to accomplish with this interesting mash up.\n\nAs a complimentary starter, they serve some\nalong with a tamarind sauce and a minty, tangy chutney. The Poppadoms were paper thin and crisp and when dipped in the sauces they were a perfect tastebud-teaser.\nFor my starter, I ordered the Paneer Pakoda (Rs. 600) but we received the Subzi Pakora (Rs. 500) which is deep fried vegetable fritters instead of the original cottage cheese fritters I actually wanted. Grumbling aside, I found these to be quite tasty, as the batter was crisp and light and the vegetables were fresh and crunchy.\n\n\nNext up we got two types of Naans. The Keema Naan (Rs. 500) was a wonderfully, chewy naan with minced lamb filling. The filling wasn't really plentiful, you can only taste a hint of lamb but it was worth the price since there were around 4 thick slices of really good bread.\nThe Kashmiri Naan (Rs. 250) thoroughly impressed me. It comes with a filling of sweet cashews and cherry bits. I really dislike cherries but the bread was aromatic, crispy and delicious and the chopped cherry bits only enhanced the taste giving it a slightly sweet and savoury flavour. This is a real winner because at Rs. 250 you're getting three big slices.\nDon't bother getting naan for takeaway though - it completely kills the fresh taste and texture.\nFor our mains, we ordered the Awadhi Ki Biriyani with Chicken (Rs. 950). This was served in a little claypot that cleverly deceived us because it held enough to leave us both full and there was STILL a little bit left. The rice was fragrant, excellently prepared, served with toasted raisins and cashews. The chicken was juicy and fall-off-the-bone tender. It was a very simple biriyani with a complicated mix of spices and at Rs.950 it's worth every penny. However I MUST stress on the fact that the Raita served as an accompaniment to the dish was watery and tasted quite bland. A difficult thing to mess up especially when you specialise in North Indian cuisine.\nFor dessert we got the Rice Kheer (Rs. 400). I'm not a fan of traditional Indian sweets, but the Kheer was alright despite the ghee being a little too apparent. The rice still had some texture to it, and it wasn't overly sweet. Just the way I like it.\nWe also ordered a Gypsy's Kiss (Rs. 575), a cocktail made of Gin, Amaretto, Lime and Soda. This tasted more like an old Witch Doctor's kiss because the Amaretto was just overwhelming. It was basically a glass of Amaretto with a splash of soda, the other elements didn't really come through which was an enormous disappointment. The presentation wasn't anything to talk about either.\nThe interior was very pretty but it was just overly saturated with yellow lighting. They have some interesting paintings up on the walls and I'm sure the ambience would be a lot better during the evenings.\nThe waiter who took our order at first seemed a little confused especially when he mixed up my starter, but after a while another waiter quickly picked up the pace and the service he provided was efficient.\nI noticed that the tablecloth was a little dirty which is preposterous. According to the manager the Alhambra has been around for 40 years and are pioneers in North Indian cuisine, so I hope they step their laundry game up.\n\nI would recommend this place if you wish to dine in an authentic Moghul setting and experience North Indian food. Price-wise it's not bad at all, the both of us left feeling full and satisfied.\nThe Alhambra at the Ramada has been around for 40 years and was one of the first North Indian restaurants here in Sri Lanka. Here's what we think of them.\n\nඅල්හම්බ්‍රා එකේ නං හන්දියේ සයිවර් එකේ මිල ගණන් නං බලාපොරොත්තු වෙන්න බැහැ. නමුත් ඒ ගෙවන මිලට ලැබෙන්න ඕනේ මට්ටමේ කෑම බොහෝ විට ඔබට මෙහෙන් ලැබෙනවා.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/alhambra-ramada/review-133033",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_a697G4-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_GPYext-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_Kzt1Q6-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_KcxXA3-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_0HhZWm-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_2qlO2N-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_DXvxyg-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_IsxjoR-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_U6rAx2-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_eP3upw-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_nGIAIy-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2017/01/sFOlV64o5GU2djDVqy.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_KcxXA3-479x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_GPYext-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_2qlO2N-640x423.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_IsxjoR-640x366.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_U6rAx2-640x444.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_nGIAIy-640x440.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_0HhZWm-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oKIYgP-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/05/yimg_wPMcog-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_a697G4-640x374.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_GPYext-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_Kzt1Q6-640x484.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_KcxXA3-479x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}