{
  "name": "Almonds Exclusive",
  "address": "313, Galle Road, Colombo",
  "open_until": " Open until 02:00 AM",
  "telephone": "0112372382",
  "description": "Almonds is the mysterious new restaurant on Galle Road. We stopped by to see what all the hullabaloo was.",
  "reviews": "There's a building in Galle Road that's a bit mysterious. Not because it's pretty much all-glass, no, but it's been nameless for a while.\nThe inside, is decorated with a ton of glass bulbs suspended from the ceiling, nude, beige and black tones for furniture and decor. It practically screams fine-dining and judging by their website, the food looks rich and expensive. What we had was alright.\nThe Cream of Chicken Soup (Rs. 670) is more of a chowder, with a few bits and pieces of chicken added to it.\n\nThe good thing here is that the soup is really flavourful and you only need the chicken as an add on or to enhance texture. Initially, the minuscule amount of chicken bothered me, but since the flavour was on point, it didn't really matter.\nThe Monster Croissant (Chicken: Rs. 650) is a literal, gigantic croissant, sliced in half with a filling of your choice. It's served with fries and a minuscule helping of salad.\nThe chicken filling was tasty, with obvious hints of mayonnaise seeping through.\n\nThe croissant was a colossal, carb-filled Leviathan, that took a bit of effort to dig into. It isn't as flaky as its normal sized counterpart, which means it's like eating a large bun with buttery layers.\nThe salad was about a mouthful's worth that didn't really bedazzle us. The fries were crisp, a light gold and well salted.\n\nI'm really not exaggerating when I say it's large, and fair warning to those of you willing to try it; take a friend with you.\nThe Strawberry Swiss Roll (Rs. 590) was a bit of a puzzle. It looks like a swiss-roll-upside-down-cake. With the swiss rolls placed at the top and a layer of strawberry pudding at the bottom. It was alright, but the flavour was mild and reminiscent of faluda (probably because of the rose essence). This isn't a bad thing, but it isn't great either. It just is.\nThe juices were the best part about this entire experience, really. They're hands down the freshest juices you'll find on the Colpetty stretch. You're basically sipping on fresh fruit.\n\nWe initially placed an order for Mango Juice, but they brought out the Orange Juice (Rs. 490). It was too hot to squabble so we settled instead. Surprisingly enough the orange was a good choice. It was incredibly fresh with absolutely zero pulp and wasn't diluted with hefty amounts of water.\n\nThe Watermelon Juice (Rs. 490) was just as fresh and sweet. The sugar wasn't overpowering and it did a great job at cooling us down.\nThey've stuck to a very stark, modern theme here with textured concrete walls, lots of wood accents and yellow lighting. There's a live station where mostly everything's obscured from view so unless you're really keen, you can't watch the chefs work.\nThe waiters are excellent and we were constantly checked on to the point where we had to nod weakly with some hope of making them understand that 'yes, the food was good.'\nThe restaurant itself is stellar, and at night the place is lit up with all those bulbs hanging from the ceiling. There's an upstairs section which was still under renovation when we visited. There's enough room for about 50 people to dine comfortably.\nOne annoying thing you'll face is that when the sun's setting, the entire place is awash with light, so if you're sitting by the windows, you can expect a tan or a sunburn. The Colombo sun is treacherous, so maybe take an umbrella with you if you're dining at 1 PM-5 PM.\nThey've got premium stuff like duck and lamb albeit only one dish for each. Their menu also extends from Arabian cuisine to a variety of grilled meats, so be sure to ask them to take you through it all.\nThey're still very new, so here's hoping our next visit could meet with a few improvements.\nAlmonds is a fairly classy restaurant down Galle Road. We dropped by to see what the hype was.\n\nලොකු බජට් එකක් වියදම් කරන්න බලාගෙන මිසක්, මෙතැන තෝරගන්න එපා කියලයි අපි නම් කියන්නේ.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/almonds-restaurant-cafe/review-187114",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_0qQA6O-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_gM954N-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_gFlGWJ-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_q2tmMu-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_r22cGw-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_qwspm8-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_TrvNUO-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_rQBrJg-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_bKOW17-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2017/01/sFOlV64o5GU2djDVqy.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_r22cGw-640x452.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_gM954N-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_TrvNUO-640x419.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_gFlGWJ-640x461.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_rQBrJg-640x441.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_qwspm8-640x447.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_0qQA6O-640x461.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_mOENRl-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/12/yimg_l2i4n5-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/user/2017/12/yimg_UbRIFhneHJzynHvKIs-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/user/2017/12/yimg_W9AdhWehB3u7r1noXh-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/user/2017/12/yimg_UbRIFhneHJzynHvKIs-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/user/2017/12/yimg_W9AdhWehB3u7r1noXh-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_0qQA6O-640x461.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_gM954N-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_gFlGWJ-640x461.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_q2tmMu-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}