{
  "name": "Amangalla",
  "address": "10, Church Street, Galle Fort",
  "open_until": null,
  "telephone": "0912233388",
  "description": "One of the island's oldest and grandest colonial properties.",
  "reviews": "Built in 1684, Amangalla is an absolute bastion of Fort history. Serving as accommodation for colonial Dutch commanders, then as the New Oriental Hotel for about 140 years, it's been taken over by international boutique luxury chain Aman for the past decade. You can expect quiet, old world luxury and impeccable service, with prices to match. If you can't get a booking there, we'd recommend stopping by for a meal, which is what we did.\nWith reclaimed polished tiles, whitewashed walls, wooden furniture and awnings, the decor is absolute understated colonial elegance. There's a lot of natural light and fresh air filtering through the building's high shutters and verandah, which ensure the place doesn't feel old or stuffy.\nThe verandah overlooks a gorgeous old banyan tree neighbouring the Galle Fort ramparts. There's usually a lot of fun activity going on there, from monkeys and extortionate tuk tuk drivers to Chinese tourists attempting the perfect wedding portfolio shot. We particularly like the ambience during the day, especially for breakfast or a weekend lunch.\nThe waitstaff is trained to perfection, as you'd expect from an Aman property. They're all in Lankan outfits, and retain that traditional local hospitality and charm paired with international levels of service and efficiency. I noticed that apart from the doors being manned at all times by staff to welcome and seat you, there was also about 1 waiter per table. My waiter was prompt, friendly, and hovered at a discreet distance and slid over whenever it appeared as though I may need something.\nWe got there for a late lunch. Perusing the menu, I thought the options were slightly limited but that's probably a good thing because it means that the culinary staff does each of the dishes well. I ordered a Tiger Prawn on Barley, which came out in about 20 minutes, which didn't bother me given the ambience.\nIt was about Rs. 1700, which is fairly pricey by local standards. The prawns were large and succulent, peeled and delicately spiced to perfection. They came on a bed of barley and vegetables, teamed with a little blob of mashed potatoes that I requested (and was not charged for). I came away from each bite impressed by just how fresh and subtle the dish was. Despite looking fairly small, it was a surprisingly satisfiying portion.\nWe also ordered a raspberry sorbet, which was incredibly refreshing in the noonday heat. The price was also refreshing at a reasonable Rs. 250 for a scoop. The sorbet featured a puree of fresh raspberries which were great although the seeds were a tad annoying. Totally worth it.\nThe drinks menu was less inspiring, with a basic glass of Chardonnay at about Rs. 1000 and a glass of average prosecco at around Rs. 1600. It just wasn't worth it. I did try a fresh thambili juice at Rs. 400 which came nice and iced with lovely chunks of tender coconut flesh.\nIt's a pity we couldn't stay at Amangalla (no money no honey), but we're hoping to some time in the future (we've bought lottery tickets). With lovely antique furnished rooms and views of the Fort, each room goes for about $350 starting per night. We'd recommend a meal here just for the experience, although non-residents can only utilize the verandah and hall area, and we wish we could've had a poolside session. All in all, it was a lovely meal flavoured with history and charm.\n\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/amangalla/review-78198",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_pm4NIv-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_DgZQbT-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_HzqJUU-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_TjS7UB-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_FFYd6q-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_9BjvOQ-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_zgJMjm-150x100.JPG",
    "https://www.yamu.lk/uploads/dp/2017/04/KE2F77hW9uoRt7RHja.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_TjS7UB-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_FFYd6q-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_pm4NIv-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_9BjvOQ-640x621.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_mOENRl-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_RJqQoq-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2017/04/KE2F77hW9uoRt7RHja.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_pm4NIv-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_DgZQbT-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_HzqJUU-640x365.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_TjS7UB-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}