{
  "name": "Anaaj",
  "address": "4/4, Mandakini Glow, Greenlands Lane, Isipathana Mawatha, Colombo 05",
  "open_until": null,
  "telephone": "0775537317",
  "description": "Anaaj is a home-chef who specialises in authentic Pakistani Biriyani. They also have a bunch of other interesting items on their menu.",
  "reviews": "Anaaj is one of the few home-chefs in Colombo who specialises in strictly traditional Pakistani food fare. They like doing things by the book, which means every single detail of your catered meal has been tended to carefully and you won't find any unnecessary twists to each dish.\nAs with nearly all home-chefs you'll have to call them up beforehand to place an order. It is recommended that you place your order 2 days ahead and in some cases a full week ahead.\n\nWhy? Well, some dishes like their\nrequire some time to prepare on account of the entire recipe being a bit of an arduous process.\nUnfortunately, they don't deliver. They're located in central Colombo though, so finding their HQ shouldn't be too difficult. We had to go pick the food up at their location and from Bambalapitiya, it took us about 15 minutes.\n\nIf you'd like to take a look at their menu, click\n.\nThe Chicken Biriyani (Rs. 1,750) was an explosive combination of spices, saffron infused rice seeping with rich stock and large quantities of equal parts meat and potato.\n\nThe chicken was so tender it slipped off the bone. A good candidate for sensual lingerie commercials, honestly. It wasn't spicy, all the spice came from the rice, but it had absorbed just enough flavour to keep you going back for more.\n\nAs for the potatoes, they were mushy and soft. A little spicier than the chicken yes, but nobody was complaining because we were too busy stuffing our faces.\nYou'll find a large capsicum or two buried underneath the rice. I'm not big on capsicum, but if you are, that's an added bonus.\nThe kebabs (Rs. 660 for a portion of 12) were interesting. There was a rather strong presence of chana atta (gram flour). Tastewise they're rather mild but we enjoyed them all the same.\nThe texture is silky smooth, real nice to chew on and you get a few surprises occasionally with a bit of green chilli or coriander popping through. Pair with a delicious raita, and you're ready to go.\nThe Cucumber Raita (Rs. 750) bowled us over with its expensive price tag but it was superbly done.\nThe raita was creamy, had adequate amounts of onion and cucumber. The best part is that the yoghurt-y flavour didn't come off too strong so this made for a great accompaniment to our rice and kebabs.\nAs I stated in one of my earlier reviews, acquiring biriyani - whether bought or made - is no easy task. Obstacles must be crossed before one is allowed passage to obtain such a luxurious dish. If you'd rather skip out on the ordering/picking up, then check out our recipe for Easy Fish Biriyani\n.\nIf you want the authentic, original dish, then call Anaaj.\nAnaaj specialises in authentic, homemade, Pakistani Biriyani. They've also got other hard-to-find Pakistani dishes on their menu, so give them a call about those.\n\nකිව්වත් වගේ මේ රස බිරියානි හැදෙන්නේ කොළඹ ඉසිපතන මාවතේ “මන්දාකිණි ග්ලෝ\" නිවාස සංකීර්ණයේ තියෙන ගෙදරක.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/anaaj/review-192614",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_pSHG2I-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_LCBGm4-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_Sb4qUa-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2017/01/sFOlV64o5GU2djDVqy.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_Sb4qUa-640x430.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_LCBGm4-640x451.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_pSHG2I-640x490.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://www.yamu.lk/uploads/dp/2017/10/swcPqUUMcJ33hFAPaF.jpg",
    "https://www.yamu.lk/uploads/dp/2018/05/sIJAcEVxrFdIsRfn2v.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_pSHG2I-640x490.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_LCBGm4-640x451.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_Sb4qUa-640x430.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}