{
  "name": "Anilana Pasikuda (Restaurant)",
  "address": "14, Hotel Street, Pasikuda",
  "open_until": " Open 7.00AM to 11.00PM",
  "telephone": "0112675200",
  "description": "Anilana is one of Pasikuda's big beachside hotels. They've got killer ambience late in the evening, and they do a very good Jaffna crab curry. ",
  "reviews": "Anilana is one of Pasikuda's popular beach-side hotels. On our last awesome trip to the natural infinity-pool that is the Pasikuda sea, we stopped by Anilana's for some lunch. The food is pricey, some of it is very good, and the ambience here especially in the evenings is great.\nAnilana Pasikida is structurally very simple and open. When you walk through the gate you're met with fort-like concrete white walls, somewhat strangely topped with thatched roofs, but once you peek into the lobby, it's just one big open space that looks straight out onto the pool and the ocean beyond it. The pool is flanked by Arabian Nights style draped recliners, and you also look up at some of the hotel room cabanbas here (about Rs. 20K per night for a Deluxe according to\n).\nThe dining space here felt a little formal in the day but in the evening the ceiling and the pool were lit up and they played some very good deep house music. There's also a bar next to the restaurant.\nWe went out for a swim after our meal into the flawless waters here. Unfortunately there's barely any shore left (seems to be the case in most parts of Pasikuda these days), and there's a very prickly obstacle course of rocks and corals to cross over before you get to the good part - still, Pasikuda's pool-like ocean leaves very little to complain about.\nThere's a range of Western and Sri Lankan here, so we can't vouch for all their dishes, but it's safe to say they put a lot of care into what they make. For Rs. 1750 our Pollo Picante came with plenty of topping - fresh peppers, onions and tomatoes, chunky chicken, some cheese - on very thin bread. Although a noble effort, it was a bit of a hit and miss - the spicy flavours on the pizza were dominated by a very strong hint of garlic, so we didn't really feel like going at it for long.\nThe Jaffna crab curry was however, amazing. Two of us shared a dish for Rs. 1600, which as you can see from the picture included succulent shellfulls enough for about two or three happy servings - but the highlight was the crab curry itself. This comes with basmati rice and some veg sides, but the flavour of the curry was lost in the bland rice, so we asked for some kade paan instead. This is perfect with the curry, which comes very thick, with that distinct, rare blend of spices made famous in Jaffna - it is pretty spicy and might make you cry (totes worth it).\nService was excellent during our visit. The waiters and later the pool attendants were attentive and friendly, while the manager also dropped by our table to recommend the Jaffna crab.\nAnilana is a great place to chill out at if you're in Pasikuda in the evenings. The service and music is great, and the food is expensive, but not unbelievably so for a Pasikuda beach resort, with the bill coming to about Rs. 4000 for two.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/anilana-pasikuda-restaurant/review-46502",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_yoNpBW-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_qcyf2w-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_2TKLrQ-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_wRM2NB-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_v2ocay-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_v0U8Wu-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_90voIy-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_o2niSn-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_KWJzX8-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_ufZu63-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_sludC3-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_LJ3hhZ-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/Be7FWdmIZXRAmC8tEt.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_2TKLrQ-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_sludC3-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_v0U8Wu-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_yoNpBW-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_qcyf2w-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_v2ocay-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_mOENRl-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oKIYgP-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_yoNpBW-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_qcyf2w-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_2TKLrQ-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_wRM2NB-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}