{
  "name": "Anna Marie Bakery ",
  "address": "Dehiwela - Kalubowila",
  "open_until": " Open Daily\n",
  "telephone": "0773344237",
  "description": "The Anna Marie Bakery sounds like a place from a Beatrix Potter book. The food might as well be from the books too.",
  "reviews": "The Anna Marie Bakery sounds like a place from a Beatrix Potter story. Though the menu leaves something to be desired in terms of variety the options available will leave you almost ecstatic. Marie, the lady who runs the show appears to specialise in custom birthday cakes though her pies and other goodies will leave you thoroughly satisfied.\nSince she’s a rather fresh newcomer Marie hasn’t expanded to delivery yet. So, we settled to pick up the goods and taste them here at the YAMU office (dat ambiance though).  The bakery is rather affordable as far as home bakeries go with four chicken pies, a dreamy good chocolate and orange brownie, and a massive pumpkin spice cake coming in at just over Rs.2600.\nFirst up to the firing squad was the chicken pie (Rs. 140 per pie).  I’ve had rather bad experiences with pie in the past. Ones from small bakeries in Mt. Lavinia are always too crumbly, and the figure 'π' itself left me writhing post O’level maths paper. But this. This left us in denial with a few of us checking for seconds long after it was finished. It was baked to a lovely golden brown and was far from crumbly. There was a generous amount of chicken filing with the accompanying veggies complementing the pie well with a pleasant buttery-ness in the flavour.\nRIP Pie. You will be missed.\nNext up was the chocolate and orange brownie (Rs. 850). This had a pleasantly soft texture with a good kick of zesty orange to avoid the mundane. This is an experience for the mouth with the lightness of the brownie coinciding nicely with the occasional crunch from the crushed up cashews. Unlike other dry options elsewhere, the brownie here needn’t have ice cream and can be enjoyed by itself.\nWhen I ordered the pumpkin spice cake over Facebook, the picture featured an icing. But alas! Mine came without it. I’m not sure if this is an add-on, but the cake would have surely been an experience with it. It was a bit too light and fluffy for my liking though this could simmer down to personal preference. Though I like the fact that it isn’t ridiculously sweet, it lacks a bit of the punch factor flavour-wise. It isn’t a bad option, but our expectations were high given the surprisingly good pie and brownie.\nMarie herself is pleasant and seems more than happy to take on orders. I would recommend contacting her via mobile over Facebook. Though her menu is a little limited she seems to be adding new items on her Facebook page. When ordering note that some of her goods have a minimum order quantity. She was nice enough to pop in an extra pie since she forgot to tell me about the minimum order which is appreciated.\nIf you’re looking for brownies, pies and birthday cakes The Anna Marie Bakery is your go to place. However, keep in mind that her portions are pretty big, with only the pies being finished by a ravenous team of five in the YAMU Office.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/anna-marie-bakery/review-47341",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_oKvpNi-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_fMNOAJ-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_LskblF-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/07/r7ukSszy258MtvRTun.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_oKvpNi-640x426.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_fMNOAJ-640x426.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_LskblF-640x506.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://www.yamu.lk/wp-content/uploads/2014/10/IMG_7861-588x250.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_sf6hSl-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2018/06/8vWkh5taQ5CVDJgqpQ.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_oKvpNi-640x426.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_fMNOAJ-640x426.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_LskblF-640x506.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}