{
  "name": "Arabian Knights",
  "address": "379, Galle Road, Kollupitiya, Colombo 03",
  "open_until": " Open until 11:00 PM",
  "telephone": "112301032",
  "description": "After an initial hiccup, Arabian Knights has bounced back well. The food is nearly back to their former glory, and coupled with the new venue, things are looking up again.",
  "reviews": "Arabian Knights, along with the likes of\n, has long been one of Colombo's Middle Eastern staples. It's tough being an Arabic restaurant here, but AK has held strong and we've become progressively bigger fans over the years.\nIf you've been following our reviews of Arabian Knights, you'd see that we weren't exactly blown away when we first reviewed their (at the time) new restaurant in Colpetty, though we loved their former branch on Marine Drive. That being said, over the past two years they've been constantly improving and have become one of our go-to delivery options. Middle Eastern restaurants in Colombo have had some unfortunately short stints, but AK has managed to anchor itself quite well. Their prices are comparable to that of Hazari's, which is to say that it's fairly reasonable considering the portion sizes so managing under Rs. 1200 is easily possible.\nWe started with the Vegetable Soup (Rs. 410) which was basically the most boring option on the menu (blame Kinita for picking it). I was actually expecting a light soup, but we were pleasantly surprised by what we got. This soup was super thick, close to a curry in terms of consistency and with a bunch of veges like carrots, potatoes, tomatoes and onions roughly chopped and thrown in. It was also packed with spices which gave it a very distinct flavour, with a undertone of what tasted like aniseed.\nThe Cheese Sambosek (Rs. 660) is a sort of melted cheese-filled patty. If you're into gooey cheese-filled food, this will be right up your alley. It's a pretty straightforward dish, though the patty itself was a bit on the sweet side, which we found a bit odd. This comes with a garlic mayo dip which really enhances the flavour along with their light spicy and sweet tomato sauce.\nSo the Hummus with Pine Nuts and Meat (Rs. 480) is technically a cold starter, but in reality it's a main since it's so filling. This, along with the beef fatteh at Hazari's are probably my two favourite hummus dishes in Colombo. The crunch of pine nuts offset the smooth and creamy texture of hummus brilliantly, while also adding that earthy flavour. I've had this around three times now, and the beef has been on point every single time. They also add a bit of sumac to the hummus which adds a very light tartness, all of it coming together beautifully.\nThe Chicken Tagine with Rice (Rs. 640) is probably one of their more modest rice options. The rice is more or less just steamed basmati with a sprinkling of sumac on top. This dish is all about the chicken, and while it didn't blow our socks off, it was still flavoursome.\nThe chicken tagine had a lot going on with carrots, capsicums, onions and tomatoes. While those did add variety to the dish, we felt that there just wasn't enough chicken in there which was a bummer since it was actually cooked well.\nThe restaurant's got a slightly weird orange-yellow theme with blue cushioned furniture, along with hanging metallic ceiling lamps, which make for a rather incongruous look. This would usually bother me, but it oddly wasn't the case here. It's certainly not mainstream.\nThe service at AK has generally been very solid, and except for a few minor lapses, they were pretty good this time as well. We dropped in for lunch during a time they were having a discount going, but few of the waiters were actually aware of it. Our second waiter was a lot more prepared and knew the menu by heart, so we didn't have issues there onwards. It was a pretty busy lunch service so our food took around fifteen minutes to get to the table, which was fine.\nArabian Knights have ironed out a lot of the kinks, and managed to maintain a good level of consistency over the past two years. The food is quite authentic and affordable with some real winners like their\nand hummus, which make for great delivery options.\nArabian Knights has long been one of Colombo's Middle Eastern staples, with reasonable prices and strong flavours.\nAfter an initial hiccup, Arabian Knights has bounced back well. The food is nearly back to their former glory, and coupled with the new venue, things are looking up again.\nSo Arabian Knights has just moved from their small but popular eatery at Marine Drive to a proper restaurant in Kollupitiya Galle Road. It's an awesome place to hang out at, but the food was bit disappointing judging by their old Marine Drive standards.\nArabian Knights is a new and absolutely charming Syrian restaurant right by the sea. It only has about four seats and is more a takeaway joint, but if you walk in you'll be glad you did. Everybody there is quite charming (I said it twice cause it's true) and you can taste that they've put love and care into the food.\n\nඩයින්-ඉන් විතරක් නෙවෙයි, ඩිලිවරිත් තියෙන නිසා ඇරබියන් නයිට්ස් එකේ කෑම බීම රස බලන්න රෙස්ටෝරන්ට් එකට යන්න ම ඕනේ නැහැ.\n\nඇරේබියන් නයිට්ස් කියන්නේ මුහුද අද්දර පිහිටි අලුත්, ආකර්ශනීය සිරියානු අවන්හලක්. එහි තිබෙන්නේ ආසන හතරක් පමණයි. ඒ කියන්නේ එය වැඩිපුර කෑම පිටතට රැගෙන යන තැනක්. ඒත්, ඇතුළට ගියා නම් ඔබ සතුටු වෙයි. එහි සිටින අය හරිම සුහදයි. කෑම රසවෙන්නේ ඔවුන්ගේ ආදරය, සෙනෙහස නිසා වෙන්න ඇති.\n\nகொழும்பின் அழகான கடற்கரை வீதியான மரைன் ட்ரைவில் புதிதாய் ஆரம்பிக்கப்பட்டுள்ள சிரிய உணவகம் அரேபியன் நைட்ஸ். இது டேக் அவே உணவகமாக அமைந்துள்ளமையால் வெறும் 4 பேருக்கே உட்கார்ந்து சாப்பிட இருக்கை வசதி செய்திருக்கிறார்கள்.( ஆனாலும் நீங்கள் அங்கு இருந்து சாப்பிட முடிவெடுப்பீர்களானால் அம்முடிவையிட்டு திருப்திப்படுவீர்கள் ) இங்கு எல்லோரும் மிக்க நட்புடன் பழகுகிறார்கள். அவர்களது உணவில் அதிகமாக அன்பையும் உங்கள்மீதான அக்கறையையும் கலந்தே தருவதாக நீங்கள் உணர்வீர்கள்.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/arabian-knights/review-83794",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_S5tJjN-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_oS8Mk1-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_zQ6Xfq-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_G2KbBe-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_KJtpvt-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_P4bKS0-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_DydEt1-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_D1sLuO-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_r91rmH-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_GTDeDr-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_CAxRF3-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_CAoyVh-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_T9kG0l-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_rQKPMu-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_njyIGE-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_iX4mNU-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_GwYFlY-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_Rx8o8M-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_T9kG0l-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_oS8Mk1-640x434.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_G2KbBe-640x403.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_DydEt1-640x385.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_rQKPMu-640x388.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_CAoyVh-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_GTDeDr-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://www.yamu.lk/uploads/dp/2015/06/Be7FWdmIZXRAmC8tEt.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_S5tJjN-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_oS8Mk1-640x434.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_zQ6Xfq-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_G2KbBe-640x403.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}