{
  "name": "August by Mama Aida's",
  "address": "61, Dudley Senanayake Mawatha, Colombo 08",
  "open_until": " Open 7 PM - 11 PM & Lunch Take-Away (Closed on Mondays)",
  "telephone": "0777005808",
  "description": "August By Mama Aida’s is the newest addition to Colombo’s Middle Eastern restaurant repertoire. With authentic dishes, exceptional service and a chic, relaxing setting, August looks like it’s here to stay.",
  "reviews": "August By Mama Aida’s is the newest addition to Colombo’s Middle Eastern restaurant repertoire. With authentic dishes, exceptional service and a chic, relaxing setting, August makes for a memorable experience.\nLooking back at all the Middle Eastern restaurants Colombo has hosted over the years, we’ve never really been blown away in terms of ambience, but August did just that. They share the space with Shirohana on Dudley Senanayake Mawatha, and while it’s not a very large space they’ve definitely made the most of it. We loved how they combined simple elements like tasteful wooden furniture, hanging vines and candlelit lamps to really create a sophisticated and relaxing atmosphere. It’s one of the best outdoor dining experience we’ve had this year, however, there’s only a small section with a roof so rain can be a real spoiler.\nFrom the staff to the owners, the folks at August were incredibly hospitable and welcoming. The waiters were attentive and the management checked back on the table a couple of times to make sure our meal was going along well and to ask if we needed to know anything about the dishes. We were there relatively early (around  7 PM) so only a few other tables were occupied, but it was filled to capacity by the time we were heading out. In terms of service time; our five dish mezze combination came to the table in under ten minutes which was very impressive, while the mains took just a bit longer.\nWe’re no strangers to Mama Aida’s stuff, so we sorta knew what to expect going in to the meal. That being said, they have changed things up quite a bit with August, stepping out of that home cook niche. Just like Mama Aida’s, August isn’t cheap with the price per head coming to Rs. 2000+, especially if you compare it to a more casual Middle Eastern eatery like\n. However, it is a more complete dining experience considering the setting and quality of service and ingredients.\nRight now they’re\nbut they do offer take away for lunch. We really appreciated the concise menu here. They don’t try to do too much but they’ve still managed to add variety in the form of some unique dishes, using unconventional ingredients like lotus seeds and pomegranate, but you’ll also find most of the staples like hummus, babaganoush and falafel, along with all the different breads.\nJust out of curiosity we tried out their Arabic coffee (Rs. 200) while waiting for our food, and it turned out to be quite pleasant. The coffee itself was fine, with a nice aroma and no real bitterness, but what really made this special was the infused cardamom which really added a new dimension of flavour and light sweetness, which we enjoyed.\nThe hummus (Rs. 450) at August is a bit milder than some of the other iterations around Colombo, though that isn’t a negative by any means. The smoothness of the hummus combined, with the texture of the chickpeas makes for a nice contrast with the olive oil really bringing the two together. The paprika also adds a subtle tartness which counteracts the creaminess of the hummus, though we did wish there was a bit more of it.\nThe baby red mullet with tahini sauce (Rs. 700) was an interesting preparation, and while fish lovers will enjoy this, it may not be for everyone since the fish isn’t deboned. We got three fried baby mullets along with pita chips, topped with tahini sauce and a sprinkling of paprika. The fish itself was cooked perfectly moist on the inside with a light, crispy batter further complemented by the pita chips. The flavour of the fish was delicate with that nutty and lightly bitter tahini sauce really adding the punch. The bones really did sully the experience a bit though, so it’s definitely something to keep in mind.\nOur pick of the mezze was without a doubt the slow cooked lamb (Rs. 850). For the price this is a pretty small portion, but man was this ever good. The slow cooked meat was tender and moist, almost melting in the mouth with a texture similar to that of pulled lamb. The seasoning and spice was also just right with the savouriness balanced by the bursts of freshness from the pomegranate seeds. We were a bit reluctant to get this but we’re so glad we went with management’s recommendation on this.\nWe have to mention that we weren’t huge fans of how the beef shawarma (Rs. 600) was served. They bring just the meat and you need to get bread separately. This is how shawarma is done in some places, but we're still used to having it served as sort of a wrap. Taste wise the beef preparation was very intense in terms of spices, which is nice, just be aware of how it's presented.\nAugust offers just three mains, which is a refreshing change from the usual cases where they try to do way too much. You won’t find any rice on the August menu, so we opted for the August roast beef with couscous (Rs. 1650). In the case of the beef, they go for a similar preparation to that of the lamb, but with a bit of added gravy which helped keep meat from drying out. The pomegranate was present with this one as well, helping maintain the acid balance of the dish. The well spiced gravy along with the peppery beef make for interesting combo, though it does need the couscous to mellow down the intensity.\nWe also had the chicken yasser with lotus seed (Rs. 1550), which was the first time I’ve ever had the latter. Just by the aroma of the chicken, I knew we were gonna like this one and this chicken preparation is likely to appeal to local tastebuds. With both a flavoursome gravy and dry spice rub, this chicken was packing tons of flavour with just a tinge heat as well. The lotus seed was actually quite dry on it’s own but made for a winning combination when with that thick chicken gravy. It seems like it’s an acquired taste, especially since the texture of the lotus seed is closer to a gram than it is to a carb, but it’s certainly makes for an unique shift from the norm.\nFor dessert, the August mess (Rs. 550) just sounded too good to pass up. I mean c’mon it’s a meringue with chopped strawberries and pistachios. With a great balance of acidity to sweetness from the fruits and a multitude of textures from the pistachios and meringue, this was an excellent way to end the meal.\nColombo’s had a bad track record with so many Middle Eastern restaurants closing down, but August brings a new look and feel to the table and we’re pretty sure they’ll be around for a while. They’re pricey, but you’re getting well executed dishes with high quality of ingredients, some novel dishes and a level of finesse that’s not often associated with Middle Eastern food in Colombo.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/august-by-mama-aidas/review-72060",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_mO5LNQ-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_skpfRT-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_8DqnTY-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_KvRGyR-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_ljisen-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_pkgb5c-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_7t3UIy-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_lDipNk-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_nOd9C9-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_ICFOI2-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_eQcTpK-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_MdPYUq-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_CumHUI-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_yhLHin-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_7t3UIy-640x205.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_lDipNk-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_KvRGyR-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_MdPYUq-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_ljisen-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_nOd9C9-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_pkgb5c-640x410.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_mO5LNQ-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_8DqnTY-640x436.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_skpfRT-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oKIYgP-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_2IReda-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2015/12/0F34X3pTfLr7btifJN.jpg",
    "https://www.yamu.lk/uploads/dp/2015/07/uzI50We9CRr1yYpFEF.jpg",
    "https://www.yamu.lk/uploads/dp/2015/12/0F34X3pTfLr7btifJN.jpg",
    "https://www.yamu.lk/uploads/dp/2015/07/uzI50We9CRr1yYpFEF.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_mO5LNQ-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_skpfRT-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_8DqnTY-640x436.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_KvRGyR-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}