{
  "name": "B's Delights",
  "address": "Delivery or pick up from Dehiwela or Bambalapitiya",
  "open_until": " Open Pre-order at least a day ahead.",
  "telephone": "0773952512",
  "description": "B's Delights is relatively new, having started up just a couple of months ago. They do cakey brownies with interesting twists.",
  "reviews": "A colleague messaged me at around 10 PM with a hot brownie tip.\nThe page she pointed out seemed to specialize in brownies, with interesting twists — cream cheese, Oreos, red velvet etc. The best part was no minimum order, so we could order a range and try them all out. You can get an assorted batch of brownies in a single order, for around 1,350 bucks. This is great value for money, so check this place out.\nThe baker over at B's said she specializes in cakey and fudgey brownies, and these were definitely inclining more towards the cakey side of it. We got a Cream Cheese Marbled Through Fudge, their Signature Walnut brownie, the chocolate ganache brownie filled with choco-chips and topped with almonds, a Red Velvet Oreo Stuffed Cream Cheese Brownie (damn, that's a mouthful to pronounce), Chocolate Ganache Brownies topped with Strawberries, and Fudgy Oreo Brownies.\nOur favourites were the ones with chocolate ganache, coz they had a thicker texture and gave you that chocolatey kick you expect from gooey brownies.\nThe Signature Walnut looked like any regular old brownie, but—as the name implies—was infused with walnuts. It had a very crunchy bite, as did the base which was a tad lighter than what we at YAMU would look for in a brownie. It was a generous chunk, and there were around two pieces of each flavour in the 12-pack assortment. Cut into four smaller pieces, it was enough to feed the entire office. This is the brownie we liked best, for the crunchiness and the nutty undertone. Plus, it was also more fudgy than most of the rest.\nThis is the Chocolate Ganache Brownie topped with strawberries. As you can see, the strawberries are layered generously. There's no skimping back, and the tart sourness of the strawberries (which were glazed) went really well with the ganache. Chocolates and strawberries are always a good combo, and this just reaffirmed it for us.  The brownie base in this one was also fudgey and slightly gooey, so it was a win too.\nWe also liked the Oreo brownie and the chocolate-chip-with-almonds. The Oreos added a nice crunch to the brownie, and the cream in it added a delectable vanilla flavour that contrasted well with the chocolate. The chocolate-chip-with-almonds was great because of how abundant the chocolate chips were. (We really really like our chocolate. Well, I do.) Though there was a generous almond topping, the flavour didn't come through much — mayhaps because of the chocolate being overpowering.\nThe Cream Cheese Marbled Through Fudge was quite beautifully presented, and we dug into it with gusto only to discover that despite our collective love for cheesecake, we didn't have any love for cream-cheese brownies. The brownie was more cakey, and for some reason, the cream cheese didn't go well with it. On the flip side, the layer of cream cheese was quite thick.\nThe same could be said for the Red Velvet Oreo Stuffed Cream Cheese Brownie, but it was love at first bite with Indi, who gave a very satisfied nod and pronounced it to be really good. The rest of us at work didn't like this as much because (a) it made for pretty good cake, not brownie, (b) we don't like cream cheese with our brownies (as mentioned above), and (c) cream cheese with even cakey brownies aren't that great. The cakey bits were fluffy (not\nlight and fluffy, but fluffy nonetheless) whilst the bits with cream cheese were dense. It didn't really enhance the flavour of the overall product.\n[Why must cake and brownies be forever separate? Why discriminate? - Indi]\nYou should definitely give the walnut brownies a go, and the oreo ones as well, while you're at it. Adding cream cheese just complicates things (or so we mutually agreed upon) so we recommend skipping that. But if you're okay with looking at it as more of a cake experience, go for it!\nAlso, the baker is really friendly and nice. The box of 12 we ordered came with peanut butter brownies, but we asked if she could change that (because, allergies) and she complied by substituting the red velvet one instead. I'd give it a 5/5 for service. The prices aren't exorbitant either, with our 12-pack coming up to Rs. 1,350, so it's pretty good on the wallet.\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/bs-delight/review-57178",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_4sljBq-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_7WY8sI-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_FouKTs-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_0U1I4r-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_grL3UF-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_XBGRsg-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_vCRtZv-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_mKAwoV-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/08/bf9TdKPSlnqFHMaZrC.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_7WY8sI-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_FouKTs-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_XBGRsg-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_4sljBq-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_grL3UF-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_mKAwoV-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/07/yimg_mGLxnd-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_bb0i13-600x250.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_4sljBq-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_7WY8sI-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_FouKTs-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_0U1I4r-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}