{
  "name": "Bakeology",
  "address": "7 Barnes Place Residencies, Barnes Place, Colombo 07",
  "open_until": " Open until 07:00 PM",
  "telephone": "0773243464",
  "description": "A homebaker based in heart of Colombo 7 who specializes in peanut butter jelly cookies.",
  "reviews": "Bakeology is a fairly new entry to Colombo's home baker scene offering up some sweet treats such as peanut butter jelly sandwiches and red velvet cookies. We called them up and ordered a day in advance, and were informed that we'd need to make minimum orders for each item. Kinita picked them up and brought them back to YAMU HQ, enduring an hour of frenetic Colombo 7 traffic.\nThis was my favourite, mostly because of the texture of the cookie. It's not that soft, chewy cookie that we love from\n, but more like a crumbling biscuit. These were Rs. 100 each.\nThat works really well, in this case, with the jam.\nThe jam was just sweet enough but not as tart as I would like. The biscuit really does smell just like peanut butter, and the layer of jam is spread thin, so it tends to overpower it. Once you get to the center, though, it all balances out and it's pretty yummy.\nRed velvet cupcakes were all the rage, with teenyboppers professing their undying love for cream cheese frosting. I think it's safe to say the craze has died down of late, but Bakeology seems to be attempting to rekindle that flame. Instead of a cupcake, you get a cookie. The cookie seems to be made of cupcake dough. Naturally, none of us knew how to feel about this. Kinita found the 'cookie' to be eggy while Bhagya thought it wasn't quite cake or cookie.\nIt's kind of like someone squished a cake and then used a cookie cutter. Can't fault on the frosting, or filling, on this one, though. It's actually really, really good. Thing is, sometimes the frosting is too thin or even lumpy, but here the consistency and flavour were spot on. This was also Rs. 100 each, which seemed good value for the sheer quantity of stuff going on.\nThe most polarizing of the treats we tried, though, was the Salted Caramel cupcake at Rs. 120 each. While Bhagya absolutely loved the salted caramel frosting, 'cause it was 'properly salty, Malinthe found it to be heavy-handed, with too much frosting, so much so that the chocolate cake couldn't be tasted. I quite liked the cake itself, it was fluffy and rich. Indi didn't like it at all. Actually, he didn't like any of them. Indi's been eating sour candy all day.\nSo, since Bakeology is a home baker, you have to call in advance. We'd recommend a day or two in advance. The lady over the phone is really friendly and helpful, letting us know what our options were and how many of each item we'd need to order to meet the minimum. We got 6 salted caramel cupcakes, 8 red velvet cupcakes and 10 peanut butter and jelly sandwiches. It cost us Rs. 2400 for all of this, which was quite reasonable in our opinion. Each cupcake is Rs. 120, and each of the others were Rs. 100. However, prices vary and some other cookies are about Rs. 60 a pop.\nPick-up should be convenient, but Kinita seemed to have chosen the wrong time of day to gallivant about Cinnamon Gardens in the pursuit of cupcakes. So, don't arrange for pick-up at 9.30AM. Also, it's at Barnes Place. Musaeus College is just up the road, so any time around school opening and closing will be unpleasant if you're in a vehicle.\nWith competitors like home bakers\nand\n, or even dedicated outlets like\nand\n, Bakeology needs to up its game. We've heard really good things about their chocolate chip cookie, though, so maybe try that when you order. They're still new to the game, and already trying out new things, so we're feeling somewhat hopeful that this particular home baker will turn heads at aunties' parties, soon.\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/bakeology/review-76560",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_nZA1P1-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_mMQLWz-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_2X8Lil-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_H4CyjQ-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_L3WMFJ-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_LwThfm-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_CKu7Id-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_GYf9vp-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_zAxrIy-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_0JL0gS-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_BKDJHK-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_qPJIxK-150x100.JPG",
    "https://www.yamu.lk/uploads/dp/2015/12/0F34X3pTfLr7btifJN.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_2X8Lil-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_H4CyjQ-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_CKu7Id-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_nZA1P1-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_0JL0gS-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_L3WMFJ-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_f9ufo8-600x250.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_bb0i13-600x250.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_nZA1P1-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_mMQLWz-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_2X8Lil-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_H4CyjQ-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}