{
  "name": "Barista Lavazza (Laksala Thummulla)",
  "address": "No. 07, Reid Mawatha, Colombo 07",
  "open_until": " Open 7AM -  12 Midnight (Friday and Saturday)\n7AM - 11PM (Sunday to Thursday)",
  "telephone": "0112553187",
  "description": "Having been around since 2002, Barista is one of the first coffee shops to have popped up in Colombo.",
  "reviews": "Whipping up quick meals, iced drinks, and coffee, the Barista franchise has been here for years, and was one of the first cafes to break out in Colombo. Despite the city now crowding them out with the onslaught of new coffee houses, the Barista franchises has persevered — albeit with varying degrees of popularity based on each outlet's location.\nThe one at the Thunmulla Junction though, is well situated and well maintained, and is one of the better ones out there.\nThey have a variety of sweets and a few savouries, mostly cheesecakes, muffins, a few brownies, and sandwiches and the like. They also have paninis and wraps, with their offers spreading out to actual meals as well. The meals, during lunch time, is basically your choice of panini with your choice of caffeinated drink (out of two options for that, cappuccino and iced caffe mocha).\nWe opted for two panini meals; a smoked chicken panini with a mug of cappuccino, and a seeni-sambol and egg panini accompanied by a tall glass of caffe mocha. Both were priced at Rs. 720 each.\nPlaced between soft and fresh Ciabatta bread and topped off with a few slices of tomatoes, the smoked chicken was well flavoured and satisfactory meal. It was aromatic, and didn't offend any of our senses, and despite its somewhat bland appearance the taste was quite good.\nWhile the bread which came with the smoked chicken was soft, moist, and pale, the seeni-sambol and egg's Ciabatta was somewhat hard and slightly over toasted.\nIt helped to hold the components firmly together though.\nThe smell and taste of cardammoms were strong here, and it helped cut through the doughy taste of the boiled egg. We think that a fried egg would have gone better with this as the eggyolk here (when boiled) basically numbed all other flavours as its powdery texture and boiled-egg-yolk flavour overpowered everything else. It was also quite spicy, with the seeni-sambol really doing its job. If you want something with a local twist to go with your coffee, pick this. They also have spicy fish, if you're interested.\nWe opted for this with cheese, but the cheese honestly didn't really enhance the dish. Opt for it without.\nWhile the food satisfied, the drinks which came with the meal was quite disappointing in comparision. We were asked if we'd like cream with the coffees, and Imaad and I both said yes. A mistake where the cappuccino was concerned, actually.\nThis looks wrong, and it tasted wrong. Like mentioned, this was a mistake on our part because we said yes for cream, but we got a bit confused because after placing our order, the lady behind the counter kept asking about add-ons when we'd wanted just what we'd ordered. Hence we ended up with cream for the cappu, which tasted pretty horrible and looked quite bad aesthetically as well.\nImaad eventually scooped the thick dollop of cream out (it didn't taste that good either), and placed it on his saucer while he had the cappuccino (\"it's not even hot.\").\nWhile the cappuccino tasted ok in other aspects, it was nothing to write home about. The iced caffe mocha was a disappointment as it tasted like a watered down chocolate drink.\nBeing a coffee franchise, it's sad that what they're supposed to specialise in isn't passably good. We decided to give it another try and ordered an espresso next, which (\n) was surprisingly much much better.\nPriced at 280 bucks, the espresso was flavoursome, strong, and not too bitter. It didn't need any sweetening to mask the bitterness, and the aroma was quite welcoming and pleasant too. While the espresso was the best of the three drinks we tried here, note that there's barely any crema atop — so this could improve in that aspect.\nHowever. While at Barista, stick with the espresso.\nTheir service is brisk and professional, but we feel that the staff should know what add-ons to recommend to each meal/ drink. For instance, cheese with smoked chicken wouldn't really have gone well, and neither does extra cream with cappuccino. It shouldn't have been recommended, but it was.\nAmbience wise, they've got a snug and cozy interior and an outdoor area as well. The place is well maintained, clean, and has plenty of natural lighting. It's not bad to get some work done. They also have okay background music which isn't too loud, so it's comfortable white noise.\nService is fast, espresso and sandwiches are good. Stick to what you want, and don't go for add-ons unless you're certain you'd like them, because in addition to sometimes not really going well with your dish, it also adds another 100 bucks to your bill for each choice.\nService is fast, espresso and sandwiches are good.\n\nරස හොට් චොකලට් එකක් විතරක් තිබිලා මදි, මේ වැඩේ සම්පූර්ණ වෙන්න හොඳ කතා පොතකුත් තිබුණානම් තමයි මරු.\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/barista-laksala/review-67751",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2017/05/yimg_3EhtaW-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_JAIrc1-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_fWJinL-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_3bpYDN-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_nWXsgf-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_NYexdK-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_uN1MZC-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_B328gm-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_f91dB0-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_PXGzIQ-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_CrUHe6-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2017/05/yimg_fuhVV0-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2017/05/yimg_MuJwXB-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2017/05/yimg_dG7npG-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2017/05/yimg_AH6KXa-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2017/05/yimg_KW4Fzy-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/08/bf9TdKPSlnqFHMaZrC.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_NYexdK-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_JAIrc1-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_B328gm-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_f91dB0-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_PXGzIQ-351x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_fWJinL-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_3bpYDN-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_0aAEOD-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/01/yimg_JmCDFH-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2017/05/yimg_3EhtaW-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_JAIrc1-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_fWJinL-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_3bpYDN-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}