{
  "name": "Bijou",
  "address": "44 Porutota Road, Ethukala, Negombo",
  "open_until": " Open until 11:00 PM",
  "telephone": "0312274710",
  "description": "Bijou is a Swiss restaurant in Negombo located along Sea Street. They serve well priced, filling meals that are accompanied by excellent service and hospitality from both the staff and owners",
  "reviews": "A jewel in the necklace of Negombo's Porutota strip, Bijou is one of the oldest restaurants in the area. Over 35 years old, it's been run smoothly over the decades by a lovely older Swiss lady named Dolly. We're glad to note that even when she's not in the country, service and quality matches up to the nostalgia!\nThe menu reflects the ownership's Europeaness as well as the restaurant's location, with plenty of heavy meat and cheese dishes like schnitzel, steak, and even fondue, but also plenty of local produce like calamari, king prawn, and seasonal vegetables. The menu is also bilingual, which is pretty handy for all the Germans, Austrians, and Swiss swinging through the beach town.\nIf you're drinking, alcoholic options are pretty reasonable, with a local gin or arrack at Rs. 375. As for food, we opted for two fairly varied options, out of enthusiasm, and also to see how the chef managed both.\nI got a Grilled King Prawns in Garlic Butter Sauce (Rs. 1500), which came teamed with a generous serving of mixed fried rice, fresh salad in vinaigrette, and an extra serving of garlic butter sauce. While it was a tad bothersome that the prawns were still in their shell (perhaps my fault for not specifying I wanted them peeled), the execution otherwise was perfect.\nThe natural texture and flavour of the prawn was not obscured by the preparation, and the rice was tasty enough to be eaten by itself. The salad was fine too, but was neglected due to the sheer deliciousness of the main plate. Obviously, I slathered everything in the additional garlic butter, which was great for taste and terrible for arteries.\nWe also tried the Pepper Steak (Rs. 1300), a Bijou classic. We got it done medium (I'm still working myself up to medium-rare, sorry), and were pleasantly surprised by the soft, tender local meat we were presented with. The cut of meat was lovely in itself, and easily one of the cheapest steaks on the island at Rs. 1300, especially in that heavenly, thick pepper sauce. I thoroughly enjoyed the oversized blob of creamy mashed potatoes too. It was a simple, superb meal, and well worth it. In comparison, Colombo needs to step its game up.\nThe ambience reminds me of an old diner somewhere at the foot of the alps, with plenty of wooden furniture, old outdated pictures and advertisements, and colourful gingham mats. There's also some unhappy looking fish in a tank, very retro.\nMy favourite part is the little book case in the middle, with plenty of classic titles and a predominantly German selection of novels (there's even a complete set of German Harry Potter books. Harry Potter und die Kammer des Schreckens, anyone?). The inside restaurant is starting to look a bit careworn, especially during the day, but at night it's quite cosy and lively. For proof, check out this sweet video of owner\n.\nThere's also this strange chef statue outside that's been around forever.\nService was impeccable for a sleepy beach town. Our waiter has only been around for about 5 years, but he was incredibly friendly, and happy to chat with us about life, tourists, and the restaurant. He was also efficient, despite being the only present waitstaff juggling a couple of tables. Every order was right, he was able to recommend dishes, and everything came out in express time.\nOverall, we're going to have to dish out some bisous for bijou. The prices are very reasonable, the location is convenient, the quality is still commendable, and it's got that heavy dosage of nostalgia the new spots can't inject you with. Just call ahead and make sure it's open though!\nOne of Negombo's oldest restaurants, serving up Swiss fare at reasonable prices.\nBijou is a Swiss restaurant in Negombo located along Sea Street. They serve well priced, filling meals that are accompanied by excellent service and hospitality from both the staff and owners\n\nබිජෝ කියන්නේ මීගමුවේ පෝරුතොට පාරේ තියෙන ස්විට්සර්ලන්ත අවන්හලකට. එයාලා සාධාරණව මිල නියම කළ, කදිම කෑම ලබා දෙනවා. සේවාව අති විශිෂ්ටයි වගේම අයිතිකරුවන්ගේ සහ කාර්යමණ්ඩලයේ ආගන්තුක සත්කාරය ඉතාම ඉහළයි.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/bijou/review-101665",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/06/yimg_4B1bv2-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/06/yimg_2m6hYa-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/06/yimg_p6H4MZ-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/06/yimg_efDxBb-150x100.JPG",
    "https://www.yamu.lk/wp-content/uploads/2013/10/DSCF5165-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/10/DSCF5170-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/10/DSCF5171-150x105.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_AjAU5H-150x100.gif",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/06/yimg_3Rg7qs-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/06/yimg_xRuGGo-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/06/yimg_n92Szs-150x100.JPG",
    "https://www.yamu.lk/uploads/dp/2017/04/KE2F77hW9uoRt7RHja.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/06/yimg_n92Szs-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/06/yimg_xRuGGo-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_AjAU5H.gif",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/06/yimg_p6H4MZ-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/06/yimg_2m6hYa-320x480.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_zFF92D-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/05/yimg_wPMcog-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/06/yimg_4B1bv2-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/06/yimg_2m6hYa-320x480.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/06/yimg_p6H4MZ-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/06/yimg_efDxBb-640x553.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}