{
  "name": "Bliss Lounge",
  "address": "No 9A Duplication Road, Colombo 04.",
  "open_until": " Open 10AM - Midnight",
  "telephone": "0112081798",
  "description": "Bliss lounge is a Mediterranean sheesha lounge which serves Italian and burgers, among other things.",
  "reviews": "Bliss is one of the latest restaurants on the Mediterranean food scene, with their decor reflecting the interior of an Arab tent — deep, dark colours, willowy drapes. While they have familiar Arab foodstuff on their menu, they've also got a plethora of your regular burgers and what not for some reason. Cool thing is that this is the only place in Colombo I know of where there's sheesha facilities indoors.\nWe stared at their vast menu which spanned pizzas and burgers, and then focused back on the Arab section of the food, settling, eventually, for a Cold Mezza (Rs. 800) and a portion of Lamb Kofta (Rs. 1550). The staff hovered patiently and waited as we attempted to decide, and proved to be somewhat unaware of what the items on the menu were when we asked them about it. The dessert menu included a kunafa and basboussa, and we were unsure of what the latter was. Imaad and I asked the staff what the basboussa was like, and were told that it's \"something sweet\" and not much else. Enlightening.\nWe decided on the kunafa (Rs. 300), a traditional sweet flaky pastry, and then waited (and waited) for the food.\nThe appetizer, main, and desert all arrived simultaneously, so it was a wide spread at first glance. As we dug into the mezza, both Imaad and I were surprised at how good the moutabbel and hummus were. You were able to identify the smoky taste of the eggplants in the moutabbel, and the hummus was well creamed and nicely made, topped off with an olive.\nIt could have had a bit more olive oil in it, but it was an overall good dish. The third dish it came with was the tabbouleh, which could ideally have used a bit more bulgur wheat in it. However, the lemon and mint flavours came out well, and we weren't dissatisfied. What I didn't like much was that instead of khubbus or fresh bread, the breads given seemed to be what you can get off the frozen section of a supermarket — and rather dry at that. Had the bread been better (or even home-made or fresh), this would have been a much, much nicer dish.\nThe fat fries which accompanied the lamp kofta made us quite happy, and once again, we were surprised by the meal itself. Despite being a bit too oily for our liking, we loved how flavourful the meat was. Juicy and well-seasoned, it was something different.\nNone of the drinks of our choice were available, so we eventually settled for an ice-caramel latte (Rs. 650).\nServed in a mason jar as is the fad nowadays, it was a generous portion which was intensely sweet and just as cold. Quite perfect for this blazing hot weather, but not if you don't like caramel.\nMeanwhile, skip the kunafa because it was more like an overly buttery and somewhat sweetened milk-cake instead of the syrup-doused pastry of what it ought to be.\nIt's dark, cool, and shady. The drapes are also dark, so there's a lot of shadow work  going on. Throw in a couple of people smoking sheesha and it's smoky as well.\nIt's very different from the average coffee shop/ lounge you get around here; and judging by the number of teens crowding in towards late noon, it's quite popular among the young crowd as well. It's low-key, so our guess is that this is where all the kids who are bunking classes and school would disappear into. It was with a jolt of (dismay? surprise? shock?) that Imaad, Buddhika, and I realized that we were easily the oldest people in the establishment, and we're not even\nold; but this is definitely the new hood for the kids.\nThe rating for Bliss is a bit complicated to sort out — given its target audience, we think the food and ambience is on point, especially if you're just coming here to chill with a group of friends and smoke. The food is surprisingly good but could use a few tweaks to make it better, but service could definitely become a bit more efficient if the staff were trained right. There are a couple of flaws (availability of items, staff's uncertainity of what the menu items are), but as far as upcoming coffee/sheesha-lounges go, this is better than most out there.\nBliss is the new place where the kids who skip classes hang out. They've also got sheesha, and food.\n\nඒ කොහාම වුනත් අපි කෑම කන අතරෙත් තරුණ කොලු ගැටව් රොත්තක්ම ශීෂා දුම් පානය කරන්න නම් බ්ලිස් එකට ඇවිල්ල හිටිය.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/bliss-lounge/review-91785",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/04/yimg_zadtZN-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/04/yimg_xJ0Yzx-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/04/yimg_D69qcr-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/04/yimg_X7xVGC-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/04/yimg_HmHqN9-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/04/yimg_3W1GDm-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/04/yimg_B3zIXc-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/04/yimg_n27CDm-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/08/bf9TdKPSlnqFHMaZrC.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/04/yimg_HmHqN9-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/04/yimg_B3zIXc-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/04/yimg_D69qcr-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/04/yimg_zadtZN-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/04/yimg_n27CDm-320x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/04/yimg_X7xVGC-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/04/yimg_3W1GDm-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_GmVOlX-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oKIYgP-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2016/12/0AcLu8ioCUHoGL2Cga.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/04/yimg_zadtZN-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/04/yimg_xJ0Yzx-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/04/yimg_D69qcr-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/04/yimg_X7xVGC-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}