{
  "name": "Blue Field Tea Centre",
  "address": "No. 54, Haig Road, Colombo 04",
  "open_until": null,
  "telephone": "0777694694",
  "description": "You can buy tea powder or tea leaves here, as well as sit down and have a cuppa. They've also got a small selection of pastries at times.",
  "reviews": "Situated right at the tail end of Haig Road and bordering Marine Drive is an understated little tea shop. It's not a fancy cafe or place where groups of kids would hang out, being more atmospheric for people to drop in to just taste some legit tea and maybe have a little business meeting — because it's a quiet and tiny little space, with seating enough for about eight people. They also serve a few baked goods, mostly buns.\nYou won't be getting elaborate or fancy teas here if you're looking for shakes or iced tea or anything like that. What they do serve is solid plain tea, with milk if you want. They've got a range of flavours, including chocolate, which we wouldn't recommend. The aroma was indeed chocolatey, but the taste didn't really come through; and neither did the flavour of tea either.\nI picked chocolate just to see what chocolate flavoured tea would taste like, and it didn't pass. However, their Earl Grey and Cinnamon black tea were pretty amazing. The Earl Grey had a distinct fresh and springy tang to it, with the citrusy flavour cutting through the\npleasantly.\nThe Cinnamon wasn't overpowering, but the spice was definitely there. It's a hard pick between the Cinnamon and Earl Grey if you're to choose one, but if you want to unwind or need something soothing, I'd say go for the Cinnamon. The Earl Grey is more suitable for an early morning wake-up cup.\nTheir regular black tea is Rs 40, whilst the Earl Grey and other flavoured ones are tagged at Rs. 120. They also have a range of traditional teas (single origin Orange Pekoe, Broken Orange Pekoe Fannings etc.) sourced from both the low country and higher elevations.\nMeanwhile, they also have quite decent chicken buns and fish buns, with both the buns having actual meat in it as opposed to chunks of potato and leeks (I'm looking at you,\n\nPriced at sixty bucks, it's actually really worth it. They're also heated up before they're placed before you, so that's a nice touch. The picture up there is of the fish bunnis btw.\nA long, narrow space, one wall is covered with various types of teas you could purchase, whilst the second wall (the one facing Marine Drive) is one large window so there's plenty of natural light when the blinds aren't drawn.\nFurniture is simple, with padded wooden couches and low tables. It's quiet, and the waitstaff are pleasant and well-informed about the different types of teas and what should/ should not be had with milk. They'd advise you against opting for strong black tea without milk, but would get it for you anyway if you said you want it just so.\nMeanwhile, an interesting feature is that there are no menus. You can check out the varieties of tea up on display and just point which ones you'd prefer to drink.\nThere's also nicely packaged tea if you want to gift a non-local friend.\nWe'd recommend this place for people who'd like a quiet place to hang around and get some work done. And also for people who'd just like some tea without fuss and frills, without having to bust like 500 bucks on a cup. We were a group of four, and we'd ordered four cups of tea and five buns, and the total was like Rs. 700. Value for money, considering the quality and service.\n\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/blue-field-tea-centre/review-74243",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_XQN2hD-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_WbPOFj-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_oDD2du-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_84nHTI-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_rvMged-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_hVEzZP-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_KC867A-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_crtBaK-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_vrLyW9-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_BDAJoA-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_yMEGYt-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/08/bf9TdKPSlnqFHMaZrC.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_XQN2hD-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_hVEzZP-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_oDD2du-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_KC867A-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_BDAJoA-320x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_UYeSA2-600x250.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_mOENRl-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_XQN2hD-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_WbPOFj-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_oDD2du-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_84nHTI-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}