{
  "name": "Boat Haus Cafe (Haus Chandra)",
  "address": "37 Beach Road, Mount Lavinia",
  "open_until": " Open 6.30 AM - 11.00 PM",
  "telephone": "0112730236",
  "description": "A whole grilled fish, a pile of garlic drenched prawns, some ice cold bottles of lion larger, the roar of the sea all to yourself on a weekday evening. This is what Haus Chandra/the Boat Haus Cafe offers.  ",
  "reviews": "Boat Haus Cafe has been a popular seafood spot among Mount Lavinians for a while now. They offer fresh seafood and classic deviled dishes, all of it at pretty reasonable rates.\nBoat Haus Cafe is one of the many beachside restaurants on Mount Lavinia beach and one of the less dodgy. While there's actually no seafood on the printed menu, you can point to what you like at the fresh seafood counter.\nThey get a fresh catch everyday and the prices are pretty good. Authentic seafood-wise, it doesn't get much better than this. Once you pick what you'd like, they also prepare it the way you want (grilled, steamed, pan-fried, batter-fried, etc).\nWe got 150g of grilled seer fish (Rs. 570), which was basically the size of a small steak. While the preparation was simple, it still tasted great - due to the freshness of the fish. It was slightly under seasoned for my taste but nothing a bit of salt and pepper couldn't fix.\nWe also tried out their version of hot butter cuttlefish (Rs. 270 for 100g) which was different from the conventional \"Chinese\" preparation but still quite enjoyable. The cuttlefish was extremely fresh with a batter that was slightly thicker than usual but still crunchy and well seasoned with a bit of heat from the chilli flakes.\nThe tiger prawns looked so inviting at the counter that we got some pan fried in garlic sauce (Rs. 290 for 100g). In terms of flavour the garlic didn't come through quite as well as we would have liked but we still happily finished the entire dish since the prawns themselves tasted so great.\nFor a change of pace we also tried out their deviled pork (Rs. 450 for S). This was a classic deviled preparation with tons of chilli, coarsely chopped tomatoes, onions and capsicums. They use curry pork so you're not going to find as many pieces of fat, but since curry pork is relatively cheap, they give you a hefty portion which is more than enough for two. Honestly can't think of a better accompaniment for a Lion lager.\nBoat Haus Cafe is pretty much a house by the beach that has been converted into a restaurant. They've got seating both inside and on the beach, so they can accommodate quite a decent crowd. The interior has a brick floor which is quite rare nowadays and gives it an old(ish) look. They leave the large front doors open so you can enjoy the view of the beach even during the warmer times of the day. The only issue is that the strong breeze tends to blow the red-white checkered tablecloths all over the place which can get a bit annoying.\nThe service at BHC was quite fast but also highly unprofessional. They've got a staff of mostly young waiters, who happen to have the attention span of goldfish. We found ourselves waving our hands around quite a bit and the waiter who saw would tell another, and that one would call someone else. It reminded us of siblings who try and get the other to do chores.\nBoat Haus Cafe is a great choice if you're looking to grab some fresh seafood by the beach. The service can be trying at times, but we still think it's a good spot.\nBoat House Cafe is a great choice if you're looking to grab some fresh seafood by the beach. The service can be trying at times, but we still think it's good spot.\nA whole grilled fish, a pile of garlic drenched prawns, some ice cold bottles of lion larger, the roar of the sea all to yourself on a weekday evening. This is what Haus Chandra/the Boat Haus Cafe offers.\n\nකූරියා පිටින් ග්‍රිල් කරන හෙවත් පලහන ලද මාළුවකු, සුදුළූනු සමග පිසින ලද ඉස්සන් ගොඩක්, අයිස් මෙන් සීත ලයන් ලාගර් බීර බෝතල් හා මුහුදේ රළ බි‍ෙඳෙන හඬ සතියේ දිනවල හැන්දෑවේ මෙහිදී ඔබටමය. මේ හවුස් චන්ද්‍රා හෝටලය / බෝට් හවුස් කැෆේ ඔබට පිරිනමන දේය.\n\nஒரு ரம்மியமான மாலைப்பொழுதில் கடலின் பேரிரைச்சலை ரசித்தவாறு கிறில் செய்யப்பட ஒரு முழுமீன், வெள்ளைப்பூண்டு நிறைந்த இறால், பியர் என ருசிப்பதற்கான இடம் போட் ஹவ்ஸ் கபே.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/boat-haus-cafe-haus-chandra/review-43241",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_wvhh7K-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_G6ubBz-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_N219kE-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_DhvTpK-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_RGZo8R-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_kplob8-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_9uV4YI-150x100.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/08/Haus-Chandra-Hotel-150x105.jpeg",
    "https://www.yamu.lk/wp-content/uploads/2012/08/untitled-shoot-0031-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/08/untitled-shoot-0055-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/08/untitled-shoot-0092-150x105.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_9uV4YI-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_N219kE-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_DhvTpK-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_wvhh7K-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_kplob8-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_G6ubBz-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_RGZo8R-640x425.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/08/untitled-shoot-0055.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://www.yamu.lk/wp-content/uploads/2013/05/yamu_thelaviniahotel-1-1-588x250.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_Zcotzd-600x250.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_wvhh7K-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_G6ubBz-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_N219kE-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_DhvTpK-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}