{
  "name": "Bombay Sweet Park (Bambalapitiya)",
  "address": "225, Visakha Road (at the Galle Road end), Galle Road, Colombo 04",
  "open_until": " Open 9.00AM to 7.00PM ",
  "telephone": "0771743110",
  "description": "Bombay Sweet Park is a small easily accessible shop in Bamba that does very good samosas and milkshakes - they've also got sweets and rice and curry. ",
  "reviews": "Bombay Sweet Park is a mini-restaurant at the top of Visakha Road. They do some great samosas and a super milky, refreshing strawberry milkshake. They're also popular for their rice and curry and muscats (squishy gelatinous squares of almond, cashews, ghee etc).\nWe're always reviewing new restaurants that keep popping up in Colombo and over the years restaurant cuisine and prices have fluctuated. But one thing has stayed the same throughout and has always kept its customer base happy: roadside kades. Bambalapitiya, where Bombay Sweet Park is, is famous for the shops along the pavements that let out wafting scents of fried food and hordes of full-bellied men. Just a skip away from here is in fact one of the many popular Hotel de Pilawoos in the city.\nThe food at roadside kades like Bombay Sweet Park - a 12 year old family-run joint - has remained tasty and cheap, and we're grateful for that.\nWe tried their shorteats and they were all delicious. We'd highly recommend their samosas: perfectly crispy and stuffed to the brim with a spicy good ratio of meats and veggies, and also go for their Chinese rolls. Another place that's legit when it comes to shorteats is\nAll shorteats here cost Rs. 35, and they make an ideal light breakfast to pick up on the way to work.\nI don't know whether it was the heat that day or what, but this was one superb strawberry milkshake. It came in a tall glass, very cold, thick, freshly blended, sweet and milky, and very strawberry-icecream-ish. They've also got other fruity milkshakes and juices, all for around Rs. 150.\nLike other tiny shops on the Galle Road stretch nearby, they've also got some decent panikaju and milk toffees too, Rs. 5 a piece. The muscat here is pretty chewy and flavoursome as well, but like the rice and curry packets, the stocks all thin out by afternoon.\nIt's basically a tiny room run by two friendly Muslim uncle types, and it's got two tables inside. As you can see in the picture, the glass cases usually full of sweets and main meals are wiped clean by as early as 1PM, which attests to their lunch time popularity.\nBombay Sweet Park like so many roadside shops in Bamba, Kollupitiya and Pettah, does its job well and its consistently easy prices are a big relief after your wallet does a few rounds at Colombo's bigger restaurants. We'd suggest this place for shorteats/ buth packet takeaway or for a short solitary milkshake break between work hours.\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/bombay-sweet-park/review-42750",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_Q9Gxn8-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_Rp9oSo-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_yY6ztI-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_Bm0Q5Q-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_si9WIV-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_adYkb4-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_1i4blh-150x100.JPG",
    "https://www.yamu.lk/uploads/dp/2015/06/Be7FWdmIZXRAmC8tEt.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_Q9Gxn8-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_Bm0Q5Q-320x480.JPG",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_Rp9oSo-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_si9WIV-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_XF91Hz-600x250.JPG",
    "https://www.yamu.lk/wp-content/uploads/2013/09/DSCF6495-588x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_Q9Gxn8-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_Rp9oSo-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_yY6ztI-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_Bm0Q5Q-320x480.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}