{
  "name": "Bombai Muttai Man",
  "address": "Everywhere and nowhere",
  "open_until": " Open until 07:00 PM",
  "telephone": "0725267195",
  "description": "The ultimate Colombo street sweet.",
  "reviews": "Ah the Bombai muttai man. Literally, a man carrying homemade candy floss around, ringing a bell. Unlike the electrified bread trucks playing fur elise, the Bombai muttai man's bell is always a welcome sound.\nMight be a bit much calling this section 'the food'. Bombai muttai is basically cotton candy, or candy floss. It's spun sugar. I can be pink or, in its more natural state, brownish white. It comes sandwich between ostensibly edible wafers, which we don't really recommend. They taste like paper and are more for holding the Bombai muttai.\nThis sort of candy floss is a bit rougher than the western kind, but we like it better. It has some texture but eventually it melts in your mouth. It basically tastes like sugar and is a rather addictive nibble. You find yourself trying more and more and eventually trying to eat the wafers, which are sadly less sugary.\nFrom the name this may have come from Bombay, but who knows. Bombai muttai is made here by mixing sugar and water until it bubbles and caramelizes. Then it is spun in a metal bowl (sometimes with food coloring) until it becomes a workable texture. Then it's stretched, put in a mixture of coconut oil and flour and stretched and twisted some more.\nSo you're basically eating sugar. It's good. One portion usually costs Rs. 50.\nUPDATE: We have a number here for someone that runs from Bambalapitiya to Wellawatte. From 1 to 2 PM he's at St. Paul, Milagiriya and if you call he actually delivers. That's just one guy, we're trying to track down more.\nYou don't find the Bombai muttai man. The Bombai muttai man finds you. If you're alert you can hear his bells and they you need to chase him down. The location is wherever you find him, usually on the street. If you're lucky, near your house or office (where we found him). In Havelock Town he reportedly turns up around midday, but we caught him near the YAMU office (on Vajira Road, to be exact) at around 5 o'clock. It's unpredictable, which is part of the fun of the thing.\nIf you really want Bombai muttai now,\nserves bombai muttai ice cream and the like. But there's still something special about catching the Bombai muttai man on his route.\nThe Bombai muttai man's job is actually pretty tough, but we have yet to meet an unfriendly one. It's a classic one-to-one business and, unless there's a crowd, there's no waiting. You do, however, sometime have to chase them down the street if they don't hear or see you.\nThe Bombai muttai man gets a rare 5-stars from us. They (like Batman, multiple people play the role) serve something simple and cheap which makes people happy. The rarity of catching him just makes it that much sweeter.\nAh the Bombai muttai man. Literally, a man carrying homemade candy floss around, ringing a bell. Always a welcome sound.\nThe ultimate Colombo street sweet.\n\nකොළඹ සැබෑ වීදි රසකැවිලි\n",
  "yamu_rating": "We love this!",
  "url": "https://www.yamu.lk/place/bombai-muttai-man/review-39446",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_ydSNc4-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_SudzgD-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_Yi9wwv-150x100.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/02/mittai1-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/02/mittai2-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/02/mittai4-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/02/bombay-2-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/02/bombay-150x105.jpg",
    "https://www.yamu.lk/uploads/dp/2015/07/uzI50We9CRr1yYpFEF.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_Yi9wwv-371x480.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_SudzgD-640x480.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_ydSNc4-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_IUGtdH-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_mmMlXX-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_ydSNc4-640x480.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_SudzgD-640x480.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_Yi9wwv-371x480.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/02/mittai1-150x105.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}