{
  "name": "Boutique Cafe",
  "address": "63 Church Street, Fort, Galle.",
  "open_until": " Open 7.30AM - 9.30PM",
  "telephone": "94912224560",
  "description": "They have a variety of dishes including Sri Lankan, Western, Arab, and Chinese.",
  "reviews": "The Boutique Cafe is a relatively new venture in Galle, having started off a mere two months ago. They've got a great team on their staff, and have done some interesting things with their decor- simple, but interesting because it's intertwined with the history and essence of the Galle Fort.\nThe staff volunteers information about the building, its history, and their cafe, which is interesting because you get to feel more connected to the place. We'll start off with the service and ambience because those were the highlights of the place, actually overshadowing the food.\nThe decor is minimal and simplistic, with wooden furniture which looks a bit like pine. The walls are reminiscient of mud-thatched huts, and gives off a very cooling effect — we were later told that the plaster had been knocked off the building to expose the mud-and-coral base underneath, which is what most buildings in the Fort are constructed of because they apparently didn't use many bricks back in the day. Super cool!\nIn the process of reconstruction, the owners (managers?) mixed mud and wax together to give the walls a clean, glossy look. The floor's made of titanium, and the building itself is about 250 - 300 years old.\nThe staff are exceedingly friendly and accomodating. Having presumably overheard our remarks about one of the dishes needing a tad more flavour, they offered to give us some gravy on the house to complement the meal and add some spice to it — because the aforementioned dish was apparently supposed to taste just so,\nThe menu is flexible as is the time of closing, if you inform the staff of your preferences ahead of time. They also rearrange the dining area should you wish to have a private party, and have seperate menus for those. Once we were done with our meal, they said that they also offer complimentary afters, and asked us if we'd prefer tea or ice-cream. Later on, they told us that they were also introducing coffees to the menu, and offered us coffee on the house. They were pretty disappointed when we refused, so we caved in and shared a cup amongst the three of us after that (Just for the record, neither the management nor the staff knew we were from YAMU nor that we were reviewing the place).\nThey also took us out to the back to show us their 200 year old\ntree. Like I said, really interesting and educational staff.\nFor mains, we went for their Iranian Rice (Rs. 980) which comes with grilled chicken and pomegranates.\nThe chicken was mixed in with the rice, as was the fruit which added an unexpected but pleasant burst of fruity tartness. The rice was subtly flavoured with black peppers and cardammom, but the flavours in itself were very light. It could have been stronger, and could also use a bit more salt — but having tasted food from a few different places around the Galle Fort and finding that they're all pretty light with the spices, I think it's catered more towards a non-South Asian palate which can't withstand heat. This dish was a meal in itself, and you don't need to order anything else to go with it (unless you want gravy). Coming in abundant portions, it could easily feed two to three people.\nTheir seafood submarine (Rs. 570) was well stocked with meat, and went well with the chef's sauce provided. Having the consistency of mayo and tasting somewhat similar as well, this added a bit of salt and flavour to the bun as well. Once again, the portion was quite large and the bread was quite fresh — super soft and warm to the touch. We still think they could be a bit more generous with the seasonings and spice it up a bit, but oh well.\nAs far as cold drinks go, they can definitely work on the 'cold' aspect of it as our cold iced tea (Rs. 270) and iced mocha (Rs. 300) both came at room temperature. We were able to acquire ice-cubes upon request, but it still didn't give the chill we needed from the drinks. However, the lime juice (Rs. 220) was spot on, being icy cold and fresh. Opt for this, because it's perfect drink for the scorching heat.\nThey have amazing staff, and decent food. It's not a noisy, boisterous space, so it's the perfect spot to chill out and hang if you want to have a good conversation. We also tried their latte, which was quite good, nothing to complain about there. The portions are generous, and they have a quaint little courtyard out at the back as well.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/boutique-cafe/review-70334",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_SQSwa7-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_J7Ota1-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_csa3UI-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_4cBJ7z-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_OI3ChF-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_Q7MPfh-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_gWRmki-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_Rt128N-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_ynlFia-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_hXIAcW-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_9RpXP0-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_YLcSC2-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_ZrbRG2-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/08/bf9TdKPSlnqFHMaZrC.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_OI3ChF-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_ZrbRG2-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_SQSwa7-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_Q7MPfh-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_J7Ota1-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_csa3UI-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_Rt128N-320x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_mOENRl-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/04/yimg_wJVf8O-600x250.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_SQSwa7-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_J7Ota1-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_csa3UI-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_4cBJ7z-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}