{
  "name": "Brasserie (Mövenpick Hotel Colombo)",
  "address": "24, Dharmapala Mawatha, Colombo 03.",
  "open_until": null,
  "telephone": "117450460",
  "description": "A classy French restaurant perfect for business lunches, dates, and other occasions that require you to impress somebody.",
  "reviews": "The Brasserie is probably the best spot we've tried at the new Mövenpick Hotel Colombo. A French bistro-style spot perfect for business chats and moneyed conversations, this restaurant is excellent on most fronts but pretty dang expensive.\nWe opted for the cheapest option, which is their executive lunch menu available from Tuesday to Friday, 12 PM to 3 PM. You can choose from the Menu Côte de Nacre (2 courses at Rs. 2900++) or the Menu Prieuré (3 courses at Rs. 3500++). That's almost exactly €20, which is standard for a upscale prix fixe menu in most European cities. If you're opting for the a la carte menu, expect to pay about Rs. 3000-5000 per main. Their pork options are scarce to non-existent (all I could find was a shred of chorizo mentioned in a fish dish) and I'm not sure why.\nFor our starters, we went with a seafood salad and duck confit.\nWith one gently sautéed prawn, seared barramundi fillet, fresh garden greens, and a slab of ever-so-slightly beetroot-marinated salmon topped with dil, this was an absolute treat. Both the selection of seafood and the greens were impeccably fresh and well-prepared.\nThe other starter was plated beautifully, a salad with confit duck leg, green lentils, and a tangy citrus vinaigrette. I found the juxtaposition between the crispy duck and the soft, sweet melon and vegetables an interesting play on texture and taste. A perfect start to the meal.\nThey brought out a complimentary palate cleanser next, a kaffir lime sorbet with a few drops of brandy (naughty!). It was a slightly milky sorbet, almost a light pudding texture, but absolutely delicious. I would have been happy to accept this as a dessert, but there was more to come.\nFor our mains, we chose the grilled beef and the sauteed fish fillet.\nThe grilled beef sirloin was a rather large portion of high-grade U.S meat, topped with a delectable braised beef cannelloni comprised of soft minced meat, mashed potatoes, spinach, and herbs. There was a little pool of red wine jus to accompany the dish. The meat itself was succulent, prepared perfectly medium rare as requested, and lightly seared. It looks like\n's got competition! I appreciate that they tried to work with the presentation too, despite the fact that I have no penchant for squash or asparagus.\nThe barramundi didn't quite match up to the excellence of the beef, but it was still a fairly good dish. The fresh local slab of fish was perched on some leek fondue (not like the melted cheese, sorry), artsily ball-shaped bits of carrot, and brocolli (which I ignored), along with potato pavé on the side. Everything was well-executed, and not overcooked, but the fish itself simply didn't taste as good as the barramundi served up for the starter course. Perhaps the sauce needed more flavour, or the fish itself wasn't a perfect cut, I'm not sure.\nThe dessert menu is concise. I opted for the Chocolate Sphere (Rs. 1150) out of sheer enthusiasm for gimmick value, and it did not disappoint.\nA lovely confection of mousse, berry compote, and cereal in a hard 70% dark chocolate shell was slathered in piping hot liquid chocolate until it melted and broke apart.\nAccompanied by some fresh mango balls and drips of fruit compote, this was a mélange of yum flavours, temperatures, and textures, from the thick soft cold mousse to the crunchy cereal and the viscous hot chocolate sauce.\nIf you prefer variety, you can opt for the dessert trolley or the selection of French Cheese, both on the executive lunch menu. On my visit, the dessert trolley had about 5-6 options, and didn't look amazing, but this may be because I was mentally comparing it to\n.\nNo French meal is complete without a nice glass of wine, but sadly we had to do without. Entirely because the mark up over retail price was exorbitant and my South Asian soul cannot abide paying some Rs. 990++ for a paltry glass of meh Chilean Valdivieso Chardonnay blend. If you do want to ball out and don't care that the mark up could probably pay for the education of 70 tiny rural children, you can opt for a bling bling bottle of Armand de Brignac Brut Gold Ace of Spades for some Rs. 198,000++. The actual price is closer to\n. And if you are so clearly inclined towards burning money, please buy me a boat.\nThe service here is excellent, some of the best I've encountered in Colombo. The waitstaff were all unflinchingly polite, spoke excellent English, knew their way around the menu, the dishes, and the ingredients. What they didn't know they immediately asked the chef and got back to us. There was always someone discretely checking up on our progress in order to make sure our plates were cleared on time and the next course ready to come out. More important than all of these points was the fact that all three of the waiters that dealt with us seemed enthusiastic about their job, and seemed genuinely\n.\nThe ambience is classy but a tad soulless, like most generic 5 star hotel restaurants. The space is clearly geared more towards business lunches and meetings rather than intimate conversations or dates. There's a variety of seating areas though, from tables to a bar section to open booths.\nHowever, the plastic table mats with random food-related words, the wooden salt and pepper shakers, and the baroque wall decal sticker sort of detracted from any semblance of elegance. And if I'm dropping some 10K on a meal, I want to feel fancy. On the plus side, the music was lovely; lots of lilting Indie French Cafe type stuff.\nI didn't love the ambience or their gilded wine list here, but everything else was superb. I was exceptionally pleased with the service, the sheer quality of the food, and the menu selection. If you're willing to fork out around Rs. 3500 per head minimum and love a bit of French dining, this is your spot.\n",
  "yamu_rating": "We love this!",
  "url": "https://www.yamu.lk/place/brasserie-movenpick-hotel-colombo/review-189638",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_B0aKd1-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_iEJwI2-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_Tlr81B-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_oiFQla-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_7jawvy-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_gagk8S-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_bpBGJb-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_COuBtT-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_wOZ7A4-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_IpQxOH-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_BwUZFM-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_063ou7-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_WWoPyn-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_JX5xb3-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2017/04/KE2F77hW9uoRt7RHja.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_oiFQla-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_iEJwI2-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_IpQxOH-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_7jawvy-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_BwUZFM-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_WWoPyn-640x360.jpg",
    "https://i.imgflip.com/1tea3m.gif",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_JX5xb3-640x372.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_bpBGJb-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_063ou7-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_wOZ7A4-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_XEh2m9-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/07/yimg_X5AI4H-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2017/04/KE2F77hW9uoRt7RHja.jpg",
    "https://www.yamu.lk/uploads/dp/2017/04/KE2F77hW9uoRt7RHja.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_B0aKd1-640x368.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_iEJwI2-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_Tlr81B-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_oiFQla-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}