{
  "name": "BreadTalk (Park Street)",
  "address": "No 33, Park Street, Colombo 02",
  "open_until": " Open until 10:00 PM",
  "telephone": "94117356777",
  "description": "BreadTalk has been doing well since its inception despite all the \"its-expensive!\" cries, but anything for a posh pastry, right?",
  "reviews": "BreadTalk down Park Street has now moved premises. They are still down Park Street, but at the complex behind the old BreadTalk. Bigger and better, the new BreadTalk will make you feel very urban with their chic interior and corporate patrons.\nWhile way pricier than your average Perera and Sons, BreadTalk has been on par with its foreign branches in delivering good breads and pastries. Their range of savories does include the Lankan staples of rolls and\n, but their international selection is what you should be going for if you really want to spend them bucks.\nThe new BreadTalk on Park Street has a slightly different take than its other local branches. In addition to serving baked or fried goods, they have also introduced salads, sandwiches, pizza and pasta on the menu! The whole idea of serving salads is amazing because now your annoyingly health conscious friend will shut up.\nAfter paying for our Chicken Floss (Rs 200), Sugar Donut (Rs 70), and Iced Milo (Rs 240), we got to eating because the Devilled Fish Pizza (Rs 1310) and Chicken Club Sandwich (Rs 620) were going to take a while.\nThe Chicken Floss, as always, did not disappoint and was well up to their internationally recognized standard.\n(Fun fact time - BreadTalk has sold over 100 million of these floss buns!)\nThis bun had a generous coating of their trademark floss (chicken, in this case) and was flavoured well, spicy enough to cut through their sweet egg cream filling which is what makes the bun so amazingly incomparable to the other basic buns.\nBreadTalk's sugar donut is the closest you will come to a good, decent, soft donut that will make you feel a little okay about how Colombo still doesn't have Krispy Kreme.\nNot sure if it was just an unforturnate batch or if the quality has dropped because this donut wasn't their usual soft sugar donut. It was too doughy and lumpy with a whole load of sugar and a lot of Sumanadisi bakery feels.\nTo be honest, I donut want to believe their quality has dropped because I need BreadTalk to fuel my donut requirements.\nCompared to your average\nIced Milo, this is a few tens more pricey, but it's worth the Rs. 240. It was sweet, but not too sweet and was served chilled enough to forget the Colombo heat.\nWe finally got our pizza and portion of club sandwiches after a wait of approximately 15 minutes.\nFirstly, kudos to BreadTalk for this intense localization of toppings. Devilled Fish Pizza did justice to the devils of the Lankan Devilled World.\nTopped with a whole lot of cheese, these 8 slices were generously spread with tomato sauce, peppers, fresh tomatoes and spicy devilled fish, albeit a little more fish would have taken this pizza from a 9 out of 10 to a full on 10. What I liked best about this pizza (after the cheese) was the dough, which was thin and crispy and didn't leave you bloated after just three bites.\nThe Club Sandwich, sadly, was not upto mark. To begin with, the description said it would come with gherkins. As someone who loves gherkins in her sandwiches I was obviously disheartened to see cucumbers instead. No, gherkins do not equal cucumbers! That's like telling me Nutella is the same as any chocolate spread! It was also a little dry with no fillings around the corners and no one likes chickenless sandwich corners. For Rs 620, I would say BreadTalk could have done a lot better.\nThe accompanying french fries (\n) were fried well retaining all that potato goodness without overfrying or underfrying. So, yay! Also, the sauce, I noticed, was spicy which is a little plus to offset the minuses of the club sandwich.\nService at the new BreadTalk is very friendly. While I didn't receive the usual (and slightly unnerving) \"Welcome to BreadTalk\" that you would be welcomed with at their previous Park Street branch, the treatment was nice and warm.\nSpecial mention about the cashier, Randika, who was nice enough to take back the Hot Milo without a fuss and pour a fresh glass of Iced Milo after I changed my mind. In fact, she asked me if I would like an Iced Milo instead of the Hot Milo when she saw me hesitating after the swift shift in decisions.\nFrom the manager who asked us if all was well to the dude who brought the pizza and sandwiches to the table, everyone had a genuine smile plastered on their face which was really welcoming.\nIn terms of ambience, BreadTalk gives a very urban vibe, especially with the walking in work crowd from the offices in the adjoining complex. They have got ample seating, so you can bring your entire extended family if you're feeling rich.\nThey have got some quirky ornamenting going on with bottles and plants on tables. Instagrammers, take note.\nOverall, you cannot expect BreadTalk to be as cheap as your favourite\nbecause it's a Singaporean chain and international franchises are pricey. In terms of quality, it's good, but there definitely is room for improvement. I definitely would go back for their devilled fish pizza though!\nTheir service and ambience is undoubtedly what stood out when I visited and I definitely would go again if I am feeling less broke and want to be welcomed with smiles while munching my Chicken Floss.\nGood gluten and great service, BreadTalk at Park Street is going to leave you feeling really urban and slightly broke.\nBreadTalk excels in a lot of things like ambiance and presentation, however bite into that dolled up bun and you'll find that the buzz around BreadTalk is absolute gossip.\n\nබ්‍රෙඩ්ටෝක්  කියන්නේ ලංකාවේ සාමාන්‍ය බේකරි රැල්ලට හැමවෙලේම අලුත් දෙයක් එකතු කරන්න බලන බේකරියක්. ඕනේ ම බේකරියක හැමදාම දකින්න ලැබෙන රෝල්, පැටිස්වලින් මිදිලා අලුත් විදියට කෑම හදන්න මේ කට්ටිය උපන් හපන්නු.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/bread-talk/review-120055",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/01/yimg_V5D7Q5-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/01/yimg_K7WhZ0-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_efmHNv-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_Y3IxNb-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_CRNjhg-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_WrBvhM-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_j5kN0K-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_5hbaOa-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_SnXRxa-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_AtgqiV-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_INJIH8-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_oNzb1T-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_Gur5BT-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_TyZ2fc-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_zXIiHO-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_pl60if-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_J2WRfZ-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_umCbAV-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_SXVLH3-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_AUFSCD-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_awSHCF-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_od7o8D-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/01/yimg_nHMSHF-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/01/yimg_DZAovr-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/01/yimg_Db0LBl-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/01/yimg_eeV0uR-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/01/yimg_ZVaIC7-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2016/10/LMQdj7lnJxDKDVQ1DM.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_CRNjhg-480x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_pl60if-480x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_Gur5BT-480x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_zXIiHO-480x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_SXVLH3-480x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_efmHNv-480x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_Y3IxNb-360x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_WrBvhM-480x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_TyZ2fc-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_AUFSCD-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_GcHHlR-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/05/yimg_lybhCb-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2015/07/r7ukSszy258MtvRTun.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/01/yimg_V5D7Q5-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/01/yimg_K7WhZ0-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_efmHNv-480x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_Y3IxNb-360x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}