{
  "name": "Brew 1867 by Dilmah",
  "address": "No. 38/46 Navam Mawatha, Colombo 2.",
  "open_until": " Open until 07:00 PM",
  "telephone": "0117445990",
  "description": "Your ideal place to grab a quick breakfast or lunch, which is both healthy and freshly made. ",
  "reviews": "Brew Bar is without a doubt, the best place I have been to that serves some great on-the-go breakfast and lunch options for the most affordable prices. It's located on Navam Mawatha, in front of Robert Senanayake building. There are so many offices around it and it's such a convenient place to go to, if you want to grab something healthy and fresh.\nThey don't have a menu, rather everything's on display. The food is freshly made every morning and packed in cardboard boxes, ready to go. They have granola bowls, bagels, salads, burritos, sandwiches, rice and curry, shawarmas, pasta, paninis, and baguettes. On the sweet side, there are macaroons, cookies, carrot cake etc. They also have ice cream but the weather was way too cold the day we visited to have ice cream. Everything is well organized and tagged accordingly so it's very easy to grab and go.\nWe started off with a Granola Fruit Pot (Rs. 250) which included greek yogurt, berries, and granola. It was delicious and you can tell that it was freshly made because the granola tasted very fresh with a slight crunch to it and the strawberries inside, while gooey, had a tinge of sourness to them. There's nothing to complain about the yogurt, it's just so darn good. It's a great breakfast option and is sure to keep you full for several hours.\nNext up, we tried the Avocado and Vegetable Burrito (Rs. 280) and it was instantly our favorite. The couscous and avocado filling was absolutely delicious. There were corn, tiny bits of sweet potato and other veggies as well. For 280 bucks, I have never tried such a good burrito. The tortilla wrap held everything together and the texture of the filling was thick and chewy. It was easy to hold and a pleasure to indulge.\nVishvi got the Chicken Tikka Sandwich (Rs. 250) which they toasted on the Panini maker. It was again, really delicious and very filling. The bread was fresh too, with no crumbly bits making a mess. The filling, however, wasn't a chicken tikka, it was more like a chicken curry which was misleading. Either way, I wouldn't mind having it again.\nThe Penne Arrabiata (Rs. 340) was our least favorite. While it was a massive portion and a good lunch option, it tasted very bland. Especially the sauce. It definitely needed more salt and a thicker consistency because the entire dish is dependant on that sauce.\nIt's Dilmah, so there's plenty of iced teas for you to choose from. There's also green juices, iced coffee, smoothies, lassi etc. If you want something hot, they have the usual coffee options. There are non-dairy options as well.\nThe Sicily Almond Tea Shake (Rs. 180) was remarkably good! I highly recommend it. However, they've put a little bit of Nutella in there along with almond milk, so I found it a little too sweet. Nevertheless, it is a great drink to have with your afternoon lunch or even as a mid-day snack.\nThe Hot Chocolate (Rs. 240) was another great choice. Perfect for the cold weather and ideal to have with your breakfast. It was creamy and chocolatey with no sugar added. I can safely say it's better than some of the cuppas we have tried from certain high-end places.\nIt is self-service of course, but the staff behind the counter was quite slow that day. Blame the weather? I don't know, but we did find ourselves waiting in line a little more than we would have appreciated. Their attitudes, on the other hand, are very outgoing, friendly and helpful.\nThey don't have a lot of seating except for the high chairs at the far end. The place is not very big and we didn't really see anyone coming to eat here anyway, so that works out fine. The place is surrounded by lots of office buildings so everyone just comes and grabs their stuff to go.\nIt wouldn't be a Dilmah outlet if they didn't have any tea for you to purchase. Aside from the tea, there were jars of jalapenos, gherkin, baby corn and a few spices on the shelf.\nDilmah has done a remarkable job in establishing a place that is both convenient and satisfying to the customers. They have a lot of healthy options for the most affordable prices so it is not just a place you step in once in a while, but possibly everyday.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/brew-1867-by-dilmah/review-220798",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/05/yimg_SX3QJt-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/05/yimg_31Zg2m-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/05/yimg_holkm9-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/05/yimg_UZCFTx-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/05/yimg_omoV7O-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/05/yimg_R4xLal-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/05/yimg_Dxbzi8-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/05/yimg_iCeTVG-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/05/yimg_qJoJcI-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/05/yimg_b6qFmH-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/05/yimg_YHbDmM-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/05/yimg_Z0jDIq-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/05/yimg_ejZm1I-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/05/yimg_KrJAnP-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2017/05/8ASFnC1F2g6DeTqofz.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/05/yimg_YHbDmM-1024x576.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/05/yimg_b6qFmH-1024x576.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/05/yimg_KrJAnP-1024x576.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/05/yimg_Z0jDIq-1024x576.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/05/yimg_omoV7O-1024x768.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/05/yimg_ejZm1I-1024x576.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/05/yimg_holkm9-1024x576.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/05/yimg_31Zg2m-1024x576.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/05/yimg_SX3QJt-1024x768.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_mOENRl-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/04/yimg_yx3Wjl-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/05/yimg_SX3QJt-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/05/yimg_31Zg2m-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/05/yimg_holkm9-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/05/yimg_UZCFTx-270x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}