{
  "name": "Buba Restaurant And Beach Club",
  "address": "42/11 Vihara Road, Mount Lavinia",
  "open_until": null,
  "telephone": "0112732190",
  "description": "Buba Restaurant and Beach Club is one of Colombo's older beach hangouts. They've got pretty secluded part of Mt.Lavinia beach to themselves, seafood is decent plus its mostly BYOB ;).",
  "reviews": "Buba Restaurant and Beach Club is one of Colombo's older beach hangouts. They've got  secluded part of Mt.Lavinia beach to themselves, their seafood is decent plus its mostly BYOB ;).\nAround five years ago Buba was one of the more happening beach spots, with events happening quite often. It also had reputation for being a bit dubious. Nowadays, however, Buba's crowds have dwindled, partly due to the location which is at the very end of the beach stretch past Mt.Lavinia Hotel.\nBut then again this is also not a terrible thing since you have a good degree of privacy. Oh, and there's this one very domesticated con artist of a squirrel, who will literally walk up to your plate and steal your food, while you fall for its cuteness.\nService was pretty fast since the place was relatively empty when we were there. The waiter was friendly but its more of a casual type of service, which is nice for a change. They actually told us that Buba is now mostly geared towards foreigners since certain local crowds can become \"troublesome\". But from what we experienced, if you're nice to them, then they will reciprocate.\nThe menu at Buba is relatively short compared to the likes of Barracuda and The Station. Its mostly seafood with a few grilled meat options. Note that it's more expensive than other beach side restaurants. The reason becomes apparent when you see that this stretch of beach is full of foreign vacationers. Expect to pay around Rs. 1500 each. We didn't eat a whole lot but the stuff we tried were actually pretty tasty.\nThe grilled baby octopus (Rs. 575) was something I've been wanting to try for a while since it's hard to come by. You get two baby octopi in honey and soy sauce, served on a bed of kankun. The sauce was pretty strong in terms of flavour with it being mostly soy with a touch of sweetness from the honey. This is actually necessary because the octopus is similar to a tougher version of calamari with more meat. Overall we'd say it was a satisfying starter.\nThe batter fried calamari (Rs. 1400) while flavoursome, was very pricey. It was good, but we wouldn't say it's as good as some of the hot butter cuttlefish offerings from contemporaries up the beach. The calamari itself was fresh and cooked well. The batter was crispy and light, if a bit lacking in terms of spice. If you want it a bit spicy or with added chilli, you can tell the waiter and they'll cook it to your preference. Also any seafood you see on the menu can be had either batter fried, pan fried or grilled.\nRemember that squirrel we mentioned? He apparently likes calamari.\nWe weren't too keen on dessert, but we tried out the chocolate mousse (Rs. 350) which wasn't fancy, but still surprisingly good. This wasn't like super high quality chocolate, but it was light, creamy and just plain enoyable.\nBuba may not be as happening and busy as it once was, but its still a pretty good spot to hang. Their food is tasty but pricey, and the they offer a great view of the ocean.\nBuba Restaurant and Beach Club is one of Colombo's older beach hangouts. They've got  secluded part of Mt.Lavinia beach to themselves, their seafood is decent plus its mostly BYOB ;).\nBuba is one of Colombo's classic bites and beer hang out spots, and a canonical city-beach drinking venue for locals. If you're not knocking back the Mendises at Mambo's, Buba's the next best thing.\n\nබුබා කියන්නේ කොළම තිබෙන අනර්ඝ බීම හා කටගැස්මහලක්. එය ස්වදේශිකයන් අතර ජනප්‍රිය වෙරළ අද්දර බීමහලක්.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/buba-restaurant-and-beach-club/review-44323",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_wZT7wK-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_cEypfI-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_gCBwIS-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_Ws950o-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_3tJ8mR-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_idnrnY-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_3XhDsv-150x100.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/02/DSCF4313-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/02/DSCF4302-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/02/DSCF4303-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/02/DSCF4304-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/02/DSCF4305-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/02/DSCF4318-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/02/DSCF4319-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/02/DSCF4321-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/02/DSCF4324-150x105.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_Ws950o-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_idnrnY-318x480.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_cEypfI-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_wZT7wK-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_3XhDsv-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_gCBwIS-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_JJ8jB3-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_YBjNF1-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2016/02/IJIBS4jxZQsZJFls0R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_wZT7wK-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_cEypfI-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_gCBwIS-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_Ws950o-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}