{
  "name": "Bubbluscious",
  "address": "KZone, A3, Ja-ela",
  "open_until": " Open until 09:00 PM",
  "telephone": "0763661980",
  "description": "The only bubbly place that serves bubbly desserts as well. Plus, chilled out decor!",
  "reviews": "You'd think people would run out of names for bubble drink places that begin with the word 'bubble,' but that day has clearly not arrived as yet. From Bubblelement to Bubble Me, (and Mabroc, which thankfully has a somewhat original name), we now have Bubbluscious. Like, luscious bubbles. What sets these guys apart is that they have a range of flavours not available in any of the other stores, and that they've expanded to bubbly desserts as well.\nBubble tea connoisseurs will exhale sighs of happiness at the options presented here — nearly 50 bubbly choices ranging from 'originals' to a premium range, a selection of coffees, fruity flavours, smoothies, and desserts. Prices are amazing: most of them are at Rs. 250, with the Premium ones just touching Rs. 320. The desserts — chocolate biscuit pudding, chocolate ganaches, vanilla sponge and such, topped with ice-cream and popping bubbles, are a mere Rs. 300.\nGiven that we dropped in directly after lunch and there were only two of us, we weren't able to go through each of the ranges, but did manage to check out one each from the Originals, Premiums and Dessert section.\nWe got a cold Almond Cherry (Rs. 280, Originals) and a Milo Tea with Vanilla Ice-cream and Milo Powder (Rs. 320).\nThe Almond Cherry felt a bit like a faluda at first. I would have absolutely loved this if not for the fact that there were tiny little pieces of pink stuff in the drink: rather like what you'd get if you blended maraschino cherries and didn't strain them to separate the skin from the juice. It gets in between your teeth and sticks in your mouth, and can be rather annoying.\nTopped with a dollop of vanilla ice cream, the Milo Tea was legitimately good. It sounds like there's a lot of things going on in that one cup, but the flavours and textures (cold ice-cream, dusting of Milo powder atop) blends beautifully together.\nWe also got a chunky, chewy, absolutely chocolatey and gooey brownie for Rs. 300, topped again with vanilla ice cream. While we would have preferred it if the brownie had spent some alone time getting heated in the microwave before being served, we can't find fault with this because it was pretty nigh perfect. I found the strawberry-flavoured popping balls an interesting twist to topping it off with strawberry compote or regular syrup, and the clash of textures again, was quite great.\nThey've made great use of whatever space they've got in the mall — and managed to make it look warm and cozy despite being tucked away under the food court at KZone. There's framed wall decor, interesting lantern-like lighting, and colourful thick straws lined up like colour pencils along one end of the wall. The bubble and jelly topping options are displayed on a cartwheel holding little jars up, but most of the popping balls have, well, popped, so it's rather like a jar of coloured water.\nService is friendly, and the uncle behind the counter is more than willing to explain the process for you and make recommendations. Also, there's a screen with your receipt number displayed on it when your order is ready, so you know when to go to the counter and pick it up.\nIf you live out in the boondocks like I do and still crave those tapioca balls or popping bubbles infused drinks, head over to KZone. There are beanbags too, so you could also take a book and go curl up if you so feel like it.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/bubbluscious/review-165789",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_yCekw1-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DKmnt3-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_VdIzSY-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_VBiF2a-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_ejig8A-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_zmb0bA-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_SI1HvD-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_jglzsj-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_QhRlnk-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_npnZyV-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/08/bf9TdKPSlnqFHMaZrC.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_ejig8A-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_npnZyV-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_QhRlnk-640x385.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_yCekw1-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_VdIzSY-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_zmb0bA-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://www.yamu.lk/wp-content/uploads/2014/10/IMG_8198-588x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/06/yimg_mclxUt-600x250.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_yCekw1-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DKmnt3-640x451.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_VdIzSY-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_VBiF2a-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}