{
  "name": "Cafe Francais by Pourcel",
  "address": "48 Park Street, Colombo 2",
  "open_until": " Open 12-2:30 PM, 7-10 PM",
  "telephone": "114502602",
  "description": "Cafe Francais is the only and best French restaurant in Colombo. It's expensive but really high quality dining.",
  "reviews": "Cafe Francais is a strong choice for drinks, wine, and unwinding on a Friday. It ticks pretty much all the boxes for an upscale bar - chill beats, unintrusive crowd, solid wine list. It's also virtually the only spot in the city for proper French bistro-style dining, featuring food curated by the Pourcel brothers.\nIt's been almost exactly 2 years since they set up shop in Colombo's chic Mews strip, and our experiences have been alright, but not as glowing as Indi's opening review. Restaurant's complacency? Or just lack of the novelty factor? We're not sure.\n\nYou're looking at an easy 10k for a meal for two at CF, which is undoubtedly steep for Colombo. However, Chef Camille Martin appears pretty keen on ensuring quality produce and preparation are in play, so it may be worth the experience\nyou're loaded and fairly keen on cuisine from the South of France (think olive oil, fresh produce, sun dried tomatoes, that sort of thing). We have had awfully lacklustre meals here too - so keep in mind there's some inconsistency.\nWe opened with a Crab Cannelloni (\n) to share. At Rs. 1290, it wasn't a steal, but it was delicious. The bisque was a happy addition, a frothy, deeply flavoured seafood concoction that served the cannelloni well. There was a generous amount of meat in the steamed roll too, delicately spiced and steeped in the soup.\nIf you're keen on bread, their bread bucket is massive - big enough to keep two hungry people satiated pre-dinner, albeit a little dry. I do think they should inform their clientele that the accompanying condiment isn't butter but a chicken liver pâté of sorts, to avoid confusion and grief with vegetarians/ vegans.\nDeciding to step away from our usual tuna tartare main, we opted for a Cafe Francais Beef Burger (Rs. 1990) and the Three Fish Bourride (\nat Rs. 1490).\nThe burger sported a solid portion of ever-so-lightly spiced meat, fresh tomato, and melted cheese, teamed with fries and rocket salad. The meat itself was succulent, soft, and incredibly juicy - but could have done with more seasoning, even by European standards. The salad was fresh but uninspiring, with just a light smattering of olive oil and a vague trace of vinaigrette gracing the arugula. The fries were light, crispy, and hand-cut, but the bread used was again a little too voluminous and not arrestingly fresh. Worth Rs. 1990++ though? Probably not.\nI generally opt for seafood when dining out (we're on an island, yo), so the three fish was a treat. I expected the bourride to be more of well, a bourride (\n) though. I asked the waiter a couple of times about this, but he insisted this was their bourride, so I went with it. While I did taste the aïoli and what I assume was white wine reduction in the smattering of sauce, it was well removed from a traditional French bourride.\nThe quality of the seafood was undeniable and worth the price tag, a selection of medium-sized peel shrimp, salmon and what I assume to be modha, paired with saffron-infused potatoes and a light topping of julienned carrots. I particularly enjoyed the chewy little bits of sun-dried tomatoes, it offset the pescetarian plate pretty well. Overall, a good dish, but not what I (or the menu) had in mind.\nWe opted for a dessert, a charming confection belied by its boring moniker, Chocolate Mousse (\n). At Rs. 790, it was a proper smorgasbord of chocolate variants - homemade ice cream, mousse, meringue, and what I took to be a lighter mousse of sorts. Surprisingly filling, this feels like a tasting platter, which justifies its pricetag. I'd recommend this over their crème brûlée, which has generally been served far too cold to let its flavour shine through.\n\nGiven the relative inconsistency of their food over the last year or so (based on our numerous personal experiences as well as the YAMU user comments you'll see below), CF has slipped from being known for their restaurant to being known for their bar. Chic, dim, ambience, little clusters of seating, and generally good non-mainstream tunes, it's usually a guaranteed good time.\nWe usually opt for a bottle of wine here, since they've got an entire wine cellar stocked with a variety of French options (including a relatively cheap and charming rosé - the name slips my mind). This time, we decided to sniff around their cocktails. A Watermelon Martini and Peach & Cinnamon (both Rs. 1190) made it to our tables, both expensive, both interesting.\nI personally enjoyed my martini a lot more than the peach drink. Fresh watermelon, plenty of booze, this was a super simple, super summery cocktail that was absolutely not worth Rs. 1190++. The peach was a little too watery for us, the flavours didn't really come through, and we nursed it for about an hour. I'd recommend sticking with the fabulous wine selection here.\n\nThe service has never been amazing at the restaurant, especially in comparison to your average Lankan waiter's effusiveness. These guys don't really engage, ever ask how your meal is, or check on you. The bar staff is a little more enthusiastic, I've usually been seated very quickly even on busy days and served within a couple of minutes.\nThe dishes came out quickly enough, and the waiter could recommend dishes to us, which I appreciated. Apart from that, they sort of leave you alone (which is good if you're on a date, bad if you're on a quick business lunch).\n\nWe've always liked the ambience here. From the dim lighting and the lovely wine cellar, to the upbeat music and muted decor, the bistro vibe is great.\nYou can't fault the superb location on the buzzing and elegant Park Street Mews either.\n\nWe do frequent Cafe Francais fairly frequently, but it's only for their breakfast menu (\n), or for a weekend evening wine & wind down. Their food can be a hit or miss, and we feel like that's not a gamble everyone's willing to make with 10K or more. On this instance our bill, with service charge and taxes added on, came to Rs. 9892. Acceptable for fine dining, but not quite acceptable for a bistro or cafe in Colombo.\nA chic bar and restaurant on the Mews strip\nCafe Francais is an amazing, international quality French restaurant. Not cheap, but worth every Rupee.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/cafe-francais-by-pourcel/review-125359",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_hu4ziF-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_M9jha9-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_PQpT7h-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_FRScw9-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_PM0RAh-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_Dm80W1-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_DaXJRw-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2014/11/yimg_UD0GN8-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2014/11/yimg_64gkmm-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2014/11/yimg_1mkZ9J-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2014/11/yimg_baAuY8-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2014/11/yimg_GB39sm-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2014/11/yimg_DShEv3-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_544awq-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_ILYWJt-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_0jM8Jx-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_J5s3Cz-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_sNXpw5-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_6i2UsC-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_jwuKwH-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2014/11/yimg_qoCTTf-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2017/04/KE2F77hW9uoRt7RHja.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_FRScw9-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_544awq-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_Dm80W1-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_PM0RAh-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_PQpT7h-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_sNXpw5-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_ILYWJt-640x398.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_J5s3Cz-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_M9jha9-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_mOENRl-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oKIYgP-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2015/07/uzI50We9CRr1yYpFEF.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_hu4ziF-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_M9jha9-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_PQpT7h-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_FRScw9-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}