{
  "name": "Cafe On The 5th",
  "address": "108 5th Lane, Colombo 3",
  "open_until": " Open until 11:00 PM",
  "telephone": "0112573765",
  "description": "Cafe On The 5th has been a local favourite for years, serving tasty food in a comfortable al fresco style atmosphere. Their quality has taken a nose-dive recently, though.",
  "reviews": "The Cafe on the 5th has been the standard spot for aunty lunches for years on end now. It started off really well with their range of interesting pastries and desserts but our last visit proved that the quality of cuisine has plummeted into the void.\nAt first glance it's a pleasant and appetising sight to witness their interesting range of pastries, pasta and desserts. But all that excitement will soon be doused the moment you bite into one of their possibly two-day-old cakes or their soggy eclairs.\nI opted for the Mutton Macaroni (Rs. 500) and I immediately knew something was up when the pasta was in fact Penne and not Macaroni. I decided to brush that aside and get on with my meal anyway but lo the pasta was heavily undercooked, still cold from being in the fridge too long and drowning in sauce. A large hunk of stale mozarella rested atop the pasta and there wasn't a hint of mutton except for a few pieces of some unidentifiable meat. Nothing is as disappointing as the fact that I spent Rs. 500 on this dish.\nOne of my pals got the Vegetable Pasta (herbivores, pfft) which comes at Rs. 350 and alas, the pasta still retained the same undercooked and cold guise as the Mutton 'Macaroni'. Surprisingly, it tasted like it had been cooked in vegetable stock, and the vegetables were fresh so that's a plus point right there. Is it worth Rs. 350? Certainly not.\nThey have some sort of special grill gig going on for lunch and dinner which is why people still flock to this place for a quick meal. There's an extensive menu ranging from rice to noodles to kebabs depending on which day you choose to go. We got a Mongolian Mixed Grill Rice (Rs. 450) which supposedly comes with all types of meat but digging through the grains we were lucky to come across maybe a tiny crumb of fish or chicken. That being said, the rice itself wasn't bad at all and if you're really hungry this is worth the price since it's a large portion. I must admit that we were told by the chef that the rice is freshly made, but it was cold so I don't know what happened there.\nThe Chocolate Chip Cake (Rs. 140) was a modestly sized slice of cake well worth the price but obviously stale thanks to its hard and crumbly texture. The icing was bland and the few chips sprinkled on top did little to salvage the cake but by that time we were still reeling from the terrible food so we didn't notice it that much.\nOnce upon a time the Cafe on the 5th was known for its divine eclairs, fresh out of the oven and topped with decadent chocolate and oozing with rich cream.\nNot anymore. The Eclair (Rs. 90) was the biggest let down of all. Now a sad, soggy shell of it's once former self the eclair was not only stale but the chocolate tasted heavily of margarine which goes to show that they don't even attempt to disguise the margarine with the strong chocolate flavour they once took so much pride in. The filling was also rather bland and there wasn't much of it. There was a lot of sadness though.\nTo wash it all down, we got two drinks from their dispenser: Iced Coffee (Rs. 120) and a Fruit Drink (Rs. 90). The Iced Coffee was alright although you can\n(I'm not even joking). The fruit drink was just a few tablespoons of water dissolved in some Sunquick so that was that. Both drinks seem to have been churning in the dispenser for quite some time, but do get the fruit drink if you're feeling particularly hot and bothered and in desperate need of some diabetes.\nPerhaps the reason why a lot of people seem to go here is because of their rather charming al fresco dining area. With sunlight seeping through the leaves this is actually a really nice place to sit down and have a têtê-a-têtê whilst sating the roars of your rumbling tummy. It doesn't get too hot thanks to all the fans in rotation so now you know how the posh ladies keep their makeup in place before picking the kids up from the nearby Colombo 07 schools. There's a lifehack for ya.\nThe whole process is pretty much over-the-counter and there wasn't a single waiter in sight. But the people over the counter are pretty fast and it didn't take much time for us to receive our platefuls of food.\nThe overall experience we had here was pretty bad and I honestly wouldn't recommend you go here specifically to have a meal. However, if you're in the area and want a quick bite and a drink by all means try one of their pastries or sandwiches. Don't spend too much here though because it's not going to be worth it.\nThe Cafe on the 5th has been the go to spot for many after-school outings and a watering hole for many mums waiting to pick the kids up. Recently though, they've slowly receded into the nether in terms of quality so our experience here was disappointing all the way.\nCafe On The 5th is a local favorite for good reason. They serve filling, tasty food in a comfortable al fresco style atmosphere. They do good short eats and eclairs as well.\nCafe On The 5th serves reliable Sri Lankan fare in an nice, open setting. They have short eats, biriyani, fried rice, Mongolian BBQ, etc. They also sometimes serve kottu and hoppers during the day, which is rare.\n\nමතක ඇති කාලයක් තිස්සේ කුරුඳුවත්තෙ පස්වන පටුමගේ කන්න හොඳ තැනක් කියල කැෆේ ඔන් ද ෆිෆ්ත් ප්‍රසිද්ධ වෙලා තිබුණා. දැන් නං තත්ත්වේ ඊට හුඟක් වෙනස් කියල තමයි කියන්න තියෙන්නෙ.\n\nකැෆේ ඔන් ද ෆිෆ්ත් විශ්වාසදායක ශ්‍රී ලාංකික කෑම කදිම එළිමහන් අවන්හලක පිළිගන්වනවා. එතැන ෂෝර්ට් ඊට්ස්, බිරියානි, ෆ්‍රයිඩ් රයිස්, මොන්ගෝලියන් බාබික්යු වගේ දේවල් හදනවා. එතැන සමහරදාට දවල්ටත් කොත්තු, ආප්ප වගේ දේවල් හදනවා. ඒක හරි දුර්ලබයිනේ.\n\nකැෆේ ඔන් ද ෆිෆ්ත් (Cafe On The 5th) විවෘත පරිසරයක විශ්වසනීවය ලාංකික ආහාර පිරිනමන හොඳ තැනක්. ඔවුන් ළඟ තිබෙනවා, බුරියානි, ෆ්‍රයිඩ් රයිස්, මොංගෝලියන් බාබකියු ආදිය. සමහර දිවා වෙලාවට ඔවුන් කොත්තු හා ආප්පත්  පිරිනමනවා. ඒවා ඒ වෙලාවට ලබාගැනීම අමාරුනේ.\n",
  "yamu_rating": "We don’t like it",
  "url": "https://www.yamu.lk/place/cafe-on-the-5th/review-151276",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_1aReg8-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_MQFFUZ-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_gVR93J-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_biXP7Q-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_Lhcbsf-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_I2Gg9H-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_Zlg93T-150x100.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/02/DSCF1783-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/02/DSCF1777-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/02/DSCF1775-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/02/DSCF1773-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/02/DSCF1768-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/02/DSCF1767-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/02/DSCF1779-150x105.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_zKG6AF-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_7FxBvO-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_6wk4Gi-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_jtJOQ0-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_pfnH9E-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_fpq6Um-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_8G9JW1-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_idjZyr-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_cQyxzR-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_fCFp9i-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_1uHCTf-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_VDj9DJ-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_BdJA6w-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2017/01/sFOlV64o5GU2djDVqy.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_1aReg8-640x509.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_MQFFUZ-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_fCFp9i-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_biXP7Q-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_BdJA6w-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_VDj9DJ-640x447.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_gVR93J-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/12/yimg_GdoPPK-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oKIYgP-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_1aReg8-640x509.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_MQFFUZ-640x427.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_gVR93J-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_biXP7Q-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}