{
  "name": "Cafe Fort ",
  "address": "No.124, York Street, Colombo 01",
  "open_until": null,
  "telephone": "0774292457",
  "description": "A surprisingly  decent little cafe that's been around for a while located right next to the Dutch Hospital in Fort. They serve up some good rice and curry so it's a nice place to drop by when you're around the area during lunch time.",
  "reviews": "The Cafe Fort has been around for a while exhibiting a large red sign that you cannot miss. It's a nice place to grab some rice and curry for lunch or some snacks if you're in the area.\nVishvi and I headed in at lunch time which was perfect because they were just starting to bring out the food. There's a serving counter where they've displayed fried rice, normal white rice and biriyani. The curries were a well prepared beetroot curry, dhal, raw\n(winged bean), some well cooked chicken curry and poppadoms on the side.\nI decided to get the biriyani (Rs. 300), which comes with a hard boiled egg, fried chicken along with a small helping of mango and mint chutney. There's also a few chunks of potato buried here and there which made me really happy. The rice itself is rather bland, but it's still good value for money at Rs. 300.\nThe Rice and Curry (Rs. 200) was a winner with the rice being cooked just right, and all the curries on the side freshly prepared, seasoned well and balanced out. The best part about both portions was they're perfect for one person and quite filling.\nWe got a Mango Lassi (Rs. 200) to wash it all down and while it was nice it was a little too thick and not exactly what you feel like drinking after a heavy meal of rice and curry. I was expecting a more crisp, tart taste but the heavy feel of this drink is just off-putting.\nThey also have a few short eats up for grabs like the usual patties, samosas, egg buns and the like. Also what's interesting is they have little cups of packaged Wattalappan and Gulab Jamun sold for about Rs. 50+ upwards.\nThe cafe is actually a wonderful place to rest up at if you've been walking around under the hot island sun and need quick refreshment. It's really cold inside thanks to 3 air conditioners on full blast so it doesn't get hot. There's also ample seating, and the service is efficient with waiters filling up sugar bowls and bringing you your food fairly quickly.\nHonestly I can't find anything wrong with the place save for the occasional rogue fly that buzzes around you if the door is left open too long. The food's fine and quite cheap, especially if you want to skip the exorbitant Dutch Hospital prices. So now you know where to pop in if you've been sauntering around Colombo 01 on a sunny day!\nCafe Fort is a popular refreshment spot for tourists, locals and people from all walks of life. It takes the term 'cool spot' to a new level with its wonderfully air-conditioned interior.\n\nපොකට් එකට බරක් නොවී බඩ පුරවගන්න හොඳ තැනක් තමයි කැෆේ ෆෝට් එක. අනික මේක ගිනිගහන මද්දහනේ වුණත් ඇවිදින්, කූල් එකේ කෑම ගන්න පුළුවන් තැනක්නේ. කෑම බීමත් බහුතරය හොඳයි. කන්තෝරු කෑම පැයේ යන එන කෑම කඩවල් අතරට, මේකත් එකතු කරගත්තොත් පාඩුවක් වෙන එකක් නැහැ.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/cafe-fort/review-146141",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/11/yimg_Ffuk5F-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/11/yimg_BzeP8G-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/11/yimg_dDvNQu-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/11/yimg_KUCWMH-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/11/yimg_oPVN0A-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2017/01/sFOlV64o5GU2djDVqy.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/11/yimg_Ffuk5F-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/11/yimg_dDvNQu-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/11/yimg_KUCWMH-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/11/yimg_oPVN0A-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_zizgop-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_KNwFTs-600x250.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/11/yimg_Ffuk5F-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/11/yimg_BzeP8G-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/11/yimg_dDvNQu-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/11/yimg_KUCWMH-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}