{
  "name": "Cafe Beverly ",
  "address": "475/C, Sri Jayawardenapura Mawatha, Rajagiriya",
  "open_until": " Open 11.00AM to 11.00PM",
  "telephone": "0112888686",
  "description": "Cafe Beverly is a comfortable, affordable dining space in the premises of the Beverly Street shopping complex in Rajagiriya. ",
  "reviews": "Cafe Beverly is a very cosy dining space inside the Beverly Street shopping complex in Rajagiriya. If you're in that part of town, it's not a bad place to chill out and grab a meal - the food is well done, the milkshakes are great, and it's not too costly.\nThe menu here is a wide assortment of randoms - you get burgers and sandwiches, then some Thai and some Indian too. As the name suggests, there's a cafe vibe to the place, doesn't feel like serious dining. Not expecting much, we randomly asked for a plate of cuttlefish in tamarind sauce.\nThese guys get points for presentation with every plate. The cuttlefish arrived in a little bowl and right on the bat it looked and smelled very appetizing. There were about ten pieces in the dish, for Rs. 570, and they came curled up in fried onion, golden-brown crisp and smothered in that lovely sweet tang of tamarind - we whacked it all in one go. Really good stuff, would recommend you get the cuttlefish here if you're visiting.\nThen our bistro seafood burger arrived. Again, very cute presentation for a shopping complex cafe - love the fries on this one, very crispy and tossed in a bit of chilli. The burger wasn't astonishing or anything, the bread and the fillings were dry and separate (as opposed to good, moist compositions like the ones at Rocket Burger and Streat360), but still, the meat was tasty and fine and it's not a bad choice for a quick snack. For Rs. 560, this is a pretty filling meal.\nWe also got some classic fish and chips, for Rs. 570. The fillet was wonderfully soft and well seasoned with a very thin crisp skin, went well with the coleslaw and mayo. These guys take special care of their meat servings.\nThere's also a wide range of drinks available, cocktails, shakes, et al. Very few cafes do drinks that stand out, but our Tropical Cooler was really well put together. It cost just Rs. 200 and is a thick shake of mango, passion fruit and strawberry ice cream. It was milky with all the flavours coming out strong, especially the creaminess of the ice cream and the passion fruit. This is a good place to kick back and just have a drink in the middle of a hot day.\nRight smack in the middle of the crazy traffic in Kotte between KFC and Keells is the big Beverly Street shopping complex. It's a hot and bustling space, but as soon as you walk up the stairs and into the cafe, you're suddenly cocooned inside A/C, clean cane and green all around. It's a pleasant and quiet place and I can imagine going back with friends for some cuttlefish and milkshakes.\nService was good during our visit, with the manager himself attentive to customers, and dishes arriving in a few minutes from the kitchen, whose chefs you can watch through an open counter. Also on a side note, they've got clean, nice bathrooms here, which is always a plus point at busy diners.\nCafe Beverly is good at what they do. The food wasn't mind blowing, but the stuff we ordered from their wide range was tasty and made us happy. The mains here are for around Rs. 550 and the drinks at around Rs. 200, and considering the care put into the food and the portions, we wouldn't complain about it. If you're in the neighborhood, it's a good place for a quiet meal.\nCafe Beverly is the comfy, cosy dining space inside the Beverly Street shopping complex in Rajagiriya.\n\nකැෆේ බෙවර්ලි එකේ සර්විස් එකත් ගොඩක් හොඳයි. කෑම බීම ටික පටපට ගාලා මේසෙට එනවා.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/cafe-beverly/review-43932",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_H9kqxd-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_qOPX43-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_SJFqHC-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_9ZtfuK-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_vW5UyH-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_ndrj5h-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_S627xi-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_3eux2a-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_GuP8n6-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_5rVVYf-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_7aueES-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_R9h6tD-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_DnHsDC-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_3Pzijr-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/Be7FWdmIZXRAmC8tEt.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_SJFqHC-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_vW5UyH-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_ndrj5h-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_9ZtfuK-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_S627xi-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_3eux2a-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oKIYgP-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_mOENRl-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2016/07/hWQgEXtURO4xzEhwiE.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_H9kqxd-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_qOPX43-640x370.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_SJFqHC-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_9ZtfuK-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}