{
  "name": "Cake Whisperer",
  "address": "253/1, High Level Road, Kirulapone",
  "open_until": " Open 9.00AM to 9.00PM",
  "telephone": "0774944222",
  "description": "Cake Whisperer is yet another good Colombo home-baker. They do simple, sweet cupcakes mostly - some of the best butter-cream frosting ones we've had. ",
  "reviews": "Cake Whisperer is a home-baker who specializes in a small menu of cupcakes mostly. They're only a few months old at the time of writing this review so we're hoping the menu grows in time. The cupcakes are good - simple, fluffy and perfect as party food. If you like butter-cream frosting as much as I do, these guys do a great job at the stuff.\nSince the place is still young, they've got only a handful of options - chocolate, chocolate chip, vanilla, coffee, and basic frosting options of buttercream, chocolate and recently, interestingly enough, avocado. They also just do a butter cake at the moment. Watch\nand\nfor developments in the menu.\nIn the cupcake department, save for the coffee, we tried an assortment of the whole lot. By far, the butter-cream frosting on chocolate chip cupcakes was our favourite: simple, soft to the touch vanilla cake, with little bits of tasty chocolate chips to break up the flavour, and a perfect layer of sweet, creamy butter-cream.\nThe red velvet cupcakes were not as delicious but still good - soft cake, with a good quality swoop of cream cheese on top. In both cases though, we would really love it if they'd use more frosting on the cupcakes.\nI've never had avocado on my cupcake before so our eggless chocolate cupcakes with avocado frosting were interesting to say the least. This is just what it looks like: thick, gooey avocado dripping over the tops of slightly flat lumps of chocolate cake. If you like avocado, and I do, you'll appreciate the strong, rich buttery flavour of the frosting - very cooling and sweet, but we didn't feel it went well with the dense chocolate cake. Would probably be tastier with a vanilla base.\nWe unexpectedly got a bonus complimentary cupcake from the chef: chocolate chip vanilla base, with fudgey frosting. Very sweet and delectable, a treat for any sweet tooth addict with a penchant for chocolate. The cupcakes here, especially the vanilla base stuff, reminded us a little of\nwho won a spot in a little cupcake taste-off we had a long time ago: very simple, fluffy, easy party bites, none of the fancy rich magic that places like\nand\nseem to spin, but still delectable in an understated way.\nWe only spent 1000 bucks on our assortment, delivery charges included. Gone are the days when you could get a cupcake for just Rs. 80, and that was only two years ago. If you're lucky now you'll get a single cupcake for Rs. 150-180. The ones at Cake Whisperer though happily cost us Rs. 100 each, and the delivery cost is judged by the charge on the meter-tuk that brings the stuff (it cost Rs. 180 to Bambalapitiya). The minimum order seems to be about 9 to 15, though they sounded flexible about it, and they're quite assortment-friendly so it doesn't have to be 9 of the same type of cupcakes.\nCupcakes are some of the best things about the food scene in Colombo if you ask me, and we're more than glad to see new bakers who are doing it right. Cake Whisperer though very simple and understated in baking style, is one of the tastier and affordable ones, and I can see these disappearing quick at any event.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/the-cake-whisperer/review-51222",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_1KMBth-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_reNBSe-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_LlJWbh-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_fOCROI-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_KSJCDZ-150x100.JPG",
    "https://www.yamu.lk/uploads/dp/2015/06/Be7FWdmIZXRAmC8tEt.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_1KMBth-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_reNBSe-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_KSJCDZ-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_LlJWbh-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_fOCROI-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_vPnIsi-600x250.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_EJ4Igt-600x250.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_1KMBth-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_reNBSe-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_LlJWbh-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_fOCROI-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}