{
  "name": "Calorie Counter",
  "address": "61, Thimbirigasyaya Road, Colombo 05",
  "open_until": " Open until 09:30 PM",
  "telephone": "0112580980",
  "description": "Calorie Counter with its emphasis on healthy eating was one of the best new additions to Colombo's restaurant scene in 2015. Now they've gone a  step further and introduced a pretty comprehensive breakfast menu, most of it actually tastes pretty great.",
  "reviews": "Calorie Counter with its emphasis on healthy eating was one of the best new additions to Colombo's restaurant scene in 2015. Recently, they also introduced a comprehensive breakfast menu, most of which actually tastes great.\nHealthy eating has picked up a bit over the past few years thanks to the likes of\nand\n. Calorie Counter joined the fray at the beginning of 2015 and impressed us quite a bit on our previous visit. Now, they also serve breakfast starting at 8 AM, with an entirely new menu that has a good variety of veg- and fruit-based dishes as well as options heavy in granola, muesli and oats. Unfortunately, healthy eating doesn't really come cheap so expect to pay anywhere between Rs. 500 - Rs. 1,000 depending on what you choose.\nIf, like me, you're a fan of berry juices, the energy protein booster (Rs. 480) will likely make you very happy. It's a blend of strawberries, blueberries, blackberries and raspberries with red rice milk. Don't expect this to be like a normal shake though, since there isn't any added sugar. There is, however, a decent amount of sweetness, all of which comes from the berries.\nThe blueberry granola parfait (Rs. 450) is one of the new breakfast additions and it's quite tasty. Unlike the conventional dessert parfait which has cream, this one features curd layered with overnight soaked oats and blueberries. The yoghurt itself is not sweet, but the blueberries help in that aspect and the granola adds a nice bit of crunch.  This may seem like a small portion for Rs. 450 but that jar actually holds quite a bit. This is very filling by itself.\nThe eggs Benedict (Rs. 650) was the main we chose and it ticked all the right boxes. We also like how they've modified the famous American breakfast dish to make it very healthy. They've pretty much replaced all the components, with smoked salmon being used instead of ham, bagels swapped for healthier multi-seed bread and a creamy avocado dressing replacing the hollondaise, all of it topped with a perfectly poached egg. You could argue that this is barely an eggs Benedict, but we found it be pretty close in terms of flavour.\nDespite the fact that I was pretty stuffed at this point, I also got their nutri breakfast (Rs. 650) to go. We've received a few complaints about their delivery and takeaway not being up to scratch, but we ran into no such issues. This is basically a fruity breakfast with oats. The oats were pretty standard but the fruits were the real winner here.\nCounter is like a small health food cafe. It has room for around 15 diners, but their location at Thimbirigasyaya Junction is very accessible. They've taken some cues from fast food joints and displayed their menu items on the walls with the relevant calorie count for each dish. All in all, it's quite simple but works quite nicely with their theme.\nService at Calorie Counter is also top-notch and very personal. On our first visit, the chef came around to our table to ask how our meal was, so we were glad to see him still doing the same nearly six months later.\nWe're really glad to see that Calorie Counter has upheld the high standards they set for themselves at the beginning of the year. They're also one of the only places to offer a breakfast menu with a focus on health food, so we really hope this kicks off.\nCalorie Counter with its emphasis on healthy eating was one of the best new additions to Colombo's restaurant scene in 2015. Now they've gone a  step further and introduced a  comprehensive breakfast menu, most of it actually tastes pretty great.\nCalorie Counter is a brand new health food restaurant in Thimbirigasyaya.  They serve up some healthy, delicious, low calorie dishes at affordable rates.\n",
  "yamu_rating": "We love this!",
  "url": "https://www.yamu.lk/place/calorie-counter/review-46867",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_qy61eO-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_Bp0HJp-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_el1zBe-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_qShQBV-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_JT5Gz7-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_rs5f8C-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_vJAszX-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_V5lDu1-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_zA82Ti-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_yEJ6lK-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_bPRU2f-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_cfAgI0-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_txRfhW-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_CUykxc-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_8a1qXv-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_8a1qXv-318x480.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_qShQBV-318x480.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_qy61eO-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_Bp0HJp-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_JT5Gz7-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_zA82Ti-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_jbPlMM-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/02/yimg_tsQgvc-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_qy61eO-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_Bp0HJp-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_el1zBe-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_qShQBV-318x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}