{
  "name": "Calorie Counter (Pelawatta)",
  "address": "410, Pannipitiya Road, Pelawatta",
  "open_until": " Open 6.30 AM - 10 PM",
  "telephone": "112785454",
  "description": "Calorie Counter's now in Pelawatta and with it they've introduced a bunch of new healthy dishes and desserts. ",
  "reviews": "Calorie Counter's now in Pelawatta and they've introduced a bunch of new healthy dishes and desserts. They'd already set the bar pretty high for themselves with their Colombo branch, but they actually managed to do better at Pelawatta.\nCalorie Counter started the year off with a bang when they first came on to Colombo's restaurant scene with their healthy theme and calorie count for each dish, using healthier ingredient alternatives as often as possible. While their first restaurant in Colombo was a modest space, the Pelawatta branch is much larger and with an extended menu which now also includes some interesting healthy desserts.\nThe prices are on the mid to high end, so expect to pay around Rs. 800 - Rs. 1500. They've also got a some new sandwiches and wraps under Rs. 300 for those looking to grab something quick for breakfast. The only issue for Colombars is getting to Pelawatta, and while my commute did take quite some time, it was still worth it.\nI went ahead and tried four new additions to the menu, starting off with the blueberry muffin smoothie (Rs. 550, Cal-313). This one is definitely pricey but it's also their most expensive drink. After travelling in the midday heat this really hit the spot, striking a perfect balance between freshness and creaminess. They don't use sugar in any of their dishes, instead opting for bee honey as a natural sweetner. In this case, the sweetness was just right, not too overpowering so the flavour of the blueberries really came through. There isn't honestly much muffin going on in this one, but the thick consistency makes up for it.\nI prefer fruity salads, so I went ahead got the citrus, strawberry, avocado and orange salad (Rs. 680, Cal-306). Despite what the name suggests, there's a lot more going on in this salad, besides just those fruits. This comes with bunch of greens, onions, salad leaves and chunks of mozzarella, topped with a sweet tomato sauce. That last addition may not be for everyone though. That being said, the other elements of the dish complement each other well with the avocado and mozzarella adding the creaminess, counteracted by the freshness and acidity of the strawberries and orange segments.\nThe shakshouka (Rs. 800, Cal-472) was recommended to me by a few peeps so I had to give it a try, and I'm really glad I did. Shakshouka is quite a popular dish in Mediterranean and Middle Eastern countries like Tunisia, Algeria and Egypt. Putting it simply, this shakshouka was a combination of chicken and homemade tomato sauce, topped with eggs and a few rosemary sprigs. It's served with kurakkan bread and salad so this was actually really filling. It does take a bit longer to be prepared, however, since it needs to be baked. The real flavour in this one comes from that homemade tomato sauce which had a great balance of sweetness and spice, with the thick consistncy helping it really bind to the chicken and bring the dish together. CC is also pretty much the only restaurant in Colombo that we know of that offers shakshouka.\nCalorie Counter didn't really have desserts for a while, but now they've introduced a few, which seem to be very well thought through. Due to my affinity with strawberries, I got the frozen strawberry yogurt (Rs. 300, Cal-112). This was a brilliant way to end the meal; it was refreshing and adequately sweet while still being smooth and rich.\nThe new Calorie Counter is a two storey building, with the dining area on the ground floor and a hangout space on the first floor. They've gone with a brown-white colour palette that works surprisingly well with white-washed wooden furniture, what seemed like hardwood (or pseudo hardwood) floors and wooden counters. They've also got a much larger kitchen, so we saw around six dishes going out together. Most of their salad ingredients are also on display at the counter so that you can see how fresh the veggies and fruits are before ordering.\nWe've been to Calorie Counter a whole bunch of times this year and the service was never an issue. From the look of it, they've moved some of their more senior staff to overlook service here. All our dishes were served in about 15 minutes with each course following the other. This time around I dropped in around noon and the place was actually quite packed when I arrived (photo was taken right before leaving). For the first time since Gallery Cafe, I was pretty much the only local customer there; though I was told that was because of CC's proximity to Overseas International School.\nOpening two restaurants in one year is no small feat, and Calorie Counter has somehow managed to raise their lofty standards. Pelwatta can be a bit tedious to get to but it's definitely worth it once you get there. Healthy food that tastes great is tough to pull off but Calorie Counter does it better than anyone right now.\n",
  "yamu_rating": "We love this!",
  "url": "https://www.yamu.lk/place/calorie-counter-pelawatta/review-70267",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_jbPlMM-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_28wjB8-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_bljmQC-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_jtmgwg-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_QbqxrQ-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_6o1gYL-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_mb5yqy-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_0d6ug3-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_wMqNVT-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_QbqxrQ-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_mb5yqy-318x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_bljmQC-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_jbPlMM-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_28wjB8-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_wMqNVT-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_jtmgwg-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/02/yimg_tsQgvc-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oKIYgP-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/user/2017/11/D9kbg67WmQOH999SyF-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/user/2017/11/D9kbg67WmQOH999SyF-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_jbPlMM-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_28wjB8-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_bljmQC-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_jtmgwg-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}