{
  "name": "Carino Ice Cream",
  "address": "30-A Welikadawatte Road, (Off Nawala Rd.) Rajagiriya",
  "open_until": " Open Factory  Pick Up: 11 AM to 5 PM Tuesday - Saturday",
  "telephone": "112888540",
  "description": "With both selling their goods on the open market the stage is set for open confrontation. It;s the established Corleones (Il Gelato) vs  the up and coming Tattaglias (Carinos) and of course YAMU is caught in the cross fire.",
  "reviews": "Carino's is Sri Lanka's only artisanal ice cream brand that's actually available standardized in supermarkets and the like. They do some stellar ice creams, now under a variety of sub-categories like Crème, Sorbet, After Dark, and Addict. There's also an elusive frozen yogurt selection that I've never been able to get my paws on.\nCarino's ice cream is pretty well known for its sheer creaminess and freshness of flavour. It is incredibly rich and creamy though, so don't expect to be able to eat as much in a sitting as you would of normal mass-produced ice cream. Here's an overview of the ice creams we tried in order of our favourites:\nWe're all massive salted caramel fans as it is, so this may have been a marginally biased decision. This particular flavour is actually what introduced me to Carino's in the first place. Part of the Crème sub-category, it's a thick swirl of cream and milk all whipped together, with the sweet caramel beautifully offset by the salt. I personally felt they could have been bolder with the salt usage, but that may not appeal to the average Lankan palate that favours the saccharine. Also, this one melts crazy fast so watch out.\nPart of the After Dark series, this one smelled and tasted LITERALLY just like Bailey's (not gin, as the video erroneously claims). The box didn't specify whether there was actual alcohol used, but the higher price and the accurate taste made us assume so. It's pretty great all melted, it tastes like a sinful Bailey's milkshake.\nA fresh, summery burst of tart flavours, this guilt-free sorbet selection was a welcome respite from the March heat. It does need to be had ice cold or it turns into slush. We tried keeping it in the office fridge, which was a huge fail as it transformed into incredibly tart lime juice. We drank it in turns and grimaced. The flavour here is very strong though, so unless you're a citrus fan, I'd skip it. Points for being devoid of added fats though!\nWe didn't give this the lowest ranking because there was anything wrong with it, more just that it was standard and straightforward. Essentially equal to Elephant House's premier range, so it didn't quite justify the Rs. 900 price tag like the other unique flavours we tried. However, we did like their generosity with the white chocolate shavings throughout!\nYou can currently get a tub (or two, or ninety) at Arpico Hyde Park Corner , the Good Market store, and their Creamery in Rajagiriya. As far as we remember, Paan Paan also stocks some but this may be subject to availability.\nThey don't use additives and preservatives, which is great health-wise and taste-wise but pretty bad for its consistency because the ice cream will melt en route from the Arpico freezer to your car. There's a solid amount of cream and milk in there, so it's understandable.\nMost of the tubs are Rs. 900 a pop, for 500 ml. The After Dark tubs are marginally more, at about Rs. 1050. Prices are a bit steep, but it's worth it for the quality of produce. If you go to either Arpico or their outlet, get ready for an onslaught of choice. As far as I could tell, there were at least 40 different flavours. Good luck experimenting!\nSure, it's a little pricey for a 500 ml tub of ice cream, but we think Carino's flavour and dedication to quality justify what you're paying. Depending on what you're looking for (a guilt free treat or a totally dedacent pseudo alcoholic dessert or just some sheer creaminess), you can choose your category and then go on to choose from a smorgasbord of flavours.\nThe island's premier artisanal creamery, with a crazy number of flavours.\nWith both selling their goods on the open market the stage is set for open confrontation. It;s the established Corleones (Il Gelato) vs  the up and coming Tattaglias (Carinos) and of course YAMU is caught in the cross fire.\n\nඔවුහු දැන් ඔන්න ඉල් ජලාටෝ නොපැතිරුණු කලාප කරා සිය ආධිපත්‍යය විහිදුවන්න පටන් අරගෙන. කැරිනෝස් දැන් තිබෙනවා ලන්දේසි රෝහලේ හෙළදිව් තේ සමාජයේ සහ ලන්දේසි බර්ගර් සමාජයේ නව VOC කැෆේඑකේ.  විවෘත වෙළඳපොළේ සිය නිෂ්පාදන අලෙවි කරන මේ දෙගොල්ලෝ දැන් එළිපිටම යුද්ධයට සූදානම්.  මේ අහිංසක 'යමු' ඒ යුද්ධයට මැදිවෙලා.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/carino-ice-cream/review-89133",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_jwTVV6-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_HNwRd1-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_uAh0Ml-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_0K664k-150x100.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/11/IMG_4852-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/11/IMG_4851-e1352953960179-150x105.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_O0Wyig-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_eReAOo-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_nN8w4z-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_tGsolL-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_6MS5MP-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_5GeGdh-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_DNycwX-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_3FpT6B-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_iXOLsW-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2017/04/KE2F77hW9uoRt7RHja.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_HNwRd1-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_nN8w4z-640x536.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_eReAOo-640x494.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_0K664k-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_iXOLsW-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_5GeGdh-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_7G4f7L-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_V4qhlX-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_jwTVV6-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_HNwRd1-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_uAh0Ml-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_0K664k-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}