{
  "name": "Ceylon Tea Lounge",
  "address": "No 281, Ground Floor, R A De Mel Mawatha",
  "open_until": " Open until 10:00 PM",
  "telephone": "0115929529",
  "description": "The Ceylon Tea Lounge serves up a bunch of different types of teas and sandwiches. ",
  "reviews": "The Ceylon Tea Lounge is Colombo's newest addition to the multitude of Tea Lounges that have surfaced over the years. It's a fairly posh, beautifully furnished lounge with good service but rather underwhelming tea and food.\nWe got a pot of Ceylon Chai (Rs. 400), a glass of Thai Style Iced Tea (Rs. 400), the Lounge Special Iced Tea (Rs.  400) and the English Muffin (Rs. 550) which comes with the option to choose your own tea as an accompaniment. We opted for the Ginger Hot Tea.\nThe Ceylon Chai comes with a small pot of milk should you wish to switch things up a little. It's basically a milder version of your average Masala Chai with small notes of cinnamon and clove seeping through.\n\nThe colour was a light brown and taste-wise it wasn't strong enough to impart any spice. I found it to be a tad watery and it could have afforded a few more minutes of brewing. The milk was slightly too thick and diluted the spice even further. It's still a bargain at Rs. 400 because you get about 4 servings off one pot.\nThe Ginger Tea which comes with the English Muffin was suspisicously worth the entire meal deal because it was served in the same sized pot as the Ceylon Chai. If you think about it, you're getting food as well as a large pot of tea for an all inclusive price of Rs. 550. Strange, but we'll take it.\n\nThe tea itself was a happy surprise with strong notes of ginger and a light undertone of lime. It was a smooth tea, with a darker brown hue. Overall a great remedy if you have a sore throat.\n\nThe Lounge Special was served in a mason jar (SIGH), filled to the brim with ice cubes and about two mint leaves. It tasted strongly of synthetic syrup, which they subdued with a healthy dose of lime. It's also far too sweet. I wouldn't recommend this as a refresher as it made us feel a little sickly after a few sips.\nThe Thai Iced Tea was completely different to what's advertised on their site. We were a little confused as to what it was because traditional Thai-Style Iced tea is served with milk and spice. This one was pretty much the exact same thing as the Lounge Special but with less sugar and more lime.\nThe 'English Muffin' was merely a sandwich with a slice of chicken ham and a fried egg with a slightly runny yolk. Served with generous amounts of fries, fresh vegetable salad and rather tasty scrambled eggs this one's a blasphemous interpretation of the English Muffin, so don't go in expecting a proper dish.\nThe fries were crispy, light and hot-hot. The salad's not half bad either, with fresh greens tossed in a mild vinaigrette dressing.\nThe interior is decorated with plush lounge chairs and warm lighting, giving the place a 5 star hotel lobby look. There are shelves full of colourful Euro Asia tea boxes that are guaranteed to draw the foreign eye. They're still very new, so there are a few setbacks but the place is pretty all the same.\nService is up to par, with the waiters at attention at any given time. Our food was brought to us in about 10 minutes and we were checked on regularly.\nThey were a bit disappointing by not sticking to what was advertised but I suppose that's okay given the fact that they're still taking their first steps. We hope to see an improvement in the coming months, but meanwhile, you could check out their\n.\nThe Ceylon Tea Lounge is Colombo's newest addition to the multitude of tea lounges that have surfaced.\n\nසිලෝන් ටී ලෞන්ජ් එක තියෙන්නේ ඩුප්ලිකේෂන් පාරේ කොල්ලුපිටිය හන්දිය කිට්ටුව. මේකේ ඉන්ටීරියර් එක නම් මාර සිරා.\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/ceylon-tea-lounge/review-185932",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_zytZfT-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_Vwm2RL-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_pcCvy9-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_tc53Gd-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_A5Lm8T-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_3FMYoO-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_vydXiM-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_clEhs9-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_wrP4By-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2017/01/sFOlV64o5GU2djDVqy.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_zytZfT-640x441.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_tc53Gd-640x454.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_A5Lm8T-640x473.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_Vwm2RL-640x451.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_pcCvy9-640x465.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_vydXiM-640x441.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_4jDKkH-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_1fOQlr-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_zytZfT-640x441.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_Vwm2RL-640x451.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_pcCvy9-640x465.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_tc53Gd-640x454.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}