{
  "name": "Ceylon Cafe",
  "address": "39 A, Horton Place, Colombo 07.",
  "open_until": null,
  "telephone": "0777707007",
  "description": "A part of the Grande Gourmet restaurant, now serving Sri Lankan food.",
  "reviews": "39A Horton Place is a place of many mysteries, many monikers, and many cuisines.\ninexplicably serves French, Italian, Malay and Thai food. Ceylon Cafe serves \"kade food redefined\". Vault 07 is a four-fold whammy of \"shisha, bar, club, lounge\". Don't worry, we're confused too - this location's personality is more split than a\n. We checked out the Ceylon Cafe incarnation on this visit.\nThe menu is pretty crab and curry heavy, which is great. Prices appeared to be quite reasonable too, with a curry dish going at about Rs. 300 a pop. We decided to try the Ceylon Ahara Wattoruwa, a Sri Lankan platter for two that goes for Rs. 2310 without crab and Rs. 2900 with crab. Obviously, we opted for the latter.\nThe curries included in the platter came in tiny little portions, but it ended up being more than enough for the two of us thanks to the sheer variety. We got little bowls of shrimp, chicken, fish, beef, paripu, brinjal moju, tempered potatoes, alongside little accompaniments like seeni sambol and pol sambol. They were served with some tame yellow rice and hoppers (we could choose between string or egg/plain and we went for the latter).\nThe curries came out within 5-7 minutes of our order, and some weren't hot at all, so it was clear they had been made well in advance and heated up quickly. The re-heating did make some of the textures a bit rubbery, but the flavours and spicing were both great. Unfortunately, the stale plain hoppers were incredibly hard, almost inedible.\nWhile paying about Rs. 1500 a head for Lankan food is pretty steep, keep in mind that this included a hefty portion of lovely crab curry. While the menu claimed it would be just 250 grams of crab, this seemed like a much larger portion. The curry, the meat, and the heat of the spices were all done well, and it became clear that their crab is the star of the show.\nAfter the full curry spread, we were keen for some Lankan dessert but all they had was their French/Italian/Malay/Thai/Klingon menu. In dire need of something sweet to offset all that spice, we chose the verbose Mint and Vodka Infused Fresh Strawberries with Chantilly Cream at Rs. 525.\nIt turned out to be tart slices of local strawberries on a bed of squashy whipped cream, with some shavings of leaves on top. But hey, I'm not one to complain about a good old strawberry and cream combo.\nThey also have a short drinks menu (which says Vault 07 on it), with the usual spirits and beers (a small Lion at about Rs. 330), and basic cocktails (each about Rs. 1100).\nThe restaurant has been deserted during our visits, probably because of the forbidding interior. From the outside it looks like a harmless Kurunduwatta residence, but that belies the 23 (that's when I stopped counting) hues of paint, plaster, plastic, and glass within.\nDon't let this well-angled photo fool you. From the canary yellow walls to the pink and cream upholstered plastic gold chairs, the\nto brown curtains, it's an unbridled assault on retinas and the principles of good taste. They have, however, removed the painted gold bust of the proprietor from the entrance which was disappointing.\nThe service on the other hand, once we located a waiter, was great. Our waiter was friendly, attentive, and happy to recommend dishes to us.\nWhile this location suffers from a deep and pervasive multiple personality disorder, we really do recommend their crab and service. The hoppers and the ambience are inexcusably offensive though so try and avoid those via crafty menu choices and the usage of sunglasses indoors.\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/ceylon-cafe/review-185943",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_RPBOCH-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_WBlrcl-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_Vlrs1O-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_nt7sj1-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_mzkGIE-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_qpiKpZ-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_hrURWu-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_wajveZ-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2017/04/KE2F77hW9uoRt7RHja.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_qpiKpZ-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_nt7sj1-640x344.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_mzkGIE-640x390.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_WBlrcl-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_RPBOCH-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_hrURWu-640x372.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_wajveZ-640x368.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_Vlrs1O-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_GGYNaT-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_YBjNF1-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_RPBOCH-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_WBlrcl-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_Vlrs1O-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_nt7sj1-640x344.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}