{
  "name": "Chinaman",
  "address": "93, High Level Road, Kirulapone",
  "open_until": " Open until 12:00 AM",
  "telephone": "117364364",
  "description": "Generous portions, fair price and swift delivery make Chinaman good option for office lunch.",
  "reviews": "Hungry with no food from home, a predicament we all find ourselves in once in a while, Aisha and I decided it was time to go out for a review. We were about to step out of the office when Bhagya brought Chinaman to our attention. No, not the riveting read by Shehan Karunathilake, but a brand new Chinese food delivery and take away restaurant. Bundis rumbling, we were quick to make a call and place our order and in about 40 minutes it arrived, and we were quite pleased with what we got.\nThe guy taking the order didn't speak in English, so I had to place the order in Sinhala which was a little difficult as he spoke really fast. Still, I managed to communicate to him that we wanted to try out the set menu fried rice with cuttlefish. We also ordered some kankun, and we asked for a recommendation from the starters and he suggested the chicken spring rolls. And Bhagya wanted to try the pork belly, obviously.\nThough 10 minutes past the promised delivery time, they found the office without the need for too many phone calls and everything arrived as expected. They've got the Chinese food delivery boxes down for sure. Oh, and they give you a complimentary mug with their branding all over it. Which is nice.\nFirst off, they gave us a lot of food! For the price, the two of us were able to fill up without feeling like we were getting ripped off.\nThe spring rolls (Rs. 550) looked oily at first sight, but were actually super tasty and crisp when we bit into them. You get 3 rolls, so it's a bit pricey compared to the other options. This one worked well along with our fried rice since the filling has a lot going on with carrots, cabbage, onions and a decent amount of chicken.\nThe fried rice set menu (Rs 400) came in one neat box, with cuttlefish, chop suey, hot butter mushrooms and chili paste. While the cuttlefish was nothing to write home about, being batter fried and not particularly crisp but seasoned alright, the rest of it really came together. They send it layered so that if you wanted, you could transfer it to a plate without having the elements completely mix.\nKankun (Rs 240) is one of my favourite things about Sri Lankanized Chinese food, which is what these guys seem to do, but this one wasn't so great. It had a mushy garlic paste going on but that didn't really help the cause as the leaves were too wilted and didn't have enough crunch.\nThe pork belly (Rs 650) was a generous portion with a lot of meat and plenty of fatty bits, too, at about a 50-50 ratio. It wasn't aggressively spiced, though there were plenty pepper corns to be seen. We were pleasantly surprised by just how much we got for the price and it didn't disappoint. If you're hungry and really craving pork this will probably work along with some steamed rice since the onions, capsicums and green chilli makes for a good stir fry between them.\nAlso kudos to the packaging which, in our case, held up the delivery pretty well without any spillage. No oil paper either, instead opting for a box with an inner side that doesn't absorb oils.\nWe're happy to know that there's a new delivery service out there that can get food to us in a decent amount of time and not put a massive dent in our wallets. Altogether we spent about Rs 1800, though without the kan kun and spring rolls, it would've come to about Rs 1000. The set menu is a good deal and it can feed two if you're not voracious. Try them out when you forget to pack lunch to work.\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/chinaman/review-94625",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/04/yimg_NPWItc-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/04/yimg_1fVkVS-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/04/yimg_BvQ3d1-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/04/yimg_xnFs92-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/04/yimg_HbhwiO-150x100.JPG",
    "https://www.yamu.lk/uploads/dp/2015/12/0F34X3pTfLr7btifJN.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/04/yimg_xnFs92-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/04/yimg_1fVkVS-640x360.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/04/yimg_BvQ3d1-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/04/yimg_HbhwiO-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/04/yimg_NPWItc-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_wJiQyD-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oKIYgP-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2017/11/C4cTBYs5tKhL2h1qNi.jpg",
    "https://www.yamu.lk/uploads/dp/2017/11/C4cTBYs5tKhL2h1qNi.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/VBxu8OQlwaXM6zpakX.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/04/yimg_NPWItc-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/04/yimg_1fVkVS-640x360.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/04/yimg_BvQ3d1-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/04/yimg_xnFs92-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}