{
  "name": "China Manor",
  "address": "301 A, Maradana Road, Colombo 10",
  "open_until": " Open 11.30 AM - 3PM & 5.30 PM - 10 PM",
  "telephone": "0112444191",
  "description": "China Manor is a new hotel in Maradana with an authentic Chinese restaurant. Their crispy chicken is amazing.",
  "reviews": "China Manor is a new hotel that's opened up at the CineCity premises in Maradana. They've got rooms with hot water and all that, but we went to check out their Chinese restaurant, having heard that it's somewhat authentic. What we experienced, though, was a hit and miss, with poor ordering guided by a somewhat clueless waiter, and most of the menu items being unavailable. Still, if you know your Chinese food, (we're still learning), you'll probably find something good here.\n\nThe menu is massive. It's filled with stories accompanying dishes like Beggar's Chicken, which we tried to order but were informed that it was unavailable. Other items included a dish made of sea slugs (sea cucumbers?), and a herbal tea which, according to the description, even had seahorse in it. Feeling quite let down by the promises made in the menu given that most of what we wanted was unavailable, we decided to ask our waiter for help with our order. This must have been a mistake, since we ended up with quite mediocre items. After making five different orders, all of which wasn't available, we decided to ask one of the Chinese staff, and were informed that \"those herbs are not available in Sri Lanka\". The motif for the afternoon was \"not available\". We were then recommended a generic sweet and spicy chicken, a vegetable dish, and fried rice, \"because Sri Lankan\".\nWe decided to hell with it, and ordered, admittedly a bit haphazardly, and soon arrived our Gela Mountain Spicy Chicken (Rs. 798). Kinda pricey, we got a huge basket of fried chicken with loads of fried red chili. True to its name, it was hella spicy, and definitely one of our favourite fried chicken experiences. The serving is quite plenty, and we feel like three people could manage with it. It's crunchy and not too oily.\nOur less fateful order, the Mutton in Sour Millet Soup (Rs. 1,198) was an enormous portion that could feed 6 people, at the very least. The soup itself didn't feature much millet, instead the consistency reminded us of corn starch. There was a fair amount of mutton in there that added some hearty fattiness to it. We'd recommend trying out the individual portion soups, though. We'd initially wanted that, but it was unavailable.\nThe egg fried rice or Yangzou Fried Rice (Rs. 668) is enough for three people. It's not too oily and there's plenty egg, carrot and corn.\nWhile China Manor is amazing for ambiance, it's really poor for service. They've put a lot of attention to detail, from the hotel lobby to the restaurant, but they seem to have neglected training their staff. The staff are not well-versed with the menu, and our waiter had to constantly move back and forth between the kitchen and our table, only to tell us that none of the dishes we had liked to order were available. They were unable to guide us with our order, and that left us feeling a little helpless and wishing we had Chinese friends.\nDefinitely check this place out if you're looking for a new Chinese fix, particularly if you work around the area. The spicy chicken is amazing. We're still fans of the Min Han experience over most Chinese restaurants in Colombo, though. The restaurant is open for lunch and dinner, and they've got a bit of parking, too. The prices on the menu are not inclusive of tax, so be prepared to spend an extra Rs 500 on VAT and service charge. Two people can eat for about Rs 2500, if you order wisely. Which we didn't. Sorry.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/chinese-manor/review-67536",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_GEyOV6-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_OD5YZK-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_ciMngx-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_3Bj1tU-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_qNHkqc-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_dF5y1s-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_vfpAWl-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_Riks1l-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_kuigi3-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/12/0F34X3pTfLr7btifJN.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_vfpAWl-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_kuigi3-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_ciMngx-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_OD5YZK-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_GEyOV6-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_3Bj1tU-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_qNHkqc-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oKIYgP-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/05/yimg_hwHrWQ-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_GEyOV6-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_OD5YZK-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_ciMngx-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_3Bj1tU-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}