{
  "name": "Choco Luv",
  "address": "16, Flower Road, Cinnamon Gardens, Colombo 07",
  "open_until": " Open until 12:00 AM",
  "telephone": "0112301140",
  "description": "This is a confused place. It's barely got anything to do with chocolate.",
  "reviews": "Choco Luv used to be at Gregory's Road but they shut down some time back. They've reopened, and seem to have a confused menu that has less to do with chocolate and more to do with everything else. (Everything else, read: Kottu, pasta, tea and whatnot).\nThe range of items on the menu left us bemused and in stitches, especially when we saw that they had 'sassy tea'. We ordered it, of course, but alas, they didn't have it in stock. Neither was the rotti and\n(Malay street represent!). So we went for a soursop flavoured tea which didn't have the least indication of being soursop flavoured. It was bubblegum flavoured. We don't know how, but it smelled deliciously and strongly of bubblegum. The smell trumped the taste, but it was a weird drink nonetheless. However, at Rs. 250 bucks (for a little pot of hot water), this is one hella expensive cup of tea.\nThe Spaghetti Ale Oli Chicken (wut?) is a ripoff at seven hundred bucks. It wasn't an offensive dish, having generous strips of chicken in it, but it was a tad too oily and was too little in quantity for that price.\n\n\nThe dish wasn't amazing though, and I'd expect something more for the price.\nMeanwhile, after learning that a few items listed on the menu were unavailable, we moved onto the 'shakes and drinks which were honestly the only chocolatey things available. They don't even have dessert, I kid you not. This is surprising, because of how the Cargills Icecream logos were all over the place on the wallpaper, and how there was this life-sized Cargills cutout in the middle of the dining area.\nThe Hot Mint Melt came with two little cookies and was the best of the lot of which we ordered, which isn't saying much, really. At Rs. 420 it also seemed reasonable. This was thick, very creamy, and had a strong mint undertone to it which was quite refreshing. Sadly, the same can't be said for their Ferrero Fantasy (Rs. 380).\nThis was a decent milkshake on its own, with a strong hazelnut flavour, but it would have been nice if it was garnished with a bit of the chocolate. The texture wasn't too waterish, and this was creamy as well, so it's a semi-win I guess.\nNote that in addition to stuff like kottu and the rotti with\n, they ALSO had Maggie Noodles on the menu, priced at Rs. 400. True that it comes with chicken and seafood, but come on. Maggie Noodles? That thing takes practically two minutes, you can pretty much whip one up at home for a fraction of the cost.\nThe staff were friendly and polite, but there isn't anything particular to say about them.\nDrugged out club music, then slow hiphop beats, then John Legend crooning how all him loves all of you. Snoop Dogg's and Wiz Khalifa's\nwas pumping itself out as we sat sipping out mint hot chocolate and bubblegum-like tea. They had a really mixed/rad/weird soundtrack which was completely out of place for a little restaurant/ cafe (or whatever this eatery is, exactly. It's quite obscure). This is like a little space where very sheltered pre-teens and teens would be allowed to come and hang-out, with a graffiti wall and the wannabe clubhopping music.\nYep. Definitely a place where teenagers would frequent.\nThe music alternated between epic and cheesy, with neither of the two actually fitting into Choco Luv's adolescent atmosphere. Well, the latter, maybe. Here we have a picture of Imaad trying to Shazam it.\nIf you're sneaking a break during your O/Ls or A/Ls, I suppose this is a pretty good spot to get away to. The place is pretty good for a group of friends, though the food is overpriced and not that great. The interior is a bit claustrophobic, so don't go with more than 20 people. They don't have desserts, so we're still confused as to why or how it got its name. The only things chocolatey about this place is the hot chocolate and few of the milkshakes. It's a bit like the mad hatter's tea party, but not in an endearing way.\nThey don't have desserts, so we're still confused as to why or how it got its name. The only things chocolatey about this place is the hot chocolate and few of the milkshakes.\nWe've heard some not-so-great rumors about Choco Luv flying around recently. We dropped by to see if any of the hoopla was true. Sadly, it would seem they are true for the most part.\nSomeone said these guys did a good milk shake so while taking a little walk around Cinnamon Gardens we dropped in for some thick and callorific, barley liquid refreshment.  They've got a pretty distinctive shop front and its great to have another place you can just drop into in Colombo 7 which due to the large distances between shops, and eateries isn't as foot-friendly as it should be.\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/choco-luv/review-63334",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_w8Yrc4-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_dkyxrW-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_daSKop-150x100.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/10/DSCF6071-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/10/DSCF6076-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/10/DSCF6061-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/10/DSCF6080-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/10/DSCF6062-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/10/DSCF6087-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/10/DSCF6060-150x105.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_uSMSGa-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_OSvJ0a-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_5IgR7G-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_MCTVhW-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_vmPEap-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_b5hMVh-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_ekeLLZ-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/08/bf9TdKPSlnqFHMaZrC.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_vmPEap-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_dkyxrW-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_MCTVhW-320x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_ekeLLZ-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_5IgR7G-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://www.yamu.lk/wp-content/uploads/2014/10/IMG_8094-588x250.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_FbLFNG-600x250.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_w8Yrc4-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_dkyxrW-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_daSKop-640x426.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/10/DSCF6071-398x600.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}