{
  "name": "Chop Chop Kottu",
  "address": "1 Castle Street, Colombo 7",
  "open_until": " Open 10 AM–9.30 PM",
  "telephone": "114951515",
  "description": "Chop Chop does tasty, generous kottu all day, via drive through or delivery. Win.",
  "reviews": "Chop Chop does all-day kottu in many interesting ways, plus they deliver. Given that the kottu is tasty and easy to get, this venture by\nis a win.\nSri Lankans love kottu, but for years there has been a kottu commandment that few have broken —\n. Chop Chop breaks this rule, serving the dish from 10 AM to 9.30 PM, This is the\nto make kottu a lunch food, se we'll see how it goes.\nKottu is generally made by starting with copious amounts of oil, salt, MSG and spices in a pan; frying up carrots, onions and other veggies; chopping up\nroti (a kind of flatbread) and then mixing it all together with a meat of your choice, usually chicken. Some places also add cheese and even milk. The result is a bit like a fried rice, except with slivers of flatbread. Pour some gravy over it and you're done.\nKottu is generally eaten at roadside\n, the most famous being the many Pilawoos outlets on the Galle Road. People stop their cars to order and eat in their own vehicle, or sit in the bright and bustling interior.\nThat's how kottu is traditionally done, but it isn't how Chop Chop does it.\nLet's start with the most important thing — this kottu tastes good. There's no point changing the model of something Sri Lankans already love, and the basic flavours are all good here. It's spicy without being incapacitating and the\npieces are infused with the right balance of salt and spices. If you want more flavour, each one comes with a tub of gravy, which we honestly didn't feel the need for.\nWhat Chop Chop changes is: 1) They use a lot more vegetables 2) They offer a different range of meats. At most kottu joints, the veggies are just a garnish and the standard meat is a burnt-to-a-crisp piece of chicken. While they do have chicken at Chop Chop (Rs. 380), they also have innovative proteins like crab (Rs. 420), prawn (Rs. 420) and sausage (Rs. 360). The chicken itself was a bit dry, but that's par for the course.\n\nThe crab was amazing and generous and combines two things Sri Lankans are generally crazy about — kottu and crab. We got cheese with our kottu (Rs. 100 extra), which seeped into the crabmeat, making it a cheesy, gooey mess. You have to use your hands with this one, but it's a good idea. This plus the veg-heavy and flavorful kottu makes for a great combination.\nChop Chop also does string hopper kottu, using chopped up string hoppers instead of\n. Some people find this sacrilegious but I actually liked it. We had the prawn version. This one features little prawns, but they're shelled and bite-sized, and go well with the copious amount of veg and flavourful cut strings. Whether you like string hoppers at all is up to you, but if you do, then this is a good bet. It also feels a bit less filling than the\nversion, but that's deceptive.\nChop Chop, where were you all this while. Now Sri Lankans can get kottu during the day and that too without causing a traffic jam on Galle Road. Chop Chop's kottus are tasty, creative and easy to get. This is a win.\n\nChop Chop does all-day kottu in many interesting ways, plus they deliver. Given that the kottu is tasty and easy to get, this venture by Gonuts is a win.\n\nChop Chop does tasty, generous kottu all day, via drive through or delivery. Win.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/chop-chop-kottu/review-52526",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_elvLWt-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_i21Agt-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_aCBgEu-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_4n19iE-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_ntrvef-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_UMK793-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_XJIe5J-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_bdfPAF-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_HX3nK6-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_mDFAGR-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/07/uzI50We9CRr1yYpFEF.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_elvLWt-640x426.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_i21Agt-359x480.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_XJIe5J-640x479.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_aCBgEu-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/12/yimg_MgvBQL-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_5SnixE-600x250.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_elvLWt-640x426.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_i21Agt-359x480.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_aCBgEu-640x426.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_4n19iE-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}