{
  "name": "CocoCeylon",
  "address": "They're only on Instagram",
  "open_until": " Open Monday to Friday 9 AM - 5 PM",
  "telephone": "0778800434",
  "description": "CocoCeylon is a mysterious business that we spotted only on Instagram. They offer overpriced smoothies and chia puddings.",
  "reviews": "You know how it's hard to find Platform 9 3/4 or Grimmauld Place? How you need to know exactly where to look and exactly what to say in order to make it appear before your eyes, at least in the case of Grimmauld Place? Well, that's exactly how we found CocoCeylon to be – a mystery.\nWhat is CocoCeylon, you ask? Good question. It's a smoothie and pudding business, with nothing to find them by but\nInstagram account with really cool pictures. Honestly, it's those pictures that made us desperate to try them, they just look so good! Buuuut, getting in touch with them isn't all that easy.\nTheir Instagram account provides you their telephone number. But be warned – they just don't answer their phones. We tried them quite a few times over the course of two days, to no avail. And then we commented on one of their IG posts, and... success! They responded!\nSo guys, long story short — Whatsapp them. They don't have a menu online, so we Whatsapped them asking what they had to offer. They sent us a couple of images with the menu items and prices, which we're uploading here because we care about you guys like that.\nLet's talk about service first. The staff are very friendly, but we had a few communication mishaps with them. We were told that we had to pre-order a day before delivery, and then we were told that they'd check with their delivery guys and keep us posted. About five or six hours later, I got a call from the delivery people saying they were close to our office. I'm not complaining, but it was rather unexpected — what if we had left for the day? They Whatsapped me a little while later to ask how our order was, though, so it's nice that they follow up on their orders and all.\nWe ordered the Berry Blend, Chia Raspberry Pudding, and Chia Pudding Happiness.\nWe like the Berry Blend, which was a smoothie made of raspberries, strawberries, blueberries and yogurt. It had a nice, smooth texture and\ntasted as fruity as could be, but I think the predominant flavour\nwas of strawberry.\n\nThe puddings were generous in portion. We were expecting\nraspberries in our puddings but didn't find them anywhere. So if you're looking\nfor fresh raspberries, you're going to be disappointed. I assume they're blended into the mixture, but then again, that's not what we were expecting\nupon seeing the menu. We liked the granola and raisins sprinkled on top,\nand think the raisins added a pleasant chewiness. The cornflakes sprinkled on top added a nice crunch to the chia\npudding.\nPictured above is the Chia Raspberry Pudding. It's filled to\nthe brim with chia and then topped with cornflakes, granola, chopped\nstrawberries and flaxseeds. Getting through this one was a bit of a messy process as the toppings tended to topple over. The same could be said of the Chia Pudding Happiness, pictured below.\nBased on what was mentioned in the menu, there seemed to be a\nfew missing ingredients in this. We didn't find any raspberries, but they might have been blended into the yoghurt-like mixture\non top. There were also no green apples. We usually wouldn't nitpick, but both the puddings came at a hefty price (Rs. 790) so we expected a bit more. The layers—yogurt on top, chia in the middle and a banana-flavoured paste at the bottom—didn't really go well with\neach other. This was slightly difficult to eat as you had to tackle the fruit piled on top without\nletting anything spill out. While it looked aesthetically appealing soon as it\narrived, the flavours didn't quite keep up with the looks. I'm sorry guys, but this one just didn't cut it right with us.\n\nExcept for the drink, the food didn't taste that great. The offerings are also a bit overpriced, and placing an order is confusing. Maybe that's just a\none-off thing. We hope it is.\n",
  "yamu_rating": "We don’t like it",
  "url": "https://www.yamu.lk/place/coco-5/review-52073",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_xIlYYY-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_72wVuJ-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_haVpTH-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_U3QpgO-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_Rxw5UG-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_n2qVAk-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_N6M5El-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/08/bf9TdKPSlnqFHMaZrC.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_U3QpgO-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_n2qVAk-640x413.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_N6M5El-466x480.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_72wVuJ-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_haVpTH-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_Rxw5UG-320x480.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://www.yamu.lk/uploads/files/2014/11/yimg_dqhKuA-600x250.jpg",
    "https://www.yamu.lk/uploads/files/2014/12/yimg_EKsFa0-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2015/08/UrECubefchVfGGRuVY.jpg",
    "https://www.yamu.lk/uploads/dp/2016/08/XeyiyT47QP0lwSxe3a.jpg",
    "https://www.yamu.lk/uploads/dp/2016/08/XeyiyT47QP0lwSxe3a.jpg",
    "https://www.yamu.lk/uploads/dp/2016/08/XeyiyT47QP0lwSxe3a.jpg",
    "https://www.yamu.lk/uploads/dp/2016/08/XeyiyT47QP0lwSxe3a.jpg",
    "https://www.yamu.lk/uploads/dp/2015/08/UrECubefchVfGGRuVY.jpg",
    "https://www.yamu.lk/uploads/dp/2015/08/UrECubefchVfGGRuVY.jpg",
    "https://www.yamu.lk/uploads/dp/2015/08/UrECubefchVfGGRuVY.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_xIlYYY-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_72wVuJ-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_haVpTH-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_U3QpgO-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}