{
  "name": "Coffee Bar (Grand Hotel, NE)",
  "address": "Grand Hotel Rd, Nuwara Eliya",
  "open_until": " Open 7.00 AM - 7.00 PM",
  "telephone": "05222228817",
  "description": "The Coffee Bar by the Grand Hotel is probably the best coffee shop in Nuwara Eliya. They've got a chic little space and an accessible location to go along with some good food and great coffee.",
  "reviews": "The Coffee Bar by The Grand Hotel is probably the best coffee shop in Nuwara Eliya. They've got a chic little space and an accessible location to go along with some good food and great coffee.\nNuwara Eliya actually has a quite an active food scene going on both at street level as well as when it comes to something a bit more fancy. While there are plenty of places to get your hands on good tea, Coffee spots are a bit of a rarity, at least ones with decent ambience and service. Thankfully, the Coffee Bar fits that brief perfectly.\nWhat sets them apart is the fact that they use a Thai coffee bean called Nacha coffee and from what we can tell, it tastes pretty great. Besides coffee they also serve up pastries both sweet and savory.\nWe tried out their warm caramel macchiato (Rs. 320) which tasted as good as it looked, and really hit spot on a chilly Nuwara Eliya morning. I appreciated the fact that it wasn't overly sweet, with most of the sweetness coming from the caramel syrup. The coffee itself wasn't extremely strong but had a flavour that complemented the caramel.\nThe grilled beef sandwich (Rs. 280) was good but we wouldn't say it's one of the best club sandwiches we've had. The bread here was very soft, a bit too soft actually. Besides the grilled beef which was well seasoned and generally tasty, the sandwich also had a generous amount of lettuce and tomatoes. All in all not brilliant, but still good enough for a small hunger pang.\nFor dessert we tried the duo cinnamon macaron (Rs. 70) and the glazed straberry and cream puff (Rs. 170). This was more like two cinnamon meringues than an actual macaron, but still quite tasty nonetheless with a crumbly outer shell and soft center.\nThe best of all though was easily the strawberry and cream puff which is basically a puff pastry topped with fresh strawberries and cream. Everyone knows the strawberries and cream tastes amazing together, add a golden puff pastry to it and you get a killer dessert with a great balance of sweetness and textures.\nThe Coffee Bar is a small place with seating for around 15. They share the premises with the ever popular Grand Indian, so they get a steady stream of customers looking to grab some dessert after having dinner. Each table comes with a small bowl of coffee beans which makes the cafe very aromatic and really sets you in the mood for coffee.\nSince most of the food is over the counter the service is very fast. That being said, the waiters are professional, well spoken and attentive. They also know the area well and gave us some great suggestions for dining spots in N'Eliya.\nThe Coffee Bar maybe one of the only proper coffee shops in Nuwara Eliya, but it does the job quite well. While their savories have room for improvement, the coffee and the sweets were very much on point.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/coffee-bar/review-46910",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_7G4f7L-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_YA6irj-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_RDkLU4-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_9aL1mU-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_oNRzUd-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_Q9MGkM-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_kfaLL2-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_JbCgW4-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_VV0W7Q-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_kfaLL2-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_7G4f7L-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_oNRzUd-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_YA6irj-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_9aL1mU-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_RDkLU4-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_Q9MGkM-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_mOENRl-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oKIYgP-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_7G4f7L-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_YA6irj-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_RDkLU4-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_9aL1mU-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}