{
  "name": "Cookies & You",
  "address": "73/A Dharmapala Mawatha, Colombo 3",
  "open_until": null,
  "telephone": "0774622894",
  "description": "Cookies and You claims to deliver Love at First Bite, and they live up to this promise. Their baked goods taste as great as their Instagram feed looks.",
  "reviews": "Cookies and You bakes doughy cookies, brownies, pies, profiteroles and other baked goods to near perfection. Many homebakers are good — great actually — but Cookies and You stands out.\nBased on their\n, we narrowed down our choices and placed an order for a lemon pie, churros with chocolate sauce, Caramel and Nutella Sandwich Cookies, Cookie-dough Brownies (WUT WUT), and profiteroles filled with white-chocolate ganache.\nWe called Cookies and You around noon-ish, and the nice lady on the other side said she'd be able to have our rather large and sudden order ready by 1PM the next day. That's pretty impressive, given that we'd not given her much notice.\nWhen we went to pick the order up, I was surprised by there being\nlemon pies — but it turned out to be a single portion. A pretty pleasant surprise, that. We're not complaining at all :D\nWe were told that the churros (Rs. 500) had to be eaten fast, because it's best served crisp and warm. We rushed back to office as fast as Duplication Road traffic permitted us to, and took our pictures with admirable speed and efficiency.\nThe churros were light and fluffy, and hadn't lost their crispiness either (hallelujah). Despite the choux pastry and generous sprinking of sugar, this wasn't completely sweet and had a slight salty undertone to it. Though it was still fresh and crispy by the time we got to Yamu HQ, this probably wouldn't work in most instances if the churros' port of delivery is further away. This probably isn't the best thing to have as a delivery item as it has to be served fresh off the stove, so to speak, but it worked well in our case.\nDrizzled with chocolate sauce, our day (and the churros) just became loads better.\nWe moved onto the cookie-dough brownies next, which is our equavalent to heaven on earth. Even Mal Mal (who expressed his intense dislike of brownies a mere two days ago) was sold.\nThis was deliciously moist, gooey, and chocolatey. The combo of cookie-and-brownie was carried out so perfectly here that you didn't know where the cookie flavour began and the chocolatey brownie ended. They went hand in hand together like a wand to a wizard. Coming at a cost of 1,600, we think it's quite worth it because of how good it is PLUS because there's around 12 rather large and chunky pieces of fudgy brownies to go through.\nThe huge burger look-alikes are the Caramel and Nutella Sandwich Cookies. Slightly wider than your average burger, this is a very generous sized cookie that's moist and slightly fudgy. We love that it isn't dry, and we also loved the salty caramel taste in the dough. This isn't one of our favourites and pales in comparision to the cookie-dough brownie, but is pretty good nonetheless. A batch of these (about three or four of them) is Rs. 540. Compared to the other cookie options you have around town, this is good value for money.\nThe white-chocolate ganache filled profiteroles came next. They were tiny little mouthfuls of yum. I don't even like white chocolate, but really liked this.\nTiny and bite-sized, you could easily pop one into your mouth and have it melt within a matter of seconds. The filling was creamy and thick, and surprisingly not too sweet.\nLook at that filling. Mmm-hmmm.\nComing with a price tag of Rs. 600, you get about ten or twelve (can't remember exactly how many there were in the batch, given that we kid of dug into it before we remembered to do a quick count) per order.\nLast but not least is the lemon pie. This again, let's have it out there, is a favourite of ours.\nThis packed a punch and was very strongly flavoured. Given the amount of sugary, diabetes inducing goodies we were stuffing ourselves on just minutes ago, this added a nice change in both flavour and texture. Constructed rather like a cheesecake but with a more liquid consistency, the upper part of the lemon pie was super creamy and thick, while the base was a very crumbly biscuit. A contrasting mix of textures, it made it slightly difficult to cut and serve out, but that's also because we didn't have a spatula and the knife we were using is a weak substitute for one.\nThere's a slice of lemon placed squarely on in the middle of it (you can see the outline of it) and it's a legit, sour-as-heck, absolutely great garnish. Imaad used it to scoop up the pie with, and he said the extra lemon made the already lemony pie taste even lemonier. Two pies (one batch) is Rs. 1,700 btw.\nCookies and You does a fantastic job, and is great value for money. As Bhagya so rightly pointed out, each item tastes just as it should — they don't under-deliver. We couldn't find fault with anything, and this is one of the very rare times we've had identical opinions on what we've tasted. The total damage came up to Rs. 5,000 (4,940 bucks to be precise) and we all agreed that it's totally worth it. It's just the thing for small parties or a group of friends, and is sure to give everyone a food-coma. Call the number up to place your order, and give at least a day's notice ahead of time.\n",
  "yamu_rating": "We love this!",
  "url": "https://www.yamu.lk/place/cookies-and-you/review-58366",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_ib5ceG-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_yNbCkQ-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_i06a52-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_4dQwne-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_xhAQ0m-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_ODmgMd-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_KjpFRq-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_tDAX1z-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_4YGR2R-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/08/bf9TdKPSlnqFHMaZrC.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_ODmgMd-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_i06a52-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_yNbCkQ-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_xhAQ0m-320x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_4dQwne-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_tDAX1z-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_KjpFRq-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_4YGR2R-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_srgFtf-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/02/yimg_GAysTn-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2016/08/XeyiyT47QP0lwSxe3a.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_ib5ceG-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_yNbCkQ-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_i06a52-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_4dQwne-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}