{
  "name": "Cool Berry",
  "address": "23, Borella Cross Roads, Colombo 08",
  "open_until": " Open 8 AM–10 PM",
  "telephone": "0115248463",
  "description": "Cool Berry is where the Juice Bar used to be. Despite their name and the extensive range of juices and smoothies on the menu, they don't have half of it.",
  "reviews": "Cool Berry is a basic fried rice and juice place in Borella. The only things that stand out are that you can BYOB, and the decor is interesting.\nThe entrance to Cool Berry is next to a wedding photography studio, you can't miss it. We were struck by the Jumanji-esque appearance of the entrance — the staircase leading to the juice bar upstairs was shrouded by leaves (plastic) and boughs (real), which were creeping all over the walls and ceilings.\nThe decor only became more pronounced as we made our way farther in. As Imaad rightly pointed out, it was an immersive experience. The plastic tree turned out to be an apple tree, under which there's a Buddha statue strategically placed in the midst of all the shiny red apples. We nibbled on fried-rice and sipped our juices while sitting on high wooden chairs padded over with leopard and zebra prints, under the canopy of the all-encompassing apple tree.\nLong story short, we really liked the ambience and give it four stars for its complete disregard for cohesion and normalcy. There's also a pseudo-outdoor area in the balcony where you can bring drinks and cigarettes as you have lunch on a Monday afternoon. No kidding, we saw this happen. Also, no corkage.\nService was alright, with nothing remarkable. The stewards behind the counter seem a little dazed and confused, but they are also quite friendly. They don't know what they have and don't have, and freely replied with 'not available/ out of fruit' for most of the juices we decided on. This without actually knowing if the fruit was available or not, as a short while later, they discovered that they did indeed have a handful of\nin the fridge. They didn't have any of the smoothies, so remember: the menu is a lie.\nSince they didn't have any of the smoothies, we settled for an avacado milkshake, a mango milkshake, and an\njuice. We also ordered a portion each of egg fried rice and chicken fried rice.\nBy popular consensus, the\njuice was the best because of how flavoursome it was. Tangy and with a not-too-smooth texture, it practically tasted of the fruit itself, albeit a slightly watery version.\nNote that popular consensus excluded Imaad who voted for his own avocado milkshake. Creamy and milky, the avocado milkshake was nice as well (though I still say the\nwas better).\nThe disappointing one of the lot was my mango milkshake, which tasted of anything but mangoes. Thick, creamy, overly sweet and tasting slightly of melon, this was unappealing at best. The juice cost a hundred rupees, while the fruit milkshakes were priced at Rs. 180.\nThe rice came next.\nThe egg fried rice and chicken fried rice (Rs. 170 and Rs. 250 respectively) were identical except for the fact that the chicken fried rice had a teensy bit of shredded chicken in it. The rice was hard and pellet-like, and a tad too oily. It was bland as well. The shredded carrots and leeks did nothing to enhance the flavour, which was nothing to begin with anyway. Oh, you could taste the MSG, if anything.\nWe really liked how quirky this place looked, but that's about all. They have an outdoor/ screened-off balcony section where you can bring your own beer (at least that's what they told us) and where smoking is allowed. They don't have the beverages they promise and the food is mediocre. There are plenty of other places around Borella to grab a bite if you're really hungry, so skip over this one unless you want to check the interior out.\n",
  "yamu_rating": "We don’t like it",
  "url": "https://www.yamu.lk/place/cool-berry/review-58245",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_ODrjiN-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_CpP70b-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_VwivCA-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_MREknn-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_RKiwp2-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_gNYa8d-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_6KyHEE-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_FL01fR-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_a4CZAa-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/08/bf9TdKPSlnqFHMaZrC.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_FL01fR-320x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_ODrjiN-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_MREknn-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_RKiwp2-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_VwivCA-640x462.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/04/yimg_p3U7z2-600x250.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_GtXgMC-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_ODrjiN-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_CpP70b-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_VwivCA-640x462.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_MREknn-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}