{
  "name": "Cosy Restaurant (Jaffna)",
  "address": "272, Stanly Road, Jaffna.",
  "open_until": " Open until 11:00 PM",
  "telephone": "0212225899",
  "description": "A hotel and restaurant, Cosy's dishes up Sri Lankan, Indian, and Chinese cuisine. We'd recommend sticking to the Jaffna specials. Obviously.",
  "reviews": "Situated in the heart of Jaffna town, and walking distance to the market, the Fort, the railway station and the bus depot, Cosy's is usually recommended to tourists. They're a hotel (a rather low-end, low key one), and a restaurant which has pretty decent fare. In addition to Jaffna cuisine, they also serve up Indian and Chinese.\nWe tried a naan each of different varieties (garlic, butter, and chilli, though they got the chilli wrong and billed us for a 'kashmiri' naan which included lots of ketchup and diced tomatoes), a couple of curries and a veg dish. We'd ordered a Jaffna crab curry as well, which we were rather excited to try and compare with what we've had at the\n, which is one of our Colombo favourites for affordable and delicious food.\nThe naans are priced between Rs. 160 (for the plain ones) to Rs. 220 for the Kashmiri one. They were all served in a nice bread basket, and were warm and soft — quite good as far as naans go, except for the Kashmiri naan which had a layer of oversweet ketchup slathered over it and wasn't very appealing.\nWe kept that one aside and stuck to the other naans, which went really well with the Chettinad Chicken (Rs. 540) and the Crab Curry (Rs. 530), both packed with spices. The Chettinad Chicken was mouthwatering, literally, because of how much heat was packed into it.\nThe chicken itself was less meaty than what we're accustomed to in Colombo, but from previous visits up North and from what friends have said, I figure that the tiny pieces of meat is a Northern thing. The sauce/ gravy the crab came in wasn't as overpowering as the chicken was, so the meat was soft, succulent, and retained its crabby taste.\nThe Brinjal Bharatha (Rs. 260) was also well prepared, but didn't have the smoky flavour I've heard it described as having. The dish in itself is a somewhat dry eggplant curry, prepped with a lot of onions, tomatoes, and other herbs and spices. We sadly didn't do justice to this dish because we were focused on the crab, and also because the portions were rather larger than what we expected so there was a bit too much.\nThe Prawn Pakoda (Rs. 490) is an appetizer, and we should've taken it as a snack to backpack with instead. It's a huge portion (not complaining) of batterfried bits of prawns.\nTo be fair, over 70% of the dish was just batter and deep fried onions (also in batter), but it was still a good dish with a misleading name. It's crispy and oily, and can be coupled with plain naans as well.\nService is rather slow, with about 20 minutes waiting time before either food or drinks are brought to the table, but the waitstaff are pleasant and helpful. Not all of them are fluent in English or Sinhala, so brush up on local lingo a bit if possible.\nWe love the outdoor seating area because it's fashioned in the style of old houses which had a courtyard in the middle of the building. In this case, the tables and chairs were placed all around it, with old photographs (similar to ones seen in FB's\npage) strung up and highlighted as well. The place isn't maintained to the best of standards, so it's a bit shabby and run down, but not in a way that puts you off.\nThe worst is the mosquitoes, so slather yourselves in citronella oil or mosquito repellant to keep them at bay.\nDecent food, okay prices. Cosy was once one of the best recommended places around, but we were told that standards have dropped. Having been there, we can safely say that the food isn't outstanding, but it's one of the few places in which you can get an extensive (and non-veg) menu in the area. We recommend the crab.\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/cosy-restaurant-jaffna/review-83736",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_au7gKd-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_lGDF5n-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_otJT4y-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_g13Id2-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_pnS6jz-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_Okhhdp-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_bBrDVi-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_XaLrMx-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_gmv9GL-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/08/bf9TdKPSlnqFHMaZrC.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_bBrDVi-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_Okhhdp-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_pnS6jz-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_otJT4y-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_XaLrMx-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_gmv9GL-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_0nakvg-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oKIYgP-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_au7gKd-640x365.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_lGDF5n-640x383.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_otJT4y-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_g13Id2-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}