{
  "name": "Cremalato",
  "address": "A&M Cupcakes, 469, Galle Road, Colombo 3.",
  "open_until": " Open 11 AM–8 PM",
  "telephone": "0727696352",
  "description": "Cremalato is a local gelato manufacturer that actually delivers frozen confections.  We tried a bunch of their new flavours and we think they're pretty awesome.",
  "reviews": "Cremalato was a welcome addition to Colombo's food scene in 2014, and one of our favourites. One year down the line, they've introduced some interesting new flavours as well as an exceptional range of popsicles.\nLast year, Cremalato added some much-needed diversity to the otherwise boring ice cream choices in Colombo. Their prices are higher than the usual Elephant House and Cargills stuff, but the quality justifies the premium. That being said, we feel they offer better value for money compared to the likes of\n,\nand\n.\nThey recently introduced a bunch of new flavours, including wildberries, biscotto, mango, mint choc chip, coffee and pistachio, which along with their previous offerings, makes it a very respectable and varied repertoire of gelato (shown above along with prices) . In addition, they've also launched their own range of fruit popsicles, but more on that later.\nOf the new flavours, the wildberries was our collective favourite. I am always sceptical when it comes to berry flavours since the local brands tend to taste so woefully artificial, but thankfully this one was just the opposite. The flavours in this case was very punchy with the distinct taste of strawberry and raspberry, which worked great with the overall creaminess of the gelato.\nThe biscotto, however, was my personal pick. It's not overly complex but tastes exactly like it should — a cookie dough ice cream.\nCoffee is another flavour that local brands tend to mess up on a regular basis so we're Cremalato's version is arguably the best we've had. Whatever coffee they use, it isn't too overpowering. The flavour of the dairy still comes through well, with the added texture from the crushed coffee beans.\nI'm not a huge fan of mint choc chip in general, but the folks at the office gave Cremalato's iteration two thumbs up. It is plenty minty with a generous amount of chocolate chips, so it pretty much nails the brief.\nBesides these new gelato flavours, Cremalato has also launched their own \nrange of popsicles (Rs. 1,000 for a pack of 10), which were downright fantastic. These put any other \nlocal popsicle we've tried to shame. We tried the strawberry, passion \nfruit, avocado, watermelon, mango and lime-coconut and loved each \none of them.\nWhat really sets these apart is the intensity of the \nflavours. It makes them an incredibly refreshing indulgence on a warm day. The best \npart is that they taste very natural — the passion fruit and \nstrawberry even have the crushed seeds mixed in.\nAnother reason we love Cremalato is the fact that they're pretty much the only place that\nice cream. A few months ago, they also set up a pick-up location at\non Galle Road in Bambalapitiya, so you can drop in and buy their gelato straight off the shelf. For those who prefer delivery, you can call them up on\n.\nWe're glad to see that Cremalato has maintained their high standards over the past year and moved forward with a range of new flavours. We were a bit sceptical when we heard about the popsicles, but after giving them a shot, we'd say they're the best in town.\nCremalato was one of our favourite additions to Colombo's food scene in 2014. One year down the line, they've introduced some interesting new flavours as well as an exceptional range of popsicles.\nCremalato is a local gelato manufacturer that actually delivers their frozen confections.  We tried a bunch of their flavours and we think they're pretty awesome.\n",
  "yamu_rating": "We love this!",
  "url": "https://www.yamu.lk/place/cremalato/review-54110",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_zKHa3D-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_0EFBTl-150x100.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/10/DSCF0311-150x105.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_wm2pR6-150x100.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/10/DSCF0320-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/10/DSCF0307-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/10/DSCF0296-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/10/DSCF0315-150x105.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_sRFCSr-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_ZL1GpI-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_c3RZ7F-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_CgjFhH-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_gGcLlm-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_kbIyKo-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_CgjFhH-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_kbIyKo-338x480.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_0EFBTl-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_sRFCSr-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_c3RZ7F-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_zKHa3D-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_ZL1GpI-331x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://www.yamu.lk/wp-content/uploads/2012/07/halva1-588x250.jpeg",
    "https://www.yamu.lk/wp-content/uploads/2014/06/112-588x250.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_zKHa3D-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_0EFBTl-640x425.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/10/DSCF0311-600x398.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_wm2pR6-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}