{
  "name": "Curry Leaves",
  "address": "68, W.A.Silva Mawatha, Colombo 06",
  "open_until": " Open 11:30 AM - 3:00 PM & 5:30 PM - 12.00 Midnight",
  "telephone": "0112580223",
  "description": "Curry  Leaves is one of Colombo's oldest Indian restaurants, but remains mostly under the radar. Their strength lies in their biryani, but the rest of the dishes were pretty ordinary.",
  "reviews": "Curry  Leaves is one of Colombo's oldest Indian restaurants. Their strength lies in their biryani, but the rest of the dishes were pretty ordinary.\nCurry Leaves is old school, from the look to the staff to the menu and the preparation of the dishes. At first glance, the menu looks expensive, but that's because it includes taxes and service charge. While we always appreciate not having any hidden costs, the prices are still comparatively higher than other similar Indian restaurants. Biryani costs between Rs. 650 - 850, and other dishes anywhere between Rs. 600 - 950. Everything comes in single portion sizes which is enough for around two.\nThe murgh chicken biryani (Rs. 660) is apparently what their well known for, according to the waiter at least. While it wasn't the best chicken biryani we've had, it was pretty solid. The positives here were the light and fragrant long grain basmati rice, and the abundance of well seasoned and spiced chicken. It does however lose points because we came across quite a few bones which wasn't the most pleasant experience. The raita that comes with the biryani wasn't the most spectacular either with the it tasting more or less like very sour curd, thankfully you can just leave it aside.\nThe mutton masala fry (Rs. 850) wasn't too bad but there was nothing to really set it apart, besides the fact that it's pretty darn spicy. We felt the mutton could have been cooked through a bit more since the bigger pieces were a bit chewy. I'm generally fine with spicy dishes, but this curry, while flavoursome, was just a tad too spicy. Then again when we had it, it was piping hot so that didn't really help the issue. True spice lovers might really enjoy this one though.\nWe also ordered their hot butter cuttlefish (Rs. 950), which in retrospect was a mistake, but we were told that they prepare it in a way that it complements the biryani. It was a somewhat different preparation, but not in a good way. Once again you get plenty of spice but a lack of seasoning and just a very thin, light brown batter doesn't really get your hopes up much to start with. The cuttlefish is also cut into some pretty long strips which makes it difficult to eat. This one was definitely a fail.\nCurry Leaves is not very easy on the eyes. The interior looks more or less like a banquet hall with a gaudy bright red and black theme. You can kind of feel your eyes burning if you stare too long at the red.\nThe waiters are chummy, attentive and the service is fast, but as we mentioned earlier with the cuttlefish debacle, they aren't the most knowledgeable.\nThere are certainly better tasting and better looking Indian restaurants in Colombo, but Curry Leaves still offers a solid chicken biryani.\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/curry-leaves/review-37792",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2014/12/yimg_vJpx7s-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2014/12/yimg_WgeNUL-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2014/12/yimg_t9zmEK-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2014/12/yimg_BR3Q89-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2014/12/yimg_Dt4wJX-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2014/12/yimg_CTaFjE-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://www.yamu.lk/uploads/files/2014/12/yimg_BR3Q89-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2014/12/yimg_t9zmEK-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2014/12/yimg_WgeNUL-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2014/12/yimg_CTaFjE-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2014/12/yimg_vJpx7s-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_HBgEKY-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oKIYgP-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2014/12/yimg_vJpx7s-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2014/12/yimg_WgeNUL-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2014/12/yimg_t9zmEK-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2014/12/yimg_BR3Q89-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}