{
  "name": "Deen's Kitchen",
  "address": "7A Isipathana Mawatha, Colombo 5",
  "open_until": " Open 11:00 AM to 2:00 AM, Mon-Sun",
  "telephone": "0775546200",
  "description": "Rather greasy and heavy food.",
  "reviews": "Where Isipathana Mawatha meets Havelock Road, a small shop appears. Carefully hidden under the pretence of a kitchen- this stop is not for the faint of heart... literally.\nWith massive and yet unappetizing portions, Deen’s Kitchen is - as Shifani puts it - “OK food for hungry boys with no standards.”\nRightly so. With an arsenal of greasy food, it’s no wonder Deen’s Kitchen musters entire Rugby teams from Havvies and classes of students from Royal Institute.\nThe only downside of being a YAMU agent is that it requires you to go undercover - which can be difficult if you’re in a restaurant with a large camera snapping pictures at every plate, glass, and guest that comes your way. Done to ensure we get authentic service it pays to be the strong, silent type - a Yamurai of sorts. Having done so I can say with confidence that the owner of the shop, who I assume is Deen himself, is extremely friendly. His customers are chummy with him and he makes an open effort to talk to his customers and get along with service. However what is mostly American ‘fast’ food takes an eon to arrive. I did wait a bit. I was told it was because of the layered Godzilla Sandwich which is the restaurant's flagship item. Rice and Curry on the other hand whizzed out of the kitchen.\nAmbience-wise, Deen’s Kitchen retains the sort of atmosphere you’d expect from a site like this. Small and congested, the place resembles what would happen if a take-out kitchen and a bicycle garage had a baby. I saw packets of buns under the counter, a strange cup in the corner, while a TV played Blood Diamond with DiCaprio killing it. Like DiCaprio’s eternal wait for an Oscar, I waited for my Godzilla Sandwich while the seemingly dark, mysterious kitchen made sputtering and sizzling noises at the back.\nHappy Day! My order was ready. The Godzilla, was wrapped in foil along with the milo and burger. I headed out and trekked it to YAMU HQ.\nOnce there, myself along with fellow agents Shifani and Bhagya peered at the parcel. What lay inside next took us all off guard.\nUnwrapping the Godzilla was a messy task. At Rs. 888, this behemoth oozed out cheese and sauce from its foil. Finally, it stood before us large and proud with an abundance of eggs, sausage, cheese and chicken spilling over the edges.\n“I can smell the cholesterol off that one.” Dinesh tells Janith.\n“It doesn’t look all that bad.” I lie to myself.\n“-Hush.” Bhagya cuts in. “Listen.”\nShifani brings her head close to Bhagya’s half of the sandwich.\n“Woah. Trippy.”\nI bring my ear up to mine too.\nOil.\nBhagya presses the sandwich.\n“It sounds like a sponge full of soapy water.”\nI bite into it. With the bread soggy and full of oil my mouth becomes a lake full of mush. Apart from the oil, the fried egg swims around, the sausages squish beneath my teeth. The only thing passable is the chicken – done right and the only thing offering texture other than the crunch rendered from the lettuce. Even the chips in the sandwich (?) are soggy from the oil. Shifani and Bhagya, full of sickly-rich filling have already waddled back to their desks.\nI put the artery-splitting sandwich away.  Half dizzy, I plough my way through the crispy chicken burger (Rs. 360) . This one looks okay. You can still taste the oil though. Sort of like a cheap, oily KFC zinger, the crispy chicken burger looks like Colonel Sanders fell into a frying pan. There really isn’t much here. It’s a tad bit better than the Godzilla. The chicken once again offers a modicum of taste and texture whereas everything else is simply overpowered by the thickening taste of oil. One thing you've got to give them is they're generous on the meat.\nThe only great thing was the iced Chocomilo at Rs. 200. Up until now I’ve never understood why people go head over heels for Milo. Now I do. This one is slightly unconventional. Bordering on the thick side and cooled to perfection this one is an exceptional drink for a hot Colombo evening. There isn’t oil in this one, so your heart can rest easy. Sort of.\nDeen’s Kitchen is a lot like it’s food – full of the good and the bad. You’ve got friendly service, terrible ambiance and oily food stacked together in a mess so tall Godzilla himself couldn’t tackle it. We all felt stuffed and sickish. I suppose if you’re looking for heavy food to watch a late night cricket match with your ‘machangs’ whose only demand is to be stuffed, these heart-thumping giants will satisfy.\nDeen's Kitchen, as Shifani puts it is \"Okay food for hungry boys with no standards.\" . \nRightly so.\nRather greasy and heavy food.\n",
  "yamu_rating": "We don’t like it",
  "url": "https://www.yamu.lk/place/deens-kitchen/review-49165",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_Y8Uslb-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_D3IEh2-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_tRcn7L-150x100.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/10/DSCF02132-150x105.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_ltGHa7-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_u4srdS-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_BY07pK-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_k2Dia6-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_cMa8PL-150x100.JPG",
    "https://www.yamu.lk/wp-content/uploads/2014/10/DSCF01952-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/10/DSCF0189-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/10/DSCF0197-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/10/DSCF0208-150x105.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_bk49iT-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_KxoGDt-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_7CEl7r-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/07/r7ukSszy258MtvRTun.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_KxoGDt-640x480.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_ltGHa7-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_BY07pK-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_tRcn7L-360x480.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_bk49iT-640x640.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_7CEl7r-640x364.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/04/yimg_yx3Wjl-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/05/yimg_Wz4DZj-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2015/07/r7ukSszy258MtvRTun.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_Y8Uslb-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_D3IEh2-640x629.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_tRcn7L-360x480.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/10/DSCF02132-600x398.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}