{
  "name": "Diner's Lounge",
  "address": "No 18A, Palmyrah Avenue, Colombo.",
  "open_until": null,
  "telephone": "0112599344",
  "description": "A new multi-cuisine restaurant in Kollupitiya. ",
  "reviews": "You can find a new restaurant in every nook and corner in Colpetty. Diner's Lounge opened up earlier this year and we dropped in for a quick lunch last week. Unfortunately, it did not really live up to our high expectations.\nBeing a multi-cuisine Halal restaurant, we were excited to see the variety of what they had to offer. However, after looking at the prices we had to strategically order so they would not bleed us dry. They had Arabian, Indian, Western and Italian cuisine and all the mains were easily Rs. 800 and up while the Mocktails were about Rs. 400 each.\nWe got ourselves a Chicken Sweet Corn Soup (thankfully a reasonable Rs. 280) for the appetizer, which was a great start since it tasted absolutely delicious with an abundance of thinly sliced chicken and corn. The broth was just the right amount of sweetness with a thick texture.\nThe Chicken Biriyani (Rs. 745) we got didn't really taste like biriyani at all, but it was still a decent dish closer to yellow rice. It came with a side of chutney, a huge chicken leg, boiled egg and a side salad.\nThe chutney was was sweet with a tinge of spice, while the chicken was tender and topped with a generous amount of gravy and capsicum. The salad was dripping with mayonnaise which I did not care for. All in all, the dish didn't taste awful but at that price I would expect a legit biriyani.\nNext up we tried the Mexicana Pizza (Rs. 1850). They had an offer for buy-one-get-one-free but sadly, you only get a free pizza from the same flavour and there was no half-and-half option either. The pizzas were normal oven-baked and did not really live up to our standards. While they had lots of chicken and veggies like black olives, tomatoes, bell pepper and onions, it wasn't cheesy enough and the base itself tasted bland.\nFinally, for dessert, we got their popular Fried Ice Cream (Rs. 425) which is truly value for money. It was addictive and mouth-wateringly pleasing. The ice cream was served on a sizzling plate with 5 slices and chocolate sauce drizzled on top. The batter was crispy and crunchy and the mango flavoured ice cream in the middle was still cold and held together despite the sizzling hot plate.\nService was alright. There weren't many waiters milling around but everyone was friendly and professional. Our food took a bit longer to arrive than I would have liked but that's because the power went out, so it's not really their fault.\nThe interior is quite dull and gloomy. There was hardly any wall art and the furniture was not well-matched, as you can see. They have short eats on display but nothing special we wanted to try. The place was deserted when we went and the music was the only thing keeping us company.\nThe only things we would recommend from our experience here are the ice cream, and maybe the soup. They could really improve on their mains, especially for those prices. That being said, I would drop by again for that ice cream.\nA multi-cuisine Halal restaurant down Colpetty. A bit overpriced but they do a delicious fried ice cream.\n\nඩයිනර්ස් ලෞන්ජ් එකේ කෑම නම් කිව්වත් වගේ ටිකක් ගණන්. හැබැයි රස පැත්තෙන් ගත්තොත් ඒ හැටි හොඳක් නැහැ.\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/diners-lounge/review-189113",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_yLzhoz-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_ZJ1EGL-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_te9R3s-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_wyPHjr-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_1CFY7c-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_eI7tsF-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_wR5LVZ-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_X8brog-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2017/05/8ASFnC1F2g6DeTqofz.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_wR5LVZ-1024x768.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_X8brog-1024x768.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_yLzhoz-1024x767.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_ZJ1EGL-1024x597.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_eCz2Zw-1024x768.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_eI7tsF-1024x768.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_mOENRl-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/12/yimg_MgvBQL-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_yLzhoz-640x479.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_ZJ1EGL-640x373.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_te9R3s-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_wyPHjr-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}