{
  "name": "Diwan Restaurant",
  "address": "127 1/1, Sri Saranankara Road, Dehiwala",
  "open_until": " Open 11.00 AM - 2.30 PM & 6.00 PM - 10.30 PM",
  "telephone": "0115920911",
  "description": "Diwan is a new multi-cuisine restaurant on Sri Saranankara Road. It's mostly known for it's Indian cuisine, which is what we tried, but they also offer Chinese and Italian.",
  "reviews": "Diwan is a new multi-cuisine restaurant on Sri Saranankara Road. It's mostly known for Indian cuisine, which is what we tried, but they also offer Chinese and Italian.\nLooking through the menu at Diwan can be a bit confusing because they've got three contrasting cuisines in there, neither of which is very extensive, so it seems as if their suffering from a bit of an identity crisis. I'm generally quite skeptical when it comes to restaurants that try to offer many contrasting cuisines, and the three Diwan offers (Indian, Chinese and Italian) are worlds apart. We dropped in at a bit of an odd time and unfortunately the Indian chef was on a break. They offered us their Chinese menu, but the options were limited and we were hoping to try the Indian cuisine, so the manager suggested we get the food delivered. Which is what we ultimately did.\nValue for money is one thing that Diwan definitely has going for them with the cost for three coming to just Rs. 660. Their Indian menu is the most varied with a good choice of breads, biryani and curries. All of it is very reasonably priced, with the most expensive curry being the mutton kadai at Rs. 300, and as far I know, that's one of the cheapest mutton dishes around.\nThe chicken biryani (Rs. 300) we got was massive. We think the portion was meant for one but it's easily enough for two, with two sizeable pieces of chicken. While the large portion is definitely a plus, the chicken was a bit too over cooked and could have used more seasoning. The rice on the other hand was pretty good with a good mix of different spices, some caramelized onions and fried coriander leaves.\nThe butter and garlic naan (Rs. 80 each were) decent, but not the best we've had. They had plenty of butter and garlic but the bread itself was a tad bit rubbery.\nFor a curry to have with the naan, we got the butter chicken (Rs. 200), and it was very good. For Rs. 200 you get plenty of gravy and  4 pieces of chicken, which is unheard of elsewhere. While darker in colour than what we've had at other places, the curry itself was intense, but in the best way possible, with a thick gravy, plenty of spice and a hint of sweetness. And unlike the chicken in the biryani this was cooked just right.\nWhile we couldn't really experience the service first hand, we did get to check out the space and it looks okay. There's honestly not much to say besides the fact it's very much in line with the look of most local diners, with a capacity of around 150 and some private rooms upstairs. One thing that we liked was the open kitchen area which you walk past as you enter the restaurant.\nAlso noteworthy is that they offer free delivery, which in our case came right on time and piping hot.\nDiwan restaurant does a pretty decent take on Indian cuisine, while also offering Chinese and Italian. Their main highlight though, is the value for money with some generous portions at very reasonable rates.\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/diwan-restaurant/review-39677",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_Wkaxue-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_Ebhdsu-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_9bw15x-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_wouzfp-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_ianKY6-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_Wkaxue-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_9bw15x-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_Ebhdsu-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_wouzfp-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_ianKY6-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_L4QWMb-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_DKK32n-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_Wkaxue-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_Ebhdsu-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_9bw15x-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_wouzfp-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}