{
  "name": "Dolce Italia (Rajagiriya)",
  "address": "623 Nawala Road, Rajagiriya",
  "open_until": " Open until 11:00 PM",
  "telephone": "0112559900",
  "description": "Dolce Italia has opened up a new branch at Rajagiriya, and they do great pizzas!",
  "reviews": "Dolce Italia's new branch is aesthetically quite different from their buzzing Colombo 05 flagship restaurant, but they've retained a lot of their popular features. For example, they grow their own tomatoes and make their own sauces, and also have a range of sweet-treats/home-baked breads on display for instant order. What's cool is the fact that the breads are large in size and go for about Rs.50 - 60 each (including the Ciabatta bread). Plus it's BYOB.\nThey serve a range of traditional Italian fare like Panini, Bruschetta, Risotto, Pasta, Main Course meals (choice of meat with bread and salad), and even salads.\nWe decided to go with the Beef Lasagne (Rs. 1000). I don't know what it was, perhaps it's the homemade pasta, perhaps it's the garden-grown tomatoes, but this lasagne was pure bliss. Tucked in between silky smooth layers of homemade pasta sheets, the beef filling was delicious and although there was quite a bit of mixed red and white sauce it didn't overpower the fresh, beefy flavour. It cut like butter and the portion was big enough to leave 2 of us full. Best enjoyed hot.\nNext up was the pizza. They have a half-n-half option, so we decided to get half of the Pollo e Spezie ( Rs.1300) and the Quattro Formaggi (Rs.1400) . The pizza is obviously wood-fired, you're greeted by their red wood-fire oven as soon as you walk in, and so because of this authentic method their pizza crust was wonderfully baked, soft and flavourful with a light flakiness to it. It was still bubbling by the time it was served. Sauce content was adequate and cheese content was fine, too.\nThe Pollo e Spezie was basically perfection, the chicken was reminiscent of actual curry chicken, soft and seasoned well.\n\nThe Quattro Formaggi did a number on my taste buds. Every single cheese flavour came through, and even though it was a mixed cheese pizza I was amazed at the fact that I could taste every single cheese individually. In total this pizza came to Rs.1350 - great deal. Special shout out to the blue cheese!\nFor dessert, we got the Custard Cannolo (Rs.250). I understand now why Italians hold their cannoli in such high regard. The cannoli was encased in light, sweet pastry and the custard was delicious; not too thick, not overwhelmingly sweet.\nThe Tiramisu (Rs.350) was the ONLY item that left me a little disappointed. The coffee-soaked ladyfingers were great, the coffee sprinkled over the tiramisu and inbetween layers was great but the cream. THE CREAM. The cream was so bland, with just a light tinge of sweetness to it. I didn't taste any mascarpone whatsoever.\n\nThe service is excellent, the waiter was super-friendly and it's like he'd downloaded a menu-description package into his mind because he knew everything about the menu. He recommended the Pollo e Spezie and the lasagne and both of those dishes were A+ so grazie to him.\nThe food didn't take long to be served, probably about 5-10 minutes tops.\nThe only thing we didn't quite like was their interior, which reminded me of the Masjid back at my dad's hometown. Sparsely decorated interior with light, mint coloured walls, white tiled floor and black furniture it was pretty bleak.\nThe outdoor seating area was quite nice, with bamboo walls, and teal accents. It looks even nicer at night when it's softly lit up.\n\nThey don't serve pork, but they DO try to make up for it by serving pork subsitutes (chicken bacon etc). Do yourselves a favour and don't go ordering these. We tried both the Dolce special (egg and chicken bacon), and the pseudo-Pepperoni (chicken sausage), and they just did not work.\nStick to their other stuff, which were in our experience, superb! Overall, enthusiastic service, good food, and reasonable prices. If you're not ravenous, you can have a meal for two under Rs. 1500 (one large pizza, BYOB, and dessert).\nGreat place a date-night dining experience and also if you want to take the fam out for some 'za.  Also you get to take your own alcohol with you.\n\nඉතාලියට නොයා ලංකාවේ ඉඳල ම ඉතාලි කෑම රස බලන්න නියම ම තැන්වලින් එකක් විදියට Dolce Italia එක කිසි සැකයක් නැතුව හඳුන්වන්න පුළුවන්.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/dolce-italia-rajagiriya/review-125528",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_zcAuAi-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_D9AsTe-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_kkF3C6-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_fMzY9R-150x100.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_7ZRMCc-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_b5AQot-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_QeszyK-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_8HEB6p-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_5EoMr8-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_L7Pw1x-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_Xe8ZZW-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2017/01/sFOlV64o5GU2djDVqy.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_zcAuAi-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_kkF3C6-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_8HEB6p-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_7ZRMCc-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_b5AQot-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_D9AsTe-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_fMzY9R-640x321.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_mOENRl-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oKIYgP-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2017/04/KE2F77hW9uoRt7RHja.jpg",
    "https://www.yamu.lk/uploads/dp/2017/04/KE2F77hW9uoRt7RHja.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_zcAuAi-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_D9AsTe-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_kkF3C6-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_fMzY9R-640x321.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}