{
  "name": "Dottie's English Tea Room",
  "address": "ODEL, Alexandra Place, Colombo 07",
  "open_until": null,
  "telephone": "0710628524",
  "description": "Dottie's is a charming English tea room serving up tea, fry-ups, and desserts on intricately delicate china and lace with a side of great service.",
  "reviews": "Dottie's English Tea Room is finally back! They had some issues with their spot on Rosmead Place, but they've returned on a smaller scale at the\nbirdcage at ODEL. It's currently open from 3-6 PM on Saturdays and Sundays, but are planning to expand with a full menu and opening times 6 days a week.\nFor now, the menu is restricted to Afternoon Tea, a selection of tea, and desserts. We opted for the Afternoon Tea (Rs. 2000 per person), along with a slice of the cake of the day, which luckily for us ended up being a Chocolate Brownie (Rs. 500).\nThe Afternoon Tea is meant to be for one person, but the selection of little sweet and savoury stuff is almost big enough for two if you're looking for a nibble and a chat as opposed to a full meal. It came complete with a delicious scone, a soft chocolate mini cake, a Victoria sponge, and a little passion fruit muffin. Each of these was perfectly executed, but the passion fruit muffin and the scone were exceptionally yum. You can choose to team your bites with a plate of cream and/or homemade jam (in our case rhubarb!).\nThe savouries were a little less exciting than the perfect desserts, as it was a selection of 4 baguette slices with different toppings, like a spiced cheese, cucumber, smoked salmon, and tuna. Apparently we were supposed to get a little quiche with it too, but I think they forgot to include it on the plate. Apart from the cucumber, they were all tasty and fresh, but we could have done with some variety (perhaps a little pastry or two).\nThe Afternoon Tea package also comes with 2 pots of tea (which I thought was pretty excessive for one person), and there are quite a few options to choose from. We opted for the classic Dottie's pink tea, and a turmeric tea. Apparently their newest addition, the Iced Pink Tea is really popular too, but we didn't manage to try it on this visit.\nWe also got a massive slice of chocolate brownie, topped with cream, strawberries and chocolate sauce. It was perfect - lightly crispy on the outside, soft and gooey on the inside. We ended up taking most of it home as it was just too much on top of everything else!\nOf course the ambience isn't the cosy, private spot it used to be, but they've done a pretty good job of giving the bird cage a floral, tinkly feel. From the beautiful upholstery to the signature bone china and the antique cashier's till, it still has that unique Dottie's vibe. We loved the attention to detail, with even the crystal glasses, old-timey cutlery, and feathery embellishments in place.\nThe service can be a bit of a hit or miss as they're still finding their legs at the new premises. They've retained their superbly friendly and moustachioed waiter from the old location, who handed us a glass bell and instructed us to ring whenever we needed assistance. It made me feel uncomfortably like a colonial overlord, but it was definitely an effective system. As for the accuracy, there were a couple of tiny errors, like they forgot to give us the quiche included in the tea, and charged us for a pot of Turmeric Tea (Rs. 500) although it was supposed to be included in the Afternoon Tea.\nWe're exceedingly happy that Dottie's is back, and we can't rave enough about those scones! Head here for a charming little tea sesh, and keep an eye on their Facebook page to find out when their full menu (and those decadent fry ups) return.\nDottie's English Tea Room has moved to ODEL! Here's what the new experience is like.\nA charming, quaint little tea shop in Colombo 07.\nA YAMU First Look at Dottie's English Tea Room - a little place in Colombo 07 serving up high tea and English breakfast.\n",
  "yamu_rating": "We love this!",
  "url": "https://www.yamu.lk/place/dotties-english-tea-room/review-193160",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_FiTeVS-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_QJy6Oq-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/06/yimg_zhEHfJ-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/06/yimg_tuERBN-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_AnoX9q-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_9o1bxW-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_jpyHW1-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/06/yimg_lAnW1l-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/06/yimg_imOmtk-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/06/yimg_5yDzS3-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_4Uf909-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_jNdfm7-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_EspbNN-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_qL0Pvu-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_9Shbz7-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2017/04/KE2F77hW9uoRt7RHja.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_FiTeVS-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_qL0Pvu-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_9Shbz7-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_EspbNN-640x379.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_9o1bxW-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oKIYgP-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/02/yimg_6KurJT-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2015/12/0F34X3pTfLr7btifJN.jpg",
    "https://www.yamu.lk/uploads/dp/2015/12/0F34X3pTfLr7btifJN.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_FiTeVS-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_QJy6Oq-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/06/yimg_zhEHfJ-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/06/yimg_tuERBN-640x433.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}