{
  "name": "Dwaraka",
  "address": "37, Jaya Road, Marine Drive, Colombo 4",
  "open_until": " Open until 10:30 PM",
  "telephone": "0112081168",
  "description": "Dwaraka is a new pure vegetarian Indian restaurant in Bambalapitiya. Although we ran into a few hiccups, we still walked away pleased with our meal.",
  "reviews": "Dwaraka is a new kid on the block in the saturated Indian vegetarian scene of the Bambalapitiya-Wellawatte area. At a little over a month old, the restaurant seems to be finding its feet. Still, they manage to strike a decent balance between authentic north and south Indian flavours at okay prices. While the food is better than mediocre, the location and ambience make it a nice place for a lunch time gathering of friends and family.\nI kick my meal off with a taste of the south. The should-be masterpiece of any Indian vegetarian joint - Thali (Rs. 500). It arrived on a pleasing, orderly platter with colourful curries. A chapati wedged into the corner. A fiery curd chilli sticking triumphantly out of a bed of rice. Everything is unlimited yet the price seems a bit of a commitment, unless you have the appetite.\nMisshapen and not layered, the chapati feels like an afterthought but is pleasingly soft. The curries are well balanced, being conservatively salted, spiced and oiled. The dhal is light and just the right amount of watery. The broad beans are creamy and savoury. The\nwith drumsticks is tart. The cooked\nhas a welcome bitter-spicy kick. The dark garlic curry has a deep spicy aroma. And the gotukola adds a refreshing raw element.\nAs I begin sinking my fingers into the medley of curries, something immediately feels missing. See, a good thali has three rice pullers: curd chilli, chutney (preferably mango or lime) and papadum. Miserly, Dwaraka scores a 1 out of 3. Thali curries are meant to be more soothing than stimulating, but those rice pullers are essential for those of us who need a kick. The least they could have done was throw in some papadum. Minus points.\nNext, my tastebuds take a trip up north with a paneer tikka masala (Rs. 650) and garlic naan (Rs. 150). The northern dishes are unsurprisingly very different in character from what I’ve just had. The tikka masala was a bright red, heavy with cream and oil, topped off with a generous amount of shredded cheese. As for the naan: I was almost able to see my reflection in the oil oozing out of it. I know it's not doing my arteries any favours, but I actually appreciated the decadence.\nThe garlic naan had a beautifully soft texture with a flavoursome body, but had no distinguishable garlic flavour. Health concerns aside, the oil didn’t detract from the experience. Now, the tikka masala was what caught me completely off guard. It had an unusually intense citrusy punch, counterintuitive to every variation I’ve had. But it worked. Problem was the woeful lack of paneer, with only a few slivers to be found and way too many onion bulbs taking up space. Overall, both dishes were tasty but overpriced.\nI wind down my meal with a pista kulfi (Rs. 200) and masala tea (Rs. 70). The kulfi is small but potent. It arrives like a sugary torpedo, densely packed with nuts and dried fruit. The rest of the body is creamy and almost syrupy in texture. Each mouthful blows me away. It’s by far the best tasting item of the lot. The masala tea on the other hand is sadly average. It’s colour was off and the spices didn’t quite reach a complementary equilibrium.\nI’m not the biggest fan of restaurants attempting to serve up both north and south style Indian food. Depending on the cultural background of the management and chefs, I tend to find that one section of the menu will always trump the other. With a Keralite manager and a Rajasthani cook, Dwaraka comes close with neither region taking the edge in my preliminary visit.\nOn the corner of Jaya Road and Marine Drive, Dwaraka is a little hard to find, being situated on the top floor of the Dawn and Dusk building with multiple entrances. I was quite pleased when a staff member came outside to guide me up a narrow flight of stairs into the dining area. Once I was seated, however,I had to switch on the fan myself and ask for the menu in a relatively empty restaurant.\nThere seems to be a lot of staff, plus a captain and manager running around, but the ship needs tightening. Being served by no less than three different waiters, I’m wondering if there's no system to assign staff to an area or table. At least they seemed knowledgeable about the menu. My dishes arrived promptly but there was one hiccup when I was given filter coffee instead of a masala tea.\nDeciding to take some pictures of the interiors while waiting for my dishes to arrive, my cover was sadly blown when the suspicious owner and manager confronted me. A little nonplussed by their mistrust I blurted out that I was taking pictures for a review. Calmed by my response they tell me, “A lot of people are against us”. Intrigued, I prodded for more details but all I got was that there were supposedly some nameless Park Road restaurants out to sabotage them.\nA significant investment looks to have been made on furniture, decor and random high tech appliances like an unnecessarily complicated electronic tissue dispenser and faulty sensor based tap in the toilet. But overall the colour scheme of woody browns, blue and green highlights, with huge windows pouring in natural light make for a cosy setting. The waiting area for take-away customers boasts large comfy sofas overlooking the ocean.\nDwaraka is named after Lord Krishna’s mythical home town. Their food is good but don’t go expecting a spread worthy of a Hindu deity. Their strength lies in their location and ambience, though they offer take-away and delivery in the Bamba-Wella area. Aside from slightly high prices, an order mix-up and a weird encounter with the world of restaurant intrigue, I still walked away pleased and would be willing to give these guys one more shot once they hit their stride.\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/dwaraka/review-61721",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_0x4yW2-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_rysx9Y-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_lq0MY3-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_KCFjG6-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_MM3HSr-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_n6OLPb-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_kpxa2F-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_kpxa2F-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_0x4yW2-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_rysx9Y-640x451.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_KCFjG6-640x469.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_n6OLPb-640x410.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_lq0MY3-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_MM3HSr-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://www.yamu.lk/wp-content/uploads/2013/11/DSCF5440-588x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_mOKcMu-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2017/03/Sldt0FYgGT5HiAwzvZ.jpg",
    "https://www.yamu.lk/uploads/dp/2017/03/Sldt0FYgGT5HiAwzvZ.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_0x4yW2-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_rysx9Y-640x451.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_lq0MY3-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_KCFjG6-640x469.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}