{
  "name": "Earl’s Passikudah",
  "address": "103, Pasikudah road, Kalkudah",
  "open_until": " Open until 11:00 PM",
  "telephone": "0652050201",
  "description": "The warm reception we received on arriving at Earl's was an early indication of how good a time we were going to have there.  Only a short walk away from Passikudah beach, this friendly and comfortable little hotel will serve you well.",
  "reviews": "If you’ve ever had the luck to be in Passikudah at 4 in the morning you’ll know it’s pretty much an empty vacuum of darkness with only streetlamps and  the occasional hotel sign to guide your way. We experienced this first hand when Buddika and I arrived a couple of hours earlier than intended at our accommodations for our stay in Passikudah: The Earl’s Passikudah.\nTo the great disappointment of our backpack-carrying weary shoulders the hotel seemed dead enough to belong in a zombie apocalypse movie at this hour. However a quick phone call proved that at least there was someone from security alive and kicking at the front door. The nice security uncle opened the doors for and let us kick back and take a breather while someone from staff arrived to check us in. A second member of the security staff also came to greet us.\nSince we were informed that they’d arrive only around 6, and the nice security uncle offered to look after our bags for us we decided to not waste time and head to the beach nearby for some pictures of the gorgeous Passikudah sunrise. The Earl’s is only a 5 minute walk from the beach so this was no trouble at all.\nWhen we got back after a couple of hours of roaming on the beach we were met with the most friendly and charming reception staff who after apologizing profusely ushered us into our room.\n\nWe really had no complaints here. It was clean. It was neat. Nice decor. The air conditioning worked. The bathroom was spotless and we had a nice inland view from two small balconies. The beds and the couch were pretty and pretty comfortable. While our tired and sleepy eyes begged for some rest, we headed down to check the rest of the hotel out and to get some food.\nIt’s a small hotel and it doesn’t boast some fancy avant garde architecture. But it’s a nice place and maintained really well. The upper floors house the rooms and the ground floor has an open air pool with a bar and dining area next to it.\nOn the other side of the pool there’s a small grassy area with a couple of coconut palms giving some cool shade. There’s also a restaurant that opens out to the front of the hotel, and the whole courtyard is bright, sunny and very welcoming. There are some weird humanoid statues which are a bit out of place though.\nFood at Earl’s was really quite excellent. They have a choice of Sri Lankan and Western breakfasts. While they got the order wrong and gave us two Western breakfasts we had no complaints because the food was delicious.\nStarting out with two tall glasses of fresh papaya juice, we were then treated to a fruit salad starter… with a few slices of cheddar cheese. The salad was so fresh the fruit still had a crunch to it.\nWe were then treated to the main dish. Which was a platter with bread slices, a croissant, breaded fish steak, baked beans, fried sausage, omelette, baked beans and crispy chicken bacon. The croissant and bread were ok. However we didn’t even mind that it was chicken because it was crisped to perfection. The omelette was well done but the sausage and baked beans were obviously commercially available stuff. The breaded fish fillet was really the star here. So much natural flavour and the meat was so tender it could barely keep together despite the light and crispy outer coating.\nLunch was also a choice of Western and Sri Lankan dishes. While I opted for their pasta dish Buddika asked for the Sri Lankan lunch. We got starters first. I tried the vegetable soup while Buddika tried the chicken soup.\nThe chicken soup was creamy and delicious with some chicken pieces as well. The vegetable soup looked like boiled vegetable water to be honest. But when you taste it, it’s something close to a Vietnamese Pho. It had a lot of flavour.\nThis was followed by a seafood salad and vegetable salad. Both were excellent with fresh seafood and fresh veges tossed in a great sauce. While the seafood salad needed some pepper the vege salad was spot on.\nWhen the main courses came to the table it seemed I made the wrong choice. While I got a single small plate, Buddika got a giant platter of Basmati rice with 4 dishes of curries and another dish of papadum. But not to worry. The pasta was delicious. It was cooked just right with a delicious homemade fresh tomato sauce. It only looked small. It turned out to be a generous portion.\nWhat was really generous was the rice and curries Buddika was having. There was easily enough for two and so we asked for another plate and we both dug in.\nThe rice was cooked to perfection. Basmati is hard to cook right so we really appreciated that. The chicken curry was spiced and cooked amazing well with the meat falling off the bone. The mukunuwenna mallum was fresh and spicy. Pumpkin curry and potato curry were really good as well.\nDessert was a repeat of the fruit salad and vanilla ice cream with kithul treacle. That was a nice change from the regular chocolate sauce you get everywhere.\nDinner was a buffet, but we unfortunately couldn’t experience it firsthand as duty called us elsewhere. However the hotel staff very kindly packed us a meal each and sent them up to our room. There was rice, noodles, chicken, and other delicious curries. But the standout was the crab. It was fresh, well spiced and cooked amazingly well. Buddika just wanted to find some bread and eat just the crab. It was that good. Especially with the gravy.\nWe also happened to be around for Sunday morning breakfast which also was a buffet. Steaming hot rice, pittu, string hoppers were laid out with curries from fish to potato and dhal. Not forgetting the coconut sambol either. Plus an omelette station. All were fresh and tasty. We had no complaints.\n\nThe people here are more like that overly friendly uncle and aunty in your family that just won’t let you leave without one more bite or one more sip of tea. Literally. It felt like we were always being guided to their restaurant. Everyone was super helpful and super friendly. Even in the restaurant the manager and chef were talking to the customers and checking up on whether they were having a good time. They accommodated all our requests without any complaints or delays.\n\nIf you’re spending some time in Passikudah we totally recommend The Earl’s. Judging by the busloads of tourists that came as we were there, we aren’t the only ones to think so. It may be more conventional in ambience than some of those new fangled places but we think the service and food will win you over. It's literally 5 minutes away from the beach by foot, and rooms are as low as\n.\nIf you’re spending some time in Passikudah we think The Earl’s Passikudah could be an excellent choice for you\n\nදොර අරිනවත් එක්කම ඉස්සරහට ආපු රිසෙප්ෂන් මිත්‍රයගෙ ගුඩ් මෝර්නින්ග් එක අපි දෙන්නට ගෙනාවෙ අමුතු ගැම්මක්. හරියට අර්ල්ස් හෝටලයෙ සේවාව උපරිමයෙන්ම සුහදශීලියි කියන එක නොකියා කිව්ව වගේ.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/earls-passikudah/review-131304",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_mOENRl-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_DoumqZ-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_AsjnD5-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_Jw5ih5-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_ozkeXH-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_rIBQhc-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_Q677Rc-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_9cjXeA-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_LVlMKM-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_TyHro6-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_pEiYdR-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_ZPvjtA-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_RCs1ls-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_XlfYK6-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_PRnFyL-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_4LoMvL-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_ue70xE-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_yEjZ4U-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_0aVz5c-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_7GNezt-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_5XYrZX-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_6y9E76-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_EuEUzN-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_1jCmOC-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_H466w7-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_OS5H9g-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_Jr9mM8-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_wPM6LR-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_tjJJMj-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_L1vVRJ-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_N5xrQd-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_un0Aj8-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_ymeupE-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_G3IQbF-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_8ulcg5-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_H4V0qo-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_nV7hSY-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_VqQwpt-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_h1HlrP-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2016/07/yJtIXpCSPo4SZ4A9Oe.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_h1HlrP-640x299.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_VqQwpt-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_mOENRl-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_ozkeXH-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_DoumqZ-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_pEiYdR-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_TyHro6-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_H466w7-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_OS5H9g-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_Jr9mM8-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_rIBQhc-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_EuEUzN-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_wPM6LR-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_6y9E76-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_Q677Rc-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_G3IQbF-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_1jCmOC-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_H4V0qo-640x582.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/05/yimg_wPMcog-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oKIYgP-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_mOENRl-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_DoumqZ-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_AsjnD5-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_Jw5ih5-640x441.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}