{
  "name": "Eat Right ",
  "address": "31, Layard's Road, Colombo 5 (Delivery)",
  "open_until": " Open 8.00AM to 8.00PM ",
  "telephone": "0114247247",
  "description": "EatRight.lk is a delivery site with an exclusively healthy menu, from healthy wraps to healthy kottu. It's also got a lot of info on it to help you stay fit. ",
  "reviews": "Eat Right is a cool new delivery website made for healthy living. You get to pick from a range of healthy salads, wraps, sandwiches, rice and curry - and even healthy kottus, while you can also get health tips and calculate your BMI on the site.\nBesides Eat Right,\nand\nalso does health food delivery.\nEverything on the menu is for Rs. 450, whether rice and curry or sandwich. When we called the hotline, they told us we'd have to order a minimum of five dishes - but they could be spread out over the days, so you're kind of coaxed into eating healthy for the rest of the week too. This means about 2000 bucks for five healthy meals across your week.\nWe got a chicken wrap, and this was as healthy as it gets (save for the roti carbs) - soft thin roti totally loaded with fresh bell peppers, lettuce, tomatoes, carrots, and long thin slices of lightly cooked chicken. It was quite tasty, crunchy, though personally it was a little bland compared to the usual spice in my food, so I had it with a side of tomato sauce.\nThe red rice with fish and curries was more enjoyable, given that it was really well flavoured and spicier. The veggies included cabbage, pathola and brinjals, and the veg to rice ratio was like 3:1. So there's much less rice here than ordinary rice packets, but on the other hand, that's healthier, and personally was still filling because of all the vegetables.\nThe seafood salad was a hefty bowl, basically a fresh cool garden salad, speckled with plenty of fishy chunks. The seafood wasn't what we expected though - the stock photo on the site promised prawns et al, but there were just indistinguishable fishy chunks that didn't carry much flavour. Still, the salads are probably the healthiest type of meal you can have on the menu.\nWe left the best for last - the chicken kottu. They've also got fish and veg kottu on their dinner menu. Kottu in Sri Lanka is now a dinner staple and a late-night favourite for most, but it usually comes heavily tossed in cheese or milk or both, sometimes greasy from oil, and health is the last thing you're considering when you go out for kottu.\nSo the Eat Right version of kottu is cleaner - the chicken seemed very lightly cooked and dominated by the vegetables (carrots, pathola, beans), and the portions were thankfully large, keeping with ordinary kottu standards. The kottu roti itself is carbs, but if you're craving kottu, this is a healthier, less-guilt version.\n\nand the hotline are well maintained - you get the feeling that they care about your eating schedule, not just the product you're purchasing. On the website, you get some useful information on the importance of staying healthy along with a body-mass-index calculator to keep check on your weight - if you don't care about that stuff, just click on the 'Lifestyle' tab for the delivery menu.\nThey deliver at standard breakfast-lunch-dinner times (6AM, 12PM, 8PM), and you have to call a day before to plan it out. Delivery was sharp on time and the stuff was carefully packaged - the roti wraps were double sealed to prevent spillage, and they all came in Eat Right tote bags.\nHealthy eating seems to be a new trend in Colombo (\n,\n,\n), and though McDonald's will always have its popularity there's a growing number of folks now concerned about their health. Eat Right is one of the handful of places that specialize in health-conscious meals so we're glad it's around - plus you can get it brought to your doorstep and make healthy eating a habit with their 5-meal plan.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/eat-right/review-40067",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_9GfO4I-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_sudmOa-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_xG17Vy-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_eYipdy-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_QkIDv4-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_RPbjsQ-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_whgM6d-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_IZBqzN-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/Be7FWdmIZXRAmC8tEt.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_sudmOa-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_eYipdy-640x483.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_9GfO4I-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_xG17Vy-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_IZBqzN-640x354.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_RPbjsQ-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_mmMlXX-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_mOENRl-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_9GfO4I-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_sudmOa-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_xG17Vy-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_eYipdy-640x483.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}