{
  "name": "Elite Indian Restaurant",
  "address": "124 Bauddhaloka Mawatha, Colombo 4",
  "open_until": " Open 11am to 11pm daily",
  "telephone": "0112552882",
  "description": "Elite Indian Restaurant offers a wide range of savory veg and non-veg Indian dishes as well as an array of sweets. ",
  "reviews": "Elite is an Indian restaurant offering savory veg and non-veg Indian dishes, as well as Indian sweets. It's been around for a while and some would consider it an establishment. We dropped in for lunch and were quite disappointed with the fare.\nFrom rice to naan to noodles, Elite has quite a lot to offer on their extensive menu. We started off with a Chicken 65 (Rs 360). Deliciously red and crisp, we got 8 pieces that weren't too dry but weren't too flavourful either.\nWe went the naan route, trying out the Paneer Naan (Rs 100), Butter Naan (Rs 80), Garlic Naan (Rs 90) and the Kheema Naan (Rs 240). The butter naan and garlic naan were the usual fare, nothing to remark on there. The paneer naan was quite disappointing. There was just a smattering of paneer that didn't lend much to the texture or taste of the naan. The kheema naan was pretty good, though, with lots of meat and onion wrapped up inside soft naan. It's pretty oily, especially when you get to the bottom end, but it's also quite delicious.\nThe Elite Special Mutton (Rs 550) was a travesty. I don't understand why they would put their name on this dish, let alone call it special, when there is hardly any meat in it. All we got was jagged bones with a bit of fat on them. What was described as a kheema gravy was actually just an eggy curry. Do not order this, ever.\nTo wash down our sadness, we ordered a Strawberry Lassi (Rs 180) and a Sweet Lassi (Rs 140). The strawberry lassi was disappointing. It tasted like the synthetic Kotmale strawberry milk, lacking the tartness you expect from a lassi, which was disappointing since it would work with the natural taste of strawberry. The sweet lassi was legit, though, with a definite taste of curd, with reassuring sour notes, not too sweet and not too thick.\nThe ultimate disappointment, though, was the Baked Alaska (Rs 350). Yes, we know, it's not an Indian dessert, but it was on the menu so we tried it anyway. First off, the cake is so dry. The ice cream tastes super cheap and synthetic. The presentation is godawful. It just doesn't make for a good finish to what was already an underwhelming meal.\nThe place itself is pretty gaudy. They've got blue lighting off the ceiling, for some odd reason, and the furnishing is quite tacky. Service-wise, the waiters kind of waft about and aren't very attentive. The food can sometimes take forever too.\nElite gets a lot of business, particularly takeaway orders, and it's definitely got a clear customer base. We wouldn't count ourselves among them, though, because the fare is pretty mediocre. At their price point, though, you won't get Indian food that's much better. If you're willing to dish out a little more, you'd get a better bang for your buck at\n. Or try\n.\n\nElite is an Indian restaurant that's been around for a while and some would consider an establishment.\nElite Indian Restaurant offers a wide range of savory veg and non-veg Indian dishes as well as an array of sweets. Although the food is good, call ahead or be prepared to wait a while for your order.\n\nඑලීට් අවන්හලේ වර්ග රැසක රසවත් මාංශ රහිත මෙන්ම සහිත වූත් ඉන්දියන් ආහාර පිරිනැමෙනවා. ඉන්දියානු රසකැවිලි වර්ග රැසකුත් තිබෙනවා. කෑම හොඳ වුණත්, කල්තබා ඇණවුම් කර දිගු වේලාවක් රැඳී සිටින්න බලාපොරොත්තු වන්න.\n",
  "yamu_rating": "We don’t like it",
  "url": "https://www.yamu.lk/place/elite-indian-restaurant/review-103051",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/06/yimg_ZltS6M-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/06/yimg_DKaNnx-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/06/yimg_egeCud-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/06/yimg_4ClD3c-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/06/yimg_bAu7ez-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/06/yimg_z13L26-150x100.JPG",
    "https://www.yamu.lk/wp-content/uploads/2012/10/Elite-Resize1-150x105.jpg",
    "https://www.yamu.lk/uploads/dp/2015/12/0F34X3pTfLr7btifJN.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/06/yimg_DKaNnx-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/06/yimg_egeCud-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/06/yimg_ZltS6M-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/06/yimg_z13L26-320x480.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/06/yimg_4ClD3c-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/06/yimg_bAu7ez-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_ZxQPnP-600x250.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_MZICYn-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2017/05/UoxxN1HYKnznMUfxhe.jpg",
    "https://www.yamu.lk/uploads/dp/2017/05/UoxxN1HYKnznMUfxhe.jpg",
    "https://www.yamu.lk/uploads/dp/2016/10/LMQdj7lnJxDKDVQ1DM.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/06/yimg_ZltS6M-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/06/yimg_DKaNnx-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/06/yimg_egeCud-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/06/yimg_4ClD3c-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}