{
  "name": "Elite (Wattala)",
  "address": "No. 906, Negombo Road, Mabola, Wattala.",
  "open_until": " Open until 12:00 AM",
  "telephone": "0114342667",
  "description": "Elite's been around Colombo for years, but now they've expanded their service to Wattala as well. They serve Chindian (Chinese and Indian) food.",
  "reviews": "The Elite Indian Restaurant in Wattala has been around for about a year or two now. They seem to be run by, or in partnership with, Al-Maas, and this sort of guarantees it to have good food, because of street cred — Al-Maas barely disappoints. They have a huge menu as most of the Indian restaurants are wont to, and a section of Chinese dishes as well. We can't vouch for the veracity of the Chinese, but they're good for filling and flavoursome food.\nWe walked into a crowded restaurant which seemed to be a bit understaffed. We had to wait about ten or so minutes before a server came over. They're a bit slow, and the guy we got was quite unfamiliar with the menu. Placing our order took a bit more time, trouble and explanations than necessary. It also involved flipping through the menu numerous times and pointing the dishes out. After that initial hiccup, service picked up considerably well, as the staff were friendly and attentive.\nTheir food is quite good. We started off with the Paneer 65 (Rs. 400) which was crispy and spicy. The paneer was good, but a bit dry and chunky on the inside, and not as smooth as we're used to with the ones offered at\n. Regardless, it was still a generously portioned and flavoured appetizer.\nTheir Tom Yum soup (Rs. 160) deserves applause as it was not only generous but also tremendously spicy and flavoursome. The lemon grass, chilli, and seafood really made an appearance, with generous portions of shrimps and squid laden within. This could almost be called a meal in itself, and a delicious one at that. For the price, this is an absolute steal.\nNext up, Vegetable Noodles (Rs. 200). Enough for two, and peppered generously with baby corn, mushrooms, leeks and what not, this is really good to try out with any of their spicy meat dishes. I found it a bit too oily for my liking, but that's a personal preference. It was still soft, warm, and good.\nI expected their Pepper Fried Beef (Rs. 340) to be a dry curry, but it wasn't. I'm not sure if it's fried at all, it looks and tastes more like it'd been cooked in currypowder, pepper, and onions for a reasonable amount of time, but was quite chewy despite that.\nThe dish had generous and large chunks of beef in it, but one piece was practically inedible — the chewy, rubbery part that you so often find in most beef dishes bought at any regular\nor restaurant. Other than that though, the dish was quite good overall. Generously doused with pepper and an onion sambol, this went hand in hand with my Butter Naan (Rs. 60).\nNext up is their Calcutta Special Mutton (Rs. 480), a boneless mutton dish.\nThe gravy in this was THE BOMB. Spicy, tangy, lemony, with the right balance of lemon and heat, this was delish. The mutton was so well cooked that it practically fell apart as you tried to cut it. It was soft, and despite all the spices and condiments in the dish, the muttonny flavour came through quite strongly.\nAll in all, the food gets a clear 4 to 5 stars from me.\nHonestly, the ambience isn't all that great. It's rather run down and crowded for dinner, with the crowds thinning out by 9.30 PM. The place is clean, but it's not a very comfy space. It's good for groups of people, loud friends and a fun day out.\nThe service is a bit weird. As in, after being almost non-existent at the begininng, the servers/manager just kept hovering around asking how things were every 10-15 minutes. It's great when proprieters and staff ask how the food is, but a bit uncomfortable when they ask it\nmuch and hover around a lot. I mean, it kind of makes one feel self conscious. But that said, they're really friendly and try to keep you happy.\nElite can work on their interior a bit and polish up their service, but there's no fault to be found with their food. Generous portions and reasonable prices will leave you full, full and happy. Check it out if you're in the vicinity.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/elite-wattala/review-65963",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_xi7Itu-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_bINgZN-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_3yKdYI-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_w9OdDz-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_k21wrn-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_nZdWjP-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/08/bf9TdKPSlnqFHMaZrC.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_xi7Itu-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_bINgZN-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_3yKdYI-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_nZdWjP-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_k21wrn-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_w9OdDz-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oKIYgP-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_zizgop-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2017/05/mBPSOvzowZ25hPjWKS.jpg",
    "https://www.yamu.lk/uploads/dp/2017/05/mBPSOvzowZ25hPjWKS.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_xi7Itu-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_bINgZN-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_3yKdYI-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_w9OdDz-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}