{
  "name": "Far East Indonesian Cuisine",
  "address": "372 Vauxhall Street, Colombo 2.",
  "open_until": null,
  "telephone": "0723835911",
  "description": "From regulars like Nasi Goreng and Mee Goreng, this place also dishes out a pretty great beef rendang.",
  "reviews": "Far East has had a stall at the Good Market for over a year now and have expanded to a proper location  serve mouthwatering (and authentic) Indonesian cuisine at supremely reasonable prices. They've got meat and veggie options along with some solid drinks and desserts.\n\nThey're sticking to authentic Indonesian cuisine because the flavours are unapologetically not as spicy as your local curries. Nothing's been \"Sri Lankanized\", and it could take a bit of getting used to if you love your chilli, but it still packs a potful of flavour.\nWe saw them sizzling some satays over a grill and got about four of those. One stick comes upto Rs. 140, and the chicken is succulent and well flavoured. It's also doused in good peanut sauce slathered on top, and is garnished with some slivers of crisp and tempered onion.\nThe little bit of\non the side adds the only spice, but that has a sweet tang to it too. Rather like the sambol that comes with the\nif you want a point of reference.\nSince we popped over during lunch, we went for one of their set menus with their classic beef rendang, and for a Nasi Goreng. They ticked in at Rs. 600 and Rs. 550 respectively — and while this may seem like a lot for some rice, we think it's totally worth it because of how differently the flavours rang out to us. It was a far cry off from Eastern cuisine you get all over the place (looking at you, food courts).\nThe rice came with some sambol (a sweet and spicy chilli concoction), some pickled veggies, and a stir-fried eggplant curry that had an indescribable flavour (which I can't think of anything to compare it with). The highlight of the dish was the beef, which was slow-cooked in spices to perfection so that it fell apart as the fork made contact.\nThe portions were generous, with the curries and rice making taking up almost equal halves of the plate (as opposed to our plate-full-of-rice meals).\nThe Nasi Goreng was also a large portion (easily enough for two) and came with the sambol dip, scrambled eggs on top, and generous chunks of chicken in it. The rice was soft and well cooked, and all the flavours blended in superbly. There was a strong herbal undertone to it, sort of gingery. It was quite good.\nSince the food didn't disappoint and we wanted to eat even more, we got a piece of roast chicken as well. This came upto 350 bucks, and was (especially after the satays and rice) very filling. Just like the beef, it was steeped in spices and flavour, and was the meat was ready to fall off the bone.\nNext up were the drinks. Their menu has Cendol (green gram flour, coconut milk, slices of ripe jackfruit, palm sugar syrup topped with crushed ice) Es Buah and Es Teler — both mixed fruit concoctions combined with coconut milk and palm sugar in different variations. Those are apparently prepared only in the evenings though, so we stuck with the coffees, which, on a hot and sweltering day, were\nPriced at Rs. 100, this is a steal. It had a really strong coffee flavour, wasn't unpleasantly bitter, and wasn't doused in a lot of sugar as well. We tried their white coffee, mixed coffee, and another which we randomly picked off the menu displayed on the counter, and all three were great. Incredibly refreshing on a hot afternoon.\n\nFar East is a tiny little shop which would probably seat five people and be claustrophobic if there were more.\nIt's pristine and clean though, and the staff are friendly and helpful. They were happy to explain what we didn't understand, Like what in the world a\nis. There are about three people behind the counter, but not all of them are too fluent with English except for the proprietor it seems.\n\nThis place has got great food for pretty reasonable prices and super coffee. Our two plates of rice, the roast chicken, chicken satays, and three cups of coffee all came up to Rs. 2000 odd. It's definite value for money, and we would recommend dropping in for a bite or picking some coffee up on the way if you're in the Vauxhall area.\nAuthentic Indo cuisine at supremely reasonable prices.\nIf you want a filling meal when you're hanging around the Good Market, check this place out.\n\nකටට රසට ඉන්දුනීසියන් කෑම කන්න ඕනේ නං, මෙතනයි තැන.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/far-east-indonesian-cuisine/review-117608",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_ZmGyHQ-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_ppUGUZ-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_GdrW01-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_2JWF7N-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_4QzL3j-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_JTdybA-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_yZ1gVn-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_T10AAr-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_j18QFM-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_UKn5Cf-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_m5uRlI-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_DkrcsD-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_bdLqhH-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_FBhwEW-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_fs7wy2-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_inQJQy-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_JVSUB0-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_8JccKL-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/08/bf9TdKPSlnqFHMaZrC.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_j18QFM-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_ppUGUZ-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_fs7wy2-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_JVSUB0-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_GdrW01-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_8JccKL-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_MGXyaY-600x250.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/12/yimg_m5n55O-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://www.yamu.lk/uploads/dp/2017/04/KE2F77hW9uoRt7RHja.jpg",
    "https://www.yamu.lk/uploads/dp/2017/04/KE2F77hW9uoRt7RHja.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_ZmGyHQ-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_ppUGUZ-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_GdrW01-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_2JWF7N-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}