{
  "name": "Fat Panda",
  "address": "30A, Sea Avenue, Colombo 03",
  "open_until": " Open until 11:00 PM",
  "telephone": "0117772772",
  "description": "A multi-cuisine casual restaurant off Marine Drive, with a whole range of fusion Asian fare.",
  "reviews": "Fat Panda is a one-stop-shop for fusion Asian dining. The best part is that you don't have to dress up and you can BYOB. Don't confuse it with another zaftig animal,\n, which is a bit further along Marine Drive.\nAt first glance, the menu seems expensive. But then you realise it's inclusive of pesky taxes and hidden charges and it doesn't seem too bad. We tried an Indonesian Satay (Rs. 1100), a Singapore Chilli Crab (Rs. 1650), and a Pad Thai (Rs. 1300).\nThe satay was a hefty portion of 3 thick chicken satays on a bed of pickled vegetables accompanied by a thick home-made herby peanut sauce, and steamed rice topped with caramelized crispy onion. The flavours at play were great, and everything well-prepared, but we thought the pieces of chicken were too thick (which made them a bit dry on the inside).\nOur pad thai on the other hand was excellent. The delicate Thai flavours, with zesty lemongrass and soft, succulent chicken bits made for a delicious dish. This was also fairly large and in my opinion enough for two to share. We'll definitely be coming back for this.\nOur final, greatest dish was the crab. A massive, fiery concoction of crispy sweet-chilli batter, succulent medium shell crab, and chunks of flavour-soaked fresh crab meat, this is one of my favourite crab preparations in the city. Again, I felt this was enough for two people and totally worth shelling out for (heh). Also where are you going to get this quality and quantity of crab for this price?\nThe drinks were a tad boring, just a few juices and mocktails. We opted for an Orange Fizz (Rs. 400), which was basically orange juice and soda, and a Jungle Cooler (Rs. 500) which was a pina colada without alcohol.\nThe waitstaff were great throughout our experience. Swift, friendly, and efficient. We were pleasantly surprised at how quickly the food came out despite being prepared fresh (although this is partially because we were the only people there). They also knew their way around the menu.\nThe restaurant commandeers two levels of a small building on the tiny Sea Avenue. The top floor isn't ready yet, but they're planning to create a rooftop area for small events etc. As it stands, the decor is quite confused, with plastic wood and brick wallpaper, as well as Emperor Quin's terracotta army and charming newspaper geisha artwork upstairs (even though they don't really serve either Mainland Chinese or Japanese cuisine).\nWe sat downstairs for lunch, which was a huge mistake as the room wasn't properly air conditioned and we were slowly baking and sweating. Also, the front of the restaurant is on street level and completely glass, so we found ourselves in a greenhouse, subject to staring and soliciting by the people on the road outside. Our only view apart from this was a run down dry cleaners opposite.\nThe food and service here are excellent. We didn't love the ambience, but who cares about the view when you're elbow-deep in excellent chilli crab? Overall, we'd highly recommend this spot if you want somewhere to have a quiet corkage-free drink and a whole lot of crab.\nOur first dining experience at the brand new Fat Panda in Colpetty.\n\nෆැට් පැන්ඩා කියන්නෙ  චයිනීස්, සිංගප්පූරු, කොරියන්, ඉන්දුනීසියන්  කෑම එක තැනකදි කන්න පුළුවන් ඒෂියන් ෆියුෂන් රෙස්ටෝරනට් එකක්.  එළියෙන් බොන්න අරන් යන්නත් පුළුවන්.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/fat-panda/review-179386",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/05/yimg_oiXYUv-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/05/yimg_iYLmdr-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/05/yimg_kmteBG-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/05/yimg_W7Sw0u-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/05/yimg_AQv52p-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/05/yimg_wPW3vl-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/05/yimg_4x9h65-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/05/yimg_ADsTfq-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2017/04/KE2F77hW9uoRt7RHja.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/05/yimg_wPW3vl-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/05/yimg_oiXYUv-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/05/yimg_AQv52p-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/05/yimg_W7Sw0u-640x409.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/05/yimg_iYLmdr-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/05/yimg_kmteBG-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/05/yimg_4x9h65-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_zFF92D-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/06/yimg_QQpjsV-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2017/04/KE2F77hW9uoRt7RHja.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/05/yimg_oiXYUv-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/05/yimg_iYLmdr-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/05/yimg_kmteBG-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/05/yimg_W7Sw0u-640x409.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}