{
  "name": "Fenghuang Lou",
  "address": "43, Jawatta Road, Colombo 05",
  "open_until": " Open 11 AM - 3 PM, 6 PM - 11 PM",
  "telephone": "0702277800",
  "description": "The brand new Chinese place on Jawatta Road.",
  "reviews": "Uber-authentic Chinese restaurants have been mushrooming all over Colombo. You can tell by the inscrutable signage (unless you can read Mandarin that is), and the ginormous shiny tour buses parked outside. Why Chinese tourists would travel the thousands of miles to come to Sri Lanka and eat Chinese food here is beyond our understanding, but oh well.\nDuring a foray to the bathroom, I poked my head into the kitchen and noticed an officious-looking Chinese chef. Rest assured I was getting an \"authentic\" meal, we continued our experience.\nWe commenced our luncheon with a Lankan staple, the indigenous Hot Butter Cuttlefish (Rs. 600). Light of our lives, fire of our loins. It was actually quite good, and a solid portion for a starter. It was a tad different from the usual beach strip HBC, this batter was super light and crunchy. No idea what they've used, but we were absolutely on board.\nOn our sprightly waiter's recommendation, we also tried about 200 grams of the spiced crab (price is variable, but it's generally about Rs. 600 per 100 grams). Again, the quantity was commendable even though we thought 200 grams would be negligible flesh. The flavours were great too, but the crab just wasn't mindblowing. Perhaps a larger quantity would allow for a meatier experience.\nAlso on the waiter's recommendation, we attempted the simplistic Half Chicken in Gravy (Rs 750). Underpromise, overdeliver is clearly this menu's motto. Sometimes, simple is great. The chicken was lightly roasted, with lots of lovely bits of flesh just falling off the bone and sliding about in the deliciously greasy gravy. Again, the quantity was commendable for the price.\nWe also tried a rice, albeit not the rice we actually wanted. Instead of the vegetable fried rice we ordered, we mysteriously got some other fancy rice which came with seafood and inexplicable bits of lamb. Surf and turf rice? It was actually very tasty, but probably not the greatest option for vegetarians. The rice was enough for about 3 people, which sort of justified the Rs. 1100 price tag.\nFenghuang Lou, apart from its incredibly easy to pronounce name (tell your tinier family members to repeat it 20 times and watch madness ensue), also has a pretty straightforward menu. You don't really need it too much though, because the waiters seem to be absolutely knowledgable. It's a brand new place, but they already seem to know what the crowd favourites are, and how much you'll need.\nOur waiter was very swift, bringing out menus and dishes at the speed of a shinkansen. He was also superbly friendly, effusively greeting and seating us and making us feel like the prettiest girl at the ball. However, what he had in enthusiasm, he lacked in accuracy. He tried to convince us to take the mixed rice, we said no we just wanted the vegetable fried rice, there was some verbal scuffling, he finally agreed with us and scribbled something down looking cowed. In the end, we got the rice he insisted upon anyway. We also got charged the extra Rs. 400 odd it cost. Everything else was brilliant so we didn't pull a fuss (I did however shake my fist at the bill in a fiesty pirate fashion).\nApart from that, our waiter was great, even hustling us beer from the nearby supermarket and then charging us a middling Rs. 400 per bottle of Lion. He also picked Lion without us choosing it beforehand, so clearly he is one of the boys. We don't know his name, but we can call him benign\n. Or Wijayapala Lite. We also noticed a waitress in a headscarf, which is actually a first for Colombo (we think). They don't serve any pork either, so clearly they're aiming to be Muslim-friendly.\nNot particularly exciting, the ambience is your usual Chinese restaurant white tablecloths and non-descript wallpaper. It's clean though, which is a huge plus. Bathrooms remind me of a school bathroom for some undefinable reason, but are also clean. There also little signs in English and Japanese (why Japanese? Good question.) inside the stalls that say \"Watch out Knockhead!\". I laughed after I got over the stinging pain of the insult.\nThere's actually heaps of space inside and upstairs. They appear to cater quite a bit to large groups (refer tour buses parked outside for source), so there are plenty of private and semi-private rooms, and tables set for 10 or more at a time. They, much like Xilaton, appear to want to segregate locals from the tourists, but if that's for our benefit or theirs we'll never know.\nFenghuang Lou, or Flou as I now prefer to call it (feel free to make this a thing), is a pretty solid Chinese food spot. The food was actually very reasonable given the great taste and quantity, and if you're not really looking for a romance spot, the ambience is fine too. The service is engaging if not accurate, so that's a plus. Overall, we'd recommend Flou. Come in your own tour bus and commandeer an entire room for the full experience.\n\n\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/feng-huang-lou/review-96906",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_3bWLpL-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_oSl7We-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_YeeTPO-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_cEZZ32-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_n4iEpE-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_yCSnFb-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_sPWrqt-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_lR1b8J-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_19eXwr-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2017/04/KE2F77hW9uoRt7RHja.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_YeeTPO-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_n4iEpE-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_cEZZ32-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_oSl7We-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_zFF92D-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_KNwFTs-600x250.JPG",
    "https://www.yamu.lk/uploads/dp/2017/04/KE2F77hW9uoRt7RHja.jpg",
    "https://www.yamu.lk/uploads/dp/2017/04/KE2F77hW9uoRt7RHja.jpg",
    "https://www.yamu.lk/uploads/dp/2017/04/KE2F77hW9uoRt7RHja.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_3bWLpL-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_oSl7We-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_YeeTPO-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_cEZZ32-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}