{
  "name": "Fine Things (Hilton)",
  "address": "2, Sir Chittampalam A Gardiner Mawatha, Colombo 02",
  "open_until": " Open until 12:00 AM",
  "telephone": "0112492125",
  "description": "Fine Things has been part of Hilton for years now. They are the one-stop for cakes and chocolates along with anything sweet and fine.",
  "reviews": "Fine Things has always been the go-to, reliable spot for birthday cakes, anniversary cakes or just cakes because you don't need a reason to eat a whole cake by yourself.\nWhile the Hilton is still under renovation and feels nothing like it did before the face-lift mission began, Fine Things stands firm.\nHowever, it can get a little confusing as Fine Things and\nseem to overlap somehow.\n\nWe ordered a slice of Oreo Cheesecake (Rs 380), 2 chocolates (Rs 85 each), an Iced Coffee (Rs 460), and a regular Chicken Sandwich (Rs 950). All prices mentioned are exclusive of taxes.\nThere was a little confusion at the point of ordering and billing, and the bills for everything except the chocolates were issued by Hilton's\n(which is much smaller and looks less nicer than the old one). So, Fine Things and Thorana Lounge work hand in hand. Hence, you might be billed by either of the places when placing your order.\nThe Oreo Cheesecake was generously topped with crushed Oreos and you could see little bits of Oreos poking out everywhere. This cheesecake was good, but had it been a little sweeter, it would have tasted amazing.\nIced Coffee is not the same as Coffee Milkshake and this was not Iced Coffee, this was Coffee Milkshake. It was thick and frothy, with a slight Vanilla ice cream taste coming through. But it was not bad. It just was not Iced Coffee. It tasted strong and had the right amount of sugar.\nThis picture is slightly deceiving. You see two sandwiches, but they are, in fact, four. Sweet surprises for the hungry stomachs!\nEven more surprising is the mediocre taste of the sandwich. More than surprising, this was disappointing. Dry with very little seasoning and lots of chopped chillies, but packed with a lot of chicken, this does not reserve a spot in the World's Best Sandwiches. The plentiful french fries were great though, and I didn't bother with what looked like a stingy shot glass portion of coleslaw. #NoVeggieLife\nFrom the array of chocolates I opted for Flaky Almonds and White Chocolate Filled with Praline Cream.\nThe Flaky Almond has been an all-time favorite for everyone who loves their nuts. It's just almond flakes in chocolate. For almost Rs 110 a piece (inclusive of taxes), this may appear steep, but it's Hilton, so you gotta deal with it.\nThe white chocolate was good too. The praline cream was well teamed with the white chocolate. For someone who likes both praline and white chocolate, this was a real treat.\n\nAs Hilton is\ngetting their refurbishment done, it's a little confusing. You will be served by people at Fine Things and Thorana Lounge. Either way, the service is very slow and poor. My order for the slice of cheesecake was forgotten and an \"aaah, cheesecake\" was the reply when I reminded them. You will find Hilton's staff huddling in groups like teenagers at some Fun Fair, but everyone will be genuinely concerned about your meal once it arrives, which is nice. However, quite disappointing to see such forgetful and irresponsible staff.\nAlso, it's worth mentioning how conveniently my dessert spoon was forgotten, but was brought only upon my request.  Without bothering, I would have shoved the cheesecake in my mouth with my bare hands, but gotta act ladylike, posh and whatnot at these big-big hotels, men.\nIn terms of ambience, I would say it's pretty basic. Bad color coordination between the furniture and the carpet. What is going on, Hilton?\nHere's hoping the refurbishments bring about stunning interior.\nI didn't try the full cakes, obviously, but from my past experience, cakes at Fine Things have been of the finest. They do live up to their name in terms of quality, but if you are not going to just buy-and-rush, and you want to put a little chit chat, this may not be the most ideal venue, unless you are a montessori teacher and are accustomed to confused, lost and forgotten expressions (and service).\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/fine-things-hilton/review-120781",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_SP3oYo-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_ZcbGBH-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_0GylJz-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_pvmmTn-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_NfqrcD-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_SAjQLh-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_ArnwKO-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_eFdDvj-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_dPKwiw-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_NfVLDa-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_qwAfcN-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2016/10/LMQdj7lnJxDKDVQ1DM.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_SP3oYo-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_0GylJz-480x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_SAjQLh-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_eFdDvj-640x439.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_qwAfcN-480x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_NfVLDa-480x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_ArnwKO-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/04/yimg_O3N2RS-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_Jw5H7t-600x250.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_SP3oYo-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_ZcbGBH-480x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_0GylJz-480x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_pvmmTn-480x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}