{
  "name": "Flamingo Restaurant (Ceylon City Hotel)",
  "address": "11, Upatissa Road, Colombo 4",
  "open_until": " Open until 10:00 PM",
  "telephone": "0112508000",
  "description": "Flamingo Restaurant (which has been around forever) serves up an interesting mix of cuisines ranging from Arabic, Western,  Italian and Sri Lankan.",
  "reviews": "The Ceylon City Hotel's been around for a while now, and they've steadily been climbing up the recreational ladder with their quirky little hotel down the slightly dodgy Upatissa Lane. At first the hotel doesn't look like anything to rave about save for their slightly 'Parisian' vibe they've got going on with their cosy, dark interior and off white, 'blocky' exterior. We've heard good things about their restaurant though so off we went to enjoy a nice little tête-à-tête over lunch at the Flamingo Restaurant.\n\nThey don't specialise in a certain type of cuisine in particular as they serve up a mix of Western, Italian, Arabic, Chinese and of course Sri Lankan dishes. This isn't exactly a bad thing since they have a huge range of different dishes to choose from but it can get a little overwhelming.\nWe decided to get the Seafood Pasta with Balsamic (Penne with prawns, fish, cuttlefish, cream, Balsamic and pumpkin) and at Rs. 700 it was a pretty filling dish with big, fat prawns and lots of cuttlefish and chunks of fish here and there. The pasta was well cooked, the seafood was delicious and the only little thing I'd have to comment on is the fact that they could afford to go a little easy on the red sauce.\nDili got the Nasi Goreng (Rs. 800) and it wasn't half bad for the price. The spice wasn't overdone, there were plenty of spring onions and carrots mixed in with the rice. The best part was that the egg was absolutely perfect. I've gotten accustomed to having a rubbery, sad egg with Nasi Goreng but the egg was well done and the yolk was still runny which is something I love.\nThe Singapore Crab (Rs. 700), although I had my doubts about how this dish would be pulled off, turned out to be the star of the show. The sweet chilli sauce was delicious and tangy and there was a LOT of crab on that dish and I appreciated how it was actual meaty crab instead of empty shells. The crab meat itself was soft and full of flavour. If you're looking for a good crab dish then this is definitely a must-try.\n\nDili got the Cinnamon Iced Tea (Rs. 350) which was refreshing, and the flavour really came through since they'd blended in actual cinnamon.\nI got an Iced Tea with Lemon and Fresh Mint (Rs. 380) which I'm happy to report doesn't taste like it was soaked out of a teabag. This is a glass of very honest, iced tea with lime not lemon, that tastes strongly of good old Ceylon tea and hints of lime.\n\nThe service is quite efficient, and our orders took a little over 10 minutes to arrive.\nThe ambience though is a little strange. First of all, the place is nice, clean and quiet with big windows that let in a lot of light. There's a slight... generic feel to the restaurant with its rectangular chairs and tables which is why it's so off-putting. You wouldn't expect a place that looks like this to serve such good food.\nAll in all, it was very pleasant and keep in mind that they do NOT serve alcohol and all the food is guaranteed Halal.\nIf you're thinking of grabbing some lunch, or going on a date I'd recommend this place. The food is good, it didn't seem too busy and their drinks aren't too bad either. Plus you could always stroll down the beach once you're done to work off the Singapore Crab (which you should definitely get).\nThe Flamingo Restaurant serves Breakfast, Lunch and Dinner a-la-carte at The Ceylon City Hotel. We dropped in to check them out.\n\nවටපිටාවට රැවටෙන්නෙ නැතුව මෙහෙට වෙලාවක ඇවිත් යන්න. හොඳ, ගානට වටින, වැදගත් තැනක් විදියට තමයි අපිට ෆ්ලමින්ගෝ රෙස්ටොරන්ට් එක තේරුණේ.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/the-flamingo/review-134672",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_GmVOlX-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_NLwpuo-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_mPvbRM-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_kwtwt2-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_3e6Y5t-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_T9DC7Q-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_uPOc4x-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_q7hEUh-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_icA3Je-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_N9eNIl-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_nxIEap-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/05/yimg_YCaGuf-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2017/01/sFOlV64o5GU2djDVqy.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_3e6Y5t-640x404.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_T9DC7Q-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_NLwpuo-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_kwtwt2-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_nxIEap-188x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_mPvbRM-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_icA3Je-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_mOENRl-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oKIYgP-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_GmVOlX-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_NLwpuo-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_mPvbRM-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_kwtwt2-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}