{
  "name": "Flamingo House",
  "address": "58/4, Horton Place, Colombo 7",
  "open_until": " Open 11 AM–11 PM",
  "telephone": "0778597766",
  "description": "The aptly-named Flamingo House is the newest—and probably funkiest— addition to Colombo’s restaurant repertoire. The food is inconsistent but interesting, but the excellent cocktails and crazy interior win brownie points.",
  "reviews": "The aptly-named Flamingo House is the newest—and possibly funkiest—addition to Colombo’s restaurant scene. The food is inconsistent but interesting, but the excellent cocktails and crazy interior win brownie points.\nAt FH, when they say flamingo, they mean flamingo. With murals of the pink-feathered bird all over the restaurant walls, they make sure you don't forget the theme. Replacing the restaurant section of Gerard Mendis Chocolatier, this is arguably one of the hippest, most ambitious restaurants in Colombo right now. Walking in, the first thing that crossed my mind was that this is probably what the Mad Hatter’s house would look like, with no two things matching.\nAfter we had a moment to take it all in, we began to see the subtle touches like the hanging bird cages, artsy statues and funky drawings that really make Flamingo House one-of-a-kind. It's clear that a lot of thought has gone into the design elements, like having the detailed history of the restaurant printed on the table mats and the backstory of each cocktail in their menu description, for instance.\nFlamingo House has been open for just under a month now, but the service we experienced was nothing short of excellent, ranging from the waiter’s understanding of the menu to the quick service times. One waiter in particular took charge and handled most of the tables, with the younger guys shadowing him.\nThe menu at FH isn’t quite as insane as the interior decor, but it does offer an impressive variety of Eurasian dishes. We wouldn’t call it fusion — it's mostly Asian and locally-inspired dishes with a Western twist and vice versa. The prices teeter on the higher-end of the spectrum, although they do also have a bunch of reasonably-priced options. Expect to pay around 2k per person sans cocktails.\nThe cocktail menu at FH isn’t as extensive\nas that of some of the more prominent bars in the city, but it’s certainly one of the most interesting, with a small story behind each cocktail. While they don’t have a happy hour yet, the cocktails aren't too expensive, mostly priced at around Rs. 800.\nWe tried the flamingo rosa (Rs. 750) a mix of vodka, mint and raspberry and the kalinga gimlet (Rs. 800), a combination of gin, lime and basil leaves. Both being signature cocktails, we were unsure about what to expect. But they turned out be brilliant. Neither was too intense in terms of alcohol, so the flavour of the raspberry and basil came through beautifully. While they had probably used frozen raspberries for the flamingo rosa, it still worked extremely well.\nOur choice of starters was a pretty simple one. We knew we had to try the isso wadé (Rs. 450) as soon as we saw it on the menu. Yes, Rs. 450 for two wadé is a bit ridiculous, but these were quite sizeable, chunkier than the usual street vendor version and topped with two full prawns. The seasoning and crunchy texture were on point but we could have used a bit more heat. However, the accompanying dips (curd, raw onion sambol and chilli) did help a bit in that aspect.\nThough not listed under mains, the pulled pork sandwich (Rs. 950) definitely qualifies as one in terms of portion size. We appreciated the fact that they kept the preparation simple, and allowed the flavour and the stringy texture of the pulled pork to come through. The pork itself had a good balance of savoury and slightly sweet notes. Although we thought the bread was a tad dry, this would be a minor quibble to most. For the price, we think this is a pretty good deal.\nThe lamb chops with dark cherry and port wine (Rs. 1,900) was a mixed bag with some elements that we enjoyed and others not quite as much. It came with mashed potatoes and and a pickled vegetable salad, both of which were fine with the exception of the eggplant that didn’t quite work due to its soggy texture. We asked for the lamb to be done medium rare but it turned up unevenly cooked. While certain parts were perfect, others were a bit overdone. The lamb chops tasted fine but the cherry and port wine reduction didn’t quite add the depth and intensity we were looking for.\nWe finished off with the baya silvestre (Rs. 700), which is basically a fancy name for a wild berry cheesecake. This ticked the boxes in terms of richness and sweetness, though the little dollop of wild berry compote on top didn’t quite provide the acidity that this dessert needed.\nWith its kooky interiors and Eurasian cuisine, Flamingo House has a lot going for it. While tasty, the food has room for improvement. The drinks and the service, on the other hand, are excellent.\n\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/flamingo-house/review-55234",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_YfHn4y-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_zEuF8Q-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_PwS6WO-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_90wom7-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_WkOsKr-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_71kfqz-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_IzY9ph-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_QWkpRj-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_rJzg9k-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_UNCsi9-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_iAMBX2-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_YfHn4y-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_90wom7-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_QWkpRj-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_UNCsi9-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_PwS6WO-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_iAMBX2-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_WkOsKr-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_zEuF8Q-640x447.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_IzY9ph-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_71kfqz-318x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oKIYgP-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/05/yimg_wPMcog-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_YfHn4y-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_zEuF8Q-640x447.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_PwS6WO-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_90wom7-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}