{
  "name": "Flavors (Galadari) ",
  "address": "Hotel Galadari, 64 Lotus Road, Colombo 1",
  "open_until": " Open 12.00 PM - 3.00 PM & 7.00 PM - 11.00 PM",
  "telephone": "0112544544",
  "description": "Flavors is Galadari Hotel's Indian restaurant. Their food is actually pretty decent, but the ambience, or rather the lack of it makes you want to wrap up your meal as fast as possible.",
  "reviews": "Flavors is Galadari Hotel's Indian restaurant. Their food is actually pretty decent, but the ambience, or rather the lack of it, makes you want to wrap up your meal as fast as possible.\nColombo has a ton of\n, most of them with a respectable amount of clientele. Flavors is one of the less well known out of the bunch, but that's mostly due to its location. Their Indian fare is actually not too bad, but its location at the back of Galadari Hotel's lobby is pretty depressing and the restaurant itself isn't in the best shape either. Prices are on par with most higher end Indian restaurants, so expect to pay around Rs. 1500 per head.\nThey start you off with the usual complimentary papads along with the mint, mango and tomato chutneys. The papads were fine, but what we really liked here was the tomato and mango chutney. I'm generally not a huge fan of tomato purees and such but this chutney had good mix of tang, spice and sweetness.\nThe butter naan and garlic naan (Rs. 250 each) was also on point in terms of texture and thickness. The garlic naan actually has quite a lot of garlic in it, which is something to keep in mind when ordering. We appreciate the fact that the butter naan wasn't bathed in butter also.\nTo go with the bread we ordered their mamsam munukai pulusu (Rs. 1050) which is roughly translates to a spiced lamb curry in a lightly milky gravy. The portion here was just enough for two and for the price we would have liked a bit more.\nFlavourwise it had a good balance of seasoning and spices with a bit of heat from the green chillies coming through as well. The lamb was also cooked well, retaining a bit of it's tenderness and binding well to the thick gravy.\nThe murgh tikka (Rs. 800) on the other hand, was a disappointment. Firstly, the portion is quite small with only about five pieces of chicken, which would have been acceptable had it been really tasty. Unfortunately, the chicken was way overcooked to the point where the centre was white and chalky, which is a shame since the seasoning was fine and it looked quite appetizing.\nWhen it comes to restaurants, the quality of the food is the most important factor. However, when the ambience and service don't match up, the overall experience can be very poor, regardless of how good the food was. This was Flavors' biggest letdown for us.\nThe Galadari lobby is pretty bad location to have a restaurant, with some poor lighting and people constantly walking about. The hotel is very much in need of a refurbishment with most of the furniture looking old and dusty. The interior of the restaurant itself leaves much to be desired with tacky black tablecloths and torn menus not helping either.\nThe waiters who served us was a very nice guys- attentive and fast. That being said, they did mistake our order once which resulted in a delay and they lacked the level of professionalism you'd generally see at other hotels in Colombo.\nFlavors actually does a pretty good take on North Indian cuisine. Unfortunately, Galadari Hotel's lobby makes for unpleasantly dodgy location which ultimately sullies the entire experience.\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/flavours/review-48299",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_NEcKMl-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_b1FBpq-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_CruduM-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_sjRn77-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_Ddfj8m-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_5l3zoD-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_b1FBpq-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_sjRn77-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_5l3zoD-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_Ddfj8m-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_NEcKMl-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_CruduM-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://www.yamu.lk/wp-content/uploads/2014/09/DSCF9533-588x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_HBgEKY-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_NEcKMl-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_b1FBpq-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_CruduM-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_sjRn77-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}