{
  "name": "Flower Drum",
  "address": "38, Thurstan Road, Colombo 3",
  "open_until": " Open until 10:00 PM",
  "telephone": "0112577350",
  "description": "Good ambience, decent food, over-rated chili paste. Okay value for groups.",
  "reviews": "Flower Drum, or Oak Ray Flower Drum as they're now calling themselves, is a household name that brings to mind two things: Sri Lankan chinese food, and chilli paste. Their new location is upstairs, just at the 5th Lane/Thurstan Road corner. They've also got a take-away location on Thurstan Road. I went there for lunch and spent the rest of the afternoon in a post-lunch stupor.\nYou have to walk past a jewellery store and a shop selling Sri Lankan souveniers to get to the stairs and reach Flower Drum. If the place is ever full, there's a few chairs just by the door where you can wait and have a look through the menu. Stepping in, the new layout is quite refreshing, clean and classy. They're got a lovely floral print going on with their furniture, spacious dining rooms, and a lot of daylight coming through.\nAs you walk in and take the left towards the reception, there's this giant mirror with an elaborate frame that catches you off guard. You have about 10 steps to fix your hair before you enter the main dining area.\nThis is a great spot to host a group of eight, even, with the lovely rotating glass, or Lazy Susan, that works pretty well with the dark wood and the rest of the colour scheme. I really enjoyed taking photographs here, and the staff was totally chilled out about it.\nMy girlfriend joined me for lunch, and our meal kicked off on a good start with the stellar Sesame Prawn Toast (Rs. 825). If anything, go for this! Ideal for when you're on a few drinks and want to indulge in something deep fried, these bites are crunchy, juicy, and are served with prawn crackers! The presentation doesn't work very well with the star of the show obscured by a canopy of prawn crackers, but it really played to nostalgia of\ngoing to the cinema. If you've had the prawn balls at other Chinese stops, this is quite similar but works way better. Hit this with some beers. They serve Lion Lager.\n\n\nWe work 9-5 though, so we had to go the juice route. I got my usual lime juice and my girlfriend tried the pineapple. Watered down pineapple juice is not as great when you want it chilled and it comes at room-temperature. Well, air conditioned room temperature. For one in the afternoon, I felt the air conditioning was a little too chilly. Lime juice, also watered down, was not quite sour enough to my liking, but, still tasted alright.  I liked the simple presentation; they couldn't go wrong there. At Rs 350 per juice, they've also got orange juice, mixed fruit and papaya.\nWe ordered a small portion of the Singapore-style noodles (Rs. 650) and it was enough to feed four people, easily. Honestly, though, there was nothing Singaporean about it. I felt like I was eating Harischandra noodles, very lightly seasoned, with a ratio of 80% noodle, 10% assorted meats and 10% vegetables. I asked the waiter to suggest their best noodles, and this was what he pushed on the day. This noodle is almost identical to the one at The Station, who also push this option to their customers.\nFor sides, I went the nostalgic route and ordered beef with kan kun. Growing up, Chinese food was synonymous with Chinese Dragon and the one dish that awed me was the kan kun. Flower drum does it alright. You get plenty of beef, well-seasoned, not grisly, but a little tough. The kan kun is only crunchy at the stems, and doesn't taste super fresh, but I'm nit-picking. For Rs 770, it's worthwhile sharing this with two people. If you've got a group of four or more, you'll need an additional side.\nI don't understand the hype surrounding the Flower Drum chili paste. This is all I've heard about Flower Drum, ever. All I really tasted was a hard hit of chili and a lot of chili oil. The lemongrass and prawns that are involved in this mix aren't noticeable at all, be it texture or taste. Buy Zensai chili paste instead from your neighbourhood Keells, they've even got a vegetarian product. It's chili paste, and not chili oil. Or just learn how to make your own. Seriously, stop calling this chili paste.\nThe staff at Flower Drum are very attentive, and seem to mostly know what they're doing. My waiter wasn't too fluent in English, so I switched to Sinhala, and he only made a mistake with the order of drinks. Once this was brought to their notice, they brought the right drink with no hassle. They seem quite comfortable in their environment and that's always reassuring.\nFlower Drum has a good location and a great ambience, but the food has a lot of room for improvement. Given that their name is so well-known, it really feels like they need to up their game, already. The two of us ate for Rs 3000, and that's a bit of an indulgence for a step-out-of-office-for-lunch level meal. Don't go out of your way. Try the sesame prawn toast, though.\nStep-out-of-office-for-lunch level food for a little too much money.\nWe don't know what happened, but the Flower Drum that we called immortal is dead. It's slightly re-incarnated as a tiny take-away joint, but not really. For anything near the old experience you'll have to go to their Pelawatta outlet. How times change.\nFlower Drum - the absolute archteype of Sri Lankan- Chinese food.  Staples like hot butter cuttlefish and sweet and sour pork, beef in oyster sauce have kept customers coming back for over 30 years.\n\nபிளவர் ட்ரம் - இலங்கையருக்கு ஏற்ற பாணியிலான சீன உணவுகளுக்கான இடம். 1982 இல் ஆரம்பிக்கப்பட்டு இன்றும் இலங்கையில் இருக்கும் மிக பிரபலமான இலங்கை சீன குடும்பமான \"கை\" இனால் நடாத்தப்படுகின்றது. பட்டர் கணவாய், இனிப்பு புளிப்பு கலந்த பன்றி இறைச்சி, ஒயிஸ்டர் சோஸில் சமைக்கப்பட்ட மாட்டிறைச்சி போன்ற உணவுகள் கடந்த 30 வருடங்களாக வாடிக்கையாளர்களை கவர்ந்துகொண்டிருக்கின்றது.\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/flower-drum/review-57973",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_NDFiqI-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_Iy0O0T-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_A1jfsP-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_Y9fpYK-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_HJZD8f-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_S7xTQj-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_uCrapU-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_mNcFyO-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_l95WDG-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_YCHpdT-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_PmBcjO-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_O1ZEzH-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_nrFkw8-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_jzPvWI-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_Euqyox-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_vXyym5-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_YZvhax-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_2T6cXM-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_JvBgYo-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_WK9HnH-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_Fs2BSv-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_drniDy-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_SoA8q1-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_4L16IS-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_pVEWHY-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_EzJZ12-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_DCJAL8-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_leQF7J-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_zlzoal-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_NEsMfk-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_alThKz-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_Fv7KKP-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_9aYyEA-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/12/0F34X3pTfLr7btifJN.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_SoA8q1-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_4L16IS-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_EzJZ12-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_rQSmOo-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_Y9fpYK-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_uCrapU-320x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_zlzoal-306x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_leQF7J-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_NDFiqI-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_HJZD8f-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_A1jfsP-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_9aYyEA-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_Fv7KKP-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_Iy0O0T-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/05/yimg_l5jhXS-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_MGXyaY-600x250.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_NDFiqI-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_Iy0O0T-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_A1jfsP-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_Y9fpYK-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}