{
  "name": "Foodie Adventure",
  "address": "41, Malwatta Road, Nawala",
  "open_until": " Open 9.00 AM - 7.00 PM (24 hours in advance)",
  "telephone": "0777352074",
  "description": "Foodie Adventure is a home cook in Nawala that does take away and delivery. We tried a bunch of her stuff and pretty much all of it was amazing. Which isn't something we say often.",
  "reviews": "Foodie Adventure is a home cook in Nawala that does take away and delivery. We tried a bunch of her stuff and pretty much all of it was amazing. Which isn't something we say often.\nFoodie Adventure is a somewhat new, Nawala based home cook that offers quite a varied list of dishes for delivery and take away. Home cooks generally tend to offer smaller menus revolving around a single specialization. That wasn't case here with the Foodie Adventure menu having grilled meats, rice, quinoa dishes and even a good selection of salads and healthy drinks. The prices are also quite reasonable with everything priced between Rs. 350 - Rs. 1500.\nOne thing that really impressed us straight off the bat was how well all of it was packaged. Even though she's a home cook, she runs a very professional operation.\nThe baked tortillas were a great way to start things off. It comes with a tomato salsa and an avocado dip which is quite heavy on the garlic. These were like thick nachos with a sprinkling of  salt and chili flakes. They taste pretty great on their own but the dips make it even better. Particularly the avocado dip, which is creamy with the flavour of the garlic really coming through.\nQuinoa is a rarity in Colombo, so we were quite surprised to see a \nhome cook offering it. The quinoa burger (Rs. 380) was a first even for \nus, but it turned out be quite tasty. The burger is constructed with \nbread buns, tomato, cucumber, lettuce and a quinoa patty with a slice of\n cheese draped over it. The grilled patty was seasoned and packed \nperfectly with the tomato adding a very subtle sweetness. I'm not too \nbig on vege burgers but I'd gladly have this one.\nThe prawn and avocado salad (Rs. 580) was fresh and light with a good balance of flavours. There isn't much of a twist to this one but we're fine with that since the fresh greens and vegetables make for an excellent garden salad which is very filling. The avocado also adds a nice creaminess and light sweetness which complement the prawns well.\nAs a rice option we tried out the Mongolian fried rice (Rs. 960). It's prepared in the classic Mongolian style, which ironically happens to be something Sri Lankans came up with. This was undoubtedly one of the best renditions of Mongolian fried rice we've had with light long grain basmati, chicken, prawns and good amount of chillies and spice. The great thing though is the fact that despite having a good amount of heat, it doesn't overpower the other flavours.\nNext up we tried the grilled pork chops with mashed potatoes (Rs. 1100). First off the grilled pork chops were cooked and seasoned very well and we had no complaints. However, the hero of this dish was the mash which was creamy and buttery with the caramelized onions adding some texture as well as sweetness.\nFoodie Adventure can be contacted on\nto place your orders. Ordering one day in advance is all that's required. She delivers orders of 5 or more items with no delivery charge. For smaller orders, the pick up address is No. 41, Malwatta Rd, Nawala.\nWe really couldn't find fault in any of the dishes we tried from Foodie Adventure. This is one home cook we'd definitely recommend.\n",
  "yamu_rating": "We love this!",
  "url": "https://www.yamu.lk/place/foodie-adventure/review-43449",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_6igeux-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_aSMPJi-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_lb2laY-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_igpCyF-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_kaQq8r-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_eqslpg-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_JnulgS-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_6igeux-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_kaQq8r-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_eqslpg-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_lb2laY-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_igpCyF-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_aSMPJi-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_jbPlMM-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/02/yimg_tsQgvc-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_6igeux-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_aSMPJi-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_lb2laY-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_igpCyF-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}