{
  "name": "Frosties",
  "address": "No 67, Athidiya Road, Ratmalana.",
  "open_until": " Open until 10:00 PM",
  "telephone": "0779556660",
  "description": "A wide range of premium flavored rolled ice cream. Best way to beat the heat.",
  "reviews": "Frosties has been around even before the rolled ice cream was a thing. Located right opposite TV Lanka on Ratmalana Road, it's a bit out of the way which is why it may not have had the same hype as other rolled ice cream places, which is a huge oversight.\nTheir menu is pretty extensive for an ice cream place. Their flavors include Cookie Monster, Milo Tella (which is Milo and Nutella of course), Kit Katty, I Love You a Latte (basically coffee ice cream) and Choco Luv, to name a few. They also had a new arrival section under rolled ice cream which we had to try. There is also a separate section of homemade ice cream which includes Oreo and Mint Chocolate.\nIf that is not enough, they also serve mains like pasta, fish and chips, rice, burgers and even soups.\nWe started off with one of their new arrivals, the Kinder Bueno Frostie (Rs. 480). As the name suggests, it is Bueno goodness infused ice cream with chocolate chips and homemade whipped cream. Every bite just makes you go back for more. The texture was creamy and soft with the milky flavor of the Bueno popping out. The portion is enough for two people or just one really brave person. It is well worth the money. This was my personal favorite but Vishvi liked the next one.\nThe Malt Crunch (Rs. 550) was also a new arrival with a strong malt flavor concocted with chocolate. We didn't really get the crunchiness that the name suggests but the malt flavor was unmistakable and when you eat it with the chocolate chips and the whipped cream you really can't complain. Tastewise it was succulent with a creamy and smooth texture that melts in your mouth.\nNext up we tried the Salted Caramel (Rs. 400) off their normal menu. This was our least favorite of the three. We would have preferred to have a stronger salty flavor because it was almost non-existent. The caramel too wasn't mixed in well with the ice cream. It tasted good as far as ice creams go, but we wanted salted caramel, in which they fell short to deliver.\nThey also serve Taco Frosties which unfortunately was not available that day.\nYes, they have drinks and judging by the abundance of food on their menu, their drinks too did not disappoint. They have a range of beverages varying from coffee, tea, smoothies, milkshakes and fresh juices.\nWe tried the Chococino (Rs. 450) which was not a chocolate infused cappuccino. The name might be a little misleading because this is really a hot chocolate with a strong cocoa flavor and a creamy layer of whipped cream that leaves a crease on your lip. It didn't really wow us in any way. While the cocoa flavor is quite strong, the texture was not as thick as you want a hot chocolate to be.\nTheir service is efficient and friendly. Our orders arrived within 10-15 minutes and none of it was melted or seemed like it had been kept waiting. The owner and the waiter were both very friendly and had a thorough understanding of the menu and what was available and what was not.\nWhile the ambiance is not the most appealing, it is not offputting. There's enough seating to accommodate about 10 people indoors at a time and they have outdoor seatings as well. The artsy frames they have put up are of everything that is from their menu, which is really nice.\nThere is not a lot of space for parking per say, but you can park on the side of the road and grab a quick bite.\nWe highly recommend you try this place. Despite the small imperfections in terms of some of the flavors, their ice creams are the perfect texture and sweetness. There are more than enough flavors so you will not be restricted to the classics like Oreo and KitKat.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/frosties/review-210432",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_Yw2sFE-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_seN0gf-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_vd3S3e-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_mkolsr-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_30h5WN-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_61Mp6x-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_JJY7I7-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_Qt6aL2-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2017/05/8ASFnC1F2g6DeTqofz.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_Yw2sFE-1024x576.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_JJY7I7-1024x576.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_Qt6aL2-1024x615.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_seN0gf-1024x768.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_30h5WN-1024x768.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_mkolsr-1024x446.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://www.yamu.lk/uploads/files/2014/12/yimg_EKsFa0-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oKIYgP-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_Yw2sFE-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_seN0gf-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_vd3S3e-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_mkolsr-640x279.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}