{
  "name": "Galle Fort Hotel",
  "address": "28, \nChurch Street,\nGalle",
  "open_until": null,
  "telephone": "0912232870",
  "description": "One of the Fort's quintessential spots for accommodation and breakfast.",
  "reviews": "A restored 17th century Dutch mansion, the Galle Fort Hotel is the perfect exemplar of the Fort itself. An old, beautifully restored building in the heart of the Dutch Fort, it lends itself to the sleepy charm of the area. We stopped by for breakfast during the Galle Literary Festival 2016 for part of the experience.\nThe GFH breakfast selection is simple and easy to navigate, pretty much what you need when you're half asleep and decisions are a challenge. It's a flat Rs. 1,500 for the entire thing, which we found reasonable if you're on holiday or hungover and need a large, multi-course breakfast session. You can choose from a variety of fresh fruit juices like papaya and watermelon (not\n, unfortunately), along with a mini platter of fresh fruit or corn flakes or curd and treacle.\nYou can also pick your culinary loyalties, choosing to have your eggs done in a spicy Sri Lankan omelette or as you like them paired with the usual Continental breakfast toast, sausages, bacon and tomatoes. Alternatively, you can skip the eggs altogether and opt for a proper Lankan\nwith\nand chicken curry or string hoppers with a selection of curries. We opted for the latter, since we'd already tried the continental eggs and sausages combo before and liked it (i.e: straightforward cheese omelette, made well to our specifications).\nThe string hoppers were ready surprisingly quickly given how much was going on. The tiered plate featured both normal string hoppers and red rice string hoppers, pol sambol, chicken curry, dhal, and bacon. Sure, bacon was an unconventional choice to accompany string hoppers but the menu said \"available on request\", so I requested. It paired unsurprisingly well!\nThe portions were quite large (I left almost half the string hoppers sadly), and wholesome. The flavours came through well, with authentic spicing and spiciness. Given the lovely plating, ambience, and the food itself, I found the whole thing pretty worth it. My meal was followed by a choice of plunger coffee, espresso, cappuccino, latte, or tea. I went with a cappuccino, which was alright albeit a tad strong for me, and lacked the abundance of lovely light foam that I generally anticipate.\nThe ambience is exceptional, as you'd imagine. The Fort's classic charm is rampant throughout the hotel, the colonial structure complemented by Channa Daswatte's contemporary refurbishment. Clean, whitewashed walls, stone steps, and lovely flowering araliya trees really set the scene for a proper hour-long breakfast. Despite the al fresco seating, it wasn't hot at all in the 9 AM dappled sunlight. The landscaping is also great, so you get a great view of the pool too (which I kind of wish was tiled differently, but that's a gripe for when we do the accommodation review).\nThere are only two complaints I could possibly make about the ambience, namely that the table linen really ought to have been washed and changed, and that the lovely lotus stems in the courtyard were attracting swarms of flies and gadflies near the tables. It's a pity really, because the lotus stems really added something quaint and typically Lankan to the vibe.\nThe service was very friendly and the waitstaff was vibrant, knowledgable and considerate. They did keep disappearing though (either behind the partitions or into the kitchen), so getting their attention for orders or requests took a solid 5-10 minutes each time. But if you're not in a rush and appreciate the archaic charm of slow eating, it shouldn't bother you too much. It didn't bother me, especially since the staff's friendly enthusiasm was contagious.\nThe GFH is one of the vital organs of the Fort anatomy. Great architecture, history, and re-imagined luxury. We enjoyed the breakfast selection, and were pleasantly surprised at how authentically (i.e: well spiced) the local options were prepared despite the predominantly tourist clientele. Stay tuned for our accommodation review which should be out in the next couple of months!\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/galle-fort-hotel/review-75855",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_RJqQoq-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_alNdJ0-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_iqXoCt-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_Ynmn8D-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_SIVl6V-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_VNS2w1-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_jTvpWO-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2017/04/KE2F77hW9uoRt7RHja.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_iqXoCt-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_VNS2w1-640x456.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_Ynmn8D-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_SIVl6V-320x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_pm4NIv-600x250.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_mOENRl-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_RJqQoq-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_alNdJ0-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_iqXoCt-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_Ynmn8D-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}