{
  "name": "Galle Caterers",
  "address": "122, Kadawatha Road, Kalubowila, Dehiwala",
  "open_until": " Open 9.00 AM - 8.00 PM (11. 30 AM & 6.30 PM onwards for food collection)",
  "telephone": "0112728480",
  "description": "Galle Caterers are one of the older caterers in Colombo with quite a large customer-base. We've tried their stuff on numerous occasions and they offer great value for money on top of consistent taste.",
  "reviews": "Galle Caterers are one of the oldest caterers in Colombo with quite a large customer-base. We've tried their stuff on numerous occasions and been happy more often than not. They offer great value for money and consistently tasty foods.\nGalle Caterers can be considered one of the pioneers of the biriyani sawan movement in Colombo, offering large portions at very reasonable rates. Now they've improved their menu to offer a whole different bunch of biriyanis both rice and string hopper (chicken, beef, mutton and prawn), as well as fried rice and kidus for lunch.\nWhat has made Galle Caterers so popular is the prices, still some of the most affordable around at Rs. 2850 for chicken biriyani sawan, going up to Rs. 3800 for prawn biriyani. Note that these are portions that can easily feed a group of 10. Each of the sawans come with a full roast chicken, green pea and cashew curry, achcharu, maldive fish sambol, a bit of pineapple and a bowl of wattalapam for dessert.\nAnother thing we like is the fact that their roast chicken is quite sizeable and comes with a thick and spicy sauce. The chicken can be considered a bit overcooked but its still fine in terms of flavour.\nThe biriyani itself comes with a good amount of chicken and cashews along with the usual keeri samba. I'd say the rice portion is enough for more than ten people but there wouldn't be enough chicken (that's good for 6-8). In our case we had a good amount left over which was still good two days later out of the fridge.\nThe sides are also well thought through and cooked in a way that complements the rice. The green pea and cashew curry adding a bit of richness and texture and the achcharu, prepared almost like a chutney, adds a bit of sweetness.\nFinally, the wattalapam  - often the most neglected part of a a sawaan - is very good. It's very sweet, but all the flavours come through, with a good balance of richness. Unfortunately, it only serves maybe three to four people, so you may want to grab an extra one.\nGalle Caterers used to operate out of a pretty dubious looking old house on Kadawatha Road, but now they've moved to a newly renovated building next door which actually looks like a professional operation. You need to place your orders a bit early if you intend to pick it up on the same day. We've ordered from them on multiple occasions without running into any major hiccups.\nGalle Caterers built their name around tasty biriyani sawans which offer great value for money and they've stuck to that. It won't be the best biriyani you've ever tasted but if you're looking to feed a large crowd, it's a good one.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/galle-caterers/review-44992",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_xbFR7K-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_8T4Uuy-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_FRZUep-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_tCUaj9-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_VlyDUJ-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_10Wy6F-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_xbFR7K-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_8T4Uuy-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_tCUaj9-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_VlyDUJ-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_FRZUep-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_zizgop-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/05/yimg_DfDMo2-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_xbFR7K-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_8T4Uuy-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_FRZUep-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_tCUaj9-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}