{
  "name": "Ginza On The Edge (Waters Edge)",
  "address": "316, Ethul Kotte Road, Battaramulla",
  "open_until": " Open 11.00AM to 11.00PM",
  "telephone": "112863863",
  "description": "Ginza On The Edge is the suburban successor to the Hilton’s  Ginza Hohsen. It's on the 1st floor of Waters Edge and offers high-end Japanese with excellent service to boot.",
  "reviews": "Ginza On The Edge is one of the more senior Japanese restaurants on the block. Namesake of the former Ginza Hohsen, Ginza On The Edge offers a very complete Japanese dining experience. Their prices definitely fall on the higher end, but it’s possible to manage under 2k if you order the right stuff.\nThe spiritual successor to Hilton’s Ginza Hohsen, Ginza On The Edge offers a mostly traditional Japanese menu with pretty much all the quintessential dishes. Their probably best known for their teppan dishes, which we focussed on during our last visit, but this time around we tried out their sushi variations. While their stuff is pricey (Rs. 2,500 per head, in our case), we came away quite satisfied with both the food and the level of service.\nWe started off with the Nigiri Teishoku (Rs. 1780). Teishoku is a general term used for pre-set meals, but this one was presented more like a bento box. It comes with five types of nigiri (tuna, shrimp, squid, white fish and crab stick), assorted tempura, salad, pickled veges and miso soup. They’ve got a bunch of other bento and teishoku options as well, so these are probably the best way to keep the cost down.\nAll five of the nigiri were on point with fresh seafood, well cooked rice and just the right amount of wasabi. The knifemanship was also quite impressive, akin to what we’ve seen from the likes of\nand\n.\nThe assorted tempura consisted of two large shrimp, squid, carrot and egg plant. We liked the thickness and the crunch of the batter, though we felt it could have done with a bit more seasoning, but nothing a bit of soy couldn’t fix. All in all we think this is a good deal, however, we felt that salad could have probably been replaced with some maki or kaizen don to add more value.\nNext up we went for two half portions of the spicy tuna uramaki and ikura uramaki (Rs. 435 + Rs. 785). This was actually a brilliant suggestion from the waiter (Sujith, if I’m not mistaken). The spicy tuna is the perfect sushi for locals since it still has the freshness of traditional sushi with a huge spice kick and a bit of crunch from the crushed tempura coating. This is the flavoursome kind of spice so it doesn’t linger and burn.\nFollow that up with that the ikura urmaki and you’ve got a roller coaster of flavours going on inside your mouth. Ikura means roe, but this one was actually more of a salmon-avocado maki with roe on top. It was the perfect combo with the spicy tuna because of the contrast of the creaminess of the avocado and slightly fatty salmon.\nThe Pork Shogayaki (Rs. 590) had the right flavours going on with distinct sweetness and flavour of the ginger coming through. The problem, however, was that the pork itself was overcooked, possibly because it was was shredded quite thin.\nFor dessert we tried the azuki with shiratama (Rs. 450), which is more or less mochi on a bed of red bean paste. Mochi is a Japanese rice cake made of short grain glutinous rice which has a wonderfully soft and smooth texture with a light sweetness. The red bean paste is where most of the sweetness comes from with the flavour of the red bean lingering on the palate. Mochi is actually quite rare in Colombo so we’re glad Ginza’s got it.\ndoes a variation of it known as Daifuku mochi where there red bean paste is stuffed into the mochi.\nGinza sticks to a relatively simple and traditional look with an all wooden set up and large windows all around so there’s plenty of natural light. They’ve got a few tatami tables set up on the side for folks who want to have a more private meal, and seating outside on the terrace, if you feel like having your meal overlooking the green.\nService on our visit was exceptional. We dropped in for lunch when only two other tables were occupied, so it all felt very personal. The waiters were friendly and attentive, but not overtly so. Their suggestions were great, and when they weren’t sure of certain details, they didn’t hesitate to call in the manager for assistance.\nGinza isn’t your everyday Japanese eatery, but if you’re looking for a more high end experience, it’s right up there with some of the best Colombo has to offer. With a renowned teppan selection and equally impressive sushi, they’ve got all their bases covered.\nGinza On The Edge is the suburban successor to the Hilton’s  Ginza Hohsen. It's on the 1st floor of Waters Edge and offers high-end Japanese with excellent service to boot.\nGinza On The Edge is the suburban successor to the Hilton’s famous Ginza Hohsen. It's on the 1st floor of Waters Edge and offers high-end Japanese.\nGinza On The Edge is the suburban successor to the Hilton’s famous Ginza Hohsen. The new Ginza is on the 2nd floor of the stylish new Water’s Edge (hence the “On The Edge”), and offers high-end Japanese.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/ginza-on-the-edge/review-101097",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_Z9mUmz-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_Z9mUmz-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_UZvzvR-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_hQmGcS-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_9BN4wy-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_xtggbz-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_JoxsC6-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_Cdnmna-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_QfIvJN-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_BYp3Qu-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_XIehnZ-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_g0bnFM-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_PtaxMS-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_sHaFCd-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_gaVrZ9-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_VYeTEJ-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_tvgeWt-150x100.JPG",
    "https://www.yamu.lk/wp-content/uploads/2014/05/Dynamite-Maki-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/05/Ginza-On-The-Edge-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/05/Ginza-Sign-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/05/Teppanyaki-150x105.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_8Xfb06-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_r1mDmw-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_FcwPGX-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_dyTiR3-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_Z9mUmz-640x448.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_r1mDmw-640x186.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_UZvzvR-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_JoxsC6-640x494.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_8Xfb06-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_9BN4wy-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_hQmGcS-640x406.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_FcwPGX-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_sG0SqX-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/05/yimg_qKlg07-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_Z9mUmz-640x448.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_UZvzvR-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_hQmGcS-640x406.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_9BN4wy-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}