{
  "name": "Gloria Jean's Coffees",
  "address": "No. 31, Horton Place, Colombo 7\r\nColombo",
  "open_until": " Open until 08:00 PM",
  "telephone": "0114848486",
  "description": "(Reopened)\r\nGloria Jean's has made a comeback despite the scandals surrounding their local franchises. They're at Horton Place now where the old Barista used to be, a few steps across the road from Coffee Bean right next to the W Lounge.",
  "reviews": "So Gloria Jean's has made a comeback despite the scandals surrounding their local franchises. They're at Horton Place now where the old Barista used to be. We popped in to check the place out, and found that they're getting along just fine. They serve basic coffeeshop treats like muffins, brownies and the like but they've also got a range of sandwiches, salads etc.\n\n\nFirst off, we started with the Macchiato (Rs. 420) and this was obviously a small shot of extremely strong coffee. Or so we thought. A macchiato is an espresso shot usually served with a small amount of foamed milk. The little cup the coffee was served in was about half foam and half burnt coffee. I wasn't exactly pleased to find myself taking in two or three sips of plain foam but when I did get to the coffee I wasn't really impressed. Rough start, but oh well.\n\n\n\nOur next refreshment was the Creme Brulee Chiller (Rs. 660) and while it WAS quite refreshing it didn't have the slightest hint of 'Creme Brulee' to it. It was just well-made, chilled coffee with a few drizzles of caramel syrup and although I found it delicious, Rs. 660 was a bit steep.\n\n\n\nThe champion cuppa was the Irish Nut Creme (Rs. 680) and let me tell you, this was a wonderful drink. It's not exactly the taste per se that makes it so enjoyable as it is the aroma. This drink delivers an entire olfactory experience and it made me think of Christmas and a hug from Grandma. It had a slight hazelnutty undertone to it and was flavoured well with Bailey's Liquer. Not the real stuff mind you, just flavour. The fact that it's served hot only adds to the sensation of wanting to read a book by the window during a light drizzle.\n\nWe had the Tandoori Chicken Sandwich (Rs. 690) and all the different elements that made this sandwich up worked well on their own but weren't exactly balanced out when put together. For one, the bread (Ciabatta) was tasty but it was far too thick compared to the teeny amount of Chicken Tandoori filling. I also wish they put in a few more veggies because all they had was one sad leaf of iceberg lettuce. That being said, the chicken itself was delicious, moist and adequately flavoured. As per the norm, the sandwich was served with a side of fresh vegetables and a dish of tomato ketchup. Would I willingly spend Rs. 690 on this? Probably not.\n\n\n\nFor our choice of dessert, we first ordered the Double Chocolate Cheesecake (Rs. 650) and this was one extremely dense slice. Being a cheesecake freak myself, I know that cheesecakes are meant to be light and fluffy, sort of easy to scoop up with a spoon shall we say. I had to repeatedly stab my fork through it  so I could get a proper bite out of it because that's how thick and dense it was. It tasted great, it was rich and chocolatey so if you're a chocoholic then this is right up your alley.\n\n\n\n\nWe also got the Lemon Meringue Pie (Rs. 550). I've had a lot of lemon meringue pies throughout my time here on Earth and frankly this was good. It was tart and it looked good to boot. The only drawback was that there wasn't enough sweetness to balance out the tartness and after a few mouthfuls you start to get a little overwhelmed. Despite this, I enjoyed it and I'd say the large slice is a pretty good deal at 550LKR.\nOkay so the area is beautiful and it's probably one of the better nooks in CMB for a coffeeshop, but for some reason the interior was a little disconsolate. Coffee shops are meant to make you feel warm and welcome and while I'm assuming they were going for that, they sort of overdid it a bit and the result was stark, contrasting colours and a strange yellow-wood for furniture.\nThe entire place was absolutely bathed in far-too-warm yellow lighting, and this didn't compliment the furniture, nor the large orange, abstract artwork on the walls. This shouldn't matter too much if you're in the presence of good company as there's enough seating for a large group of people.\nThe service was up to par, the baristas knew their stuff and our food/drinks didn't take long at all.\n\nOverall, there's definitely room for improvement and while the interior leaves much to be desired I'd recommend heading down to try their coffee. Also the cakes are big enough to share and that's always a good thing. Head down to GJC if you've got time and a few extra rupees to spare.\nGloria Jean's has made a comeback despite the scandals surrounding their local franchises. They're at Horton Place now where the old Barista used to be.\nGloria Jean's is an expensive and basic franchised coffee shop on Union Place. It has parking and hang out space so it's a good place for meeting up. In terms of the food and drink, it's standard over-priced coffee shop fare.\n\nහෝර්ටන් ප්ලේස් එක පැත්තෙ පැත්තෙ පරණ තැනක් අලුතෙන් ඇවිල්ල: ග්ලෝරියා ජීන්ස්\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/gloria-jeans-coffees/review-122618",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_FxlD2B-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_dlO90c-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_DLMI4M-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_ujgail-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_fTVWMM-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_uFR6sV-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_m0rqs4-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_B7G2yN-150x100.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/02/DSCF6818-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/02/DSCF6817-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/02/DSCF6820-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/02/DSCF6814-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/02/DSCF6816-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/02/DSCF6821-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/02/DSCF6824-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/02/DSCF6826-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/02/DSCF6827-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/02/DSCF6830-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/02/DSCF6831-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/02/DSCF6832-150x105.jpg",
    "https://www.yamu.lk/uploads/dp/2017/01/sFOlV64o5GU2djDVqy.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_m0rqs4-640x380.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_ujgail-640x471.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_B7G2yN-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_dlO90c-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_DLMI4M-640x403.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_fTVWMM-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_uFR6sV-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_i6A7Xb-600x250.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oKIYgP-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2016/02/IJIBS4jxZQsZJFls0R.jpg",
    "https://www.yamu.lk/uploads/dp/2017/01/sFOlV64o5GU2djDVqy.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_FxlD2B-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_dlO90c-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_DLMI4M-640x403.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_ujgail-640x471.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}