{
  "name": "Gorgeous Cakes",
  "address": "Nawala",
  "open_until": " Open 9.30 AM - 5.30 PM",
  "telephone": "0778877611",
  "description": "A home baker who specializes in something other than cupcakes and cookies.",
  "reviews": "Gorgeous Cakes and Desserts does a little more than your average cookies and cup cakes, dishing up lemon bars and marshmallow loaves to satisfy those sweet tooth cravings. If you want to stick to same-old-same-olds, you can also opt for regular goodies like cakes and brownies, and interesting twists on cookies.\nBeing a home-baker, this is either take-away or delivery, so you can contact the baker at\nor through their\nfor further details.\nWe placed an order for the Lemon Bars, a couple of Marshmallow Loaves, a tray of brownies, and Chocolate Coated Butter Cookies. All of these were really well made. The flavours packed a punch, were strong, and are even (dare I say) overpowering. Personally, I think the Marshmallow Loaf (Rs. 650) is the\nthing for a kid's birthday party.\nThe amount of chunky chocolate in it, mixed with marshmallows and peanuts (you can get it without peanuts if you're allergic, they'll just throw in extra chocolate instead), are sure to give all the children insane sugar rushes and then tire them out in the end (sorry not sorry). It comes sliced into pieces of ten, so you don't mess things up by trying to cut through that generous loaf. It's pretty good value for money, with chocolates and peanuts being an obviously good combo.\nThe lemon bars comes in batches of 24, and costs 1,500 bucks. This is a bit expensive, but bars are quite large and extremely filling. It's intensely tangy, to the point of the citrusy flavour being a tad overpowering, but if you like that acidic kick combined with sweetness, this is definitely for you.\nAt Rs. 70 each and a minimum order of a dozen, the butter cookies coated in chocolate are quite satisfactory, with the chocolate not overpowering the biscuit, and the buttery, crispy element coming out together quite beautifully. It's also wrapped in two packages of six, so it's nice to take as a gift to someone as well.\nYou can settle the whole thing by placing your order over FB, tell them where you'd like it delivered, and then wait until it reaches you. Or, you can call. Vyomi, the lady behind the venture, doesn't work over the weekends so you can't have anything baked and ready by Monday morning.\nThe foodstuff is sent through a metred tuktuk, so it could be expensive depending on where you are. The pick-up point is in Kotte.\nA bit too chocolatey/ sweet for my liking where the marshmallow loaves were concerned, it's still a great snack for people who love indulging their sweet tooth. Everyone had mixed reactions for what we'd ordered, with some Yamuites prefering the 'mallow loaves over the lemon bars and vice versa, but we all agreed that it was baked well, and well worth the price.\nGive it a try!\nA Kotte-based homebaker with some innovative treats\n\nහැබැයි මතක තියාගන්න යාළුවනේ ඔයාලා මොන අතුරු පස ගෙන්න ගත්තත් Marshmallow Loaf එකක් නම් ගෙන්න ගන්න අමතක කරන්න එපා. මොකද ඒක තමයි රසම එක.\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/gorgeous-cakes/review-83522",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_f9ufo8-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_ddbPbv-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_OClbeF-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_e8V2fB-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_6c7QIk-150x100.JPG",
    "https://www.yamu.lk/uploads/dp/2015/08/bf9TdKPSlnqFHMaZrC.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_OClbeF-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_ddbPbv-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_f9ufo8-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/12/yimg_GdoPPK-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_nZA1P1-600x250.JPG",
    "https://www.yamu.lk/uploads/dp/2015/06/VBxu8OQlwaXM6zpakX.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_f9ufo8-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_ddbPbv-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_OClbeF-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_e8V2fB-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}