{
  "name": "Governor's Restaurant (Mount Lavinia Hotel)",
  "address": "No. 100, Hotel Road, Mount Lavinia",
  "open_until": null,
  "telephone": "0112711711",
  "description": "The Governor's Restaurant at the Mount Lavinia Hotel is one of the few hotel restaurants that offers real value for money with their dishes. ",
  "reviews": "The Governor's Restaurant at the Mount Lavinia Hotel is one of the few hotel restaurants that offer real value for money. They revamped their menu a few months back and we came away feeling pretty good about our meal, especially that chocolate dome at the end. The service though, was a bit dissapointing this time around.\nWe got here by PickMe, which was conveniently right outside our office in Bamba, so it took us less than 20 minutes to get there during lunch time.\nMount has consistently impressed us with the likes of\n,\nand their\nwhich offers one of the best deals in town (especially if you like desserts). Their main restaurant, however, is the Governor, which has basically been rebooted from scratch.\nThe new menu offers Italian, Chinese, Indian, and European dishes as well as classic Sri Lankan by chef Publis. What we like is that they've kept it concise with around three to four items per cuisine. Prices are on the higher end depending on what you go for, so expect to pay around Rs. 2000 per head.\nWe started off by sharing a Thai chicken cobb salad (Rs. 500) which had a lot going on. This was a mix of different salad leaves, coriander, a bit of mint, tomato, cucumber and rossted cashews, served wih a respectable portion of roast chicken and a ginger-soy dressing. On the positive end, the chicken was cooked well with a good amount of seasoning and spice, the ginger-soy dressing was on point with a great balance of sweetness and acidity, and the elements like the roasted cashews and bean sprouts added that needed textural contrast . We did, however, feel like a few of the greens could have been more fresh, and also that the salad leaves to veggie proportion could have been more balanced.\nGoing through the menu, my eyes went straight to the roasted up country pork neck (Rs. 1800). This was one hearty portion that came with three sizeable cuts of pork neck stuffed with dried nuts and fruits, crackling, fries, roasted vegetables and a few batter fried rosemary sprigs. While Rs. 1800 is a pricey, you're getting a whole lot here, and I found myself stuffed from just the pork. I didn't really care much for the fries or the roast veggies which were a tad too greasy. However, the most important element - the pork neck - was cooked near perfect with a light and well rendered layer of fat, moist meat and a lightly sweet center with those dried nuts and fruits which had an almost\ncrème anglaise. However, what we actually got was chocolate mousse at the center of the dome, served with a strawberry and a mix berry coulis.\nName aside, this actually tasted brilliant. There was a great contrast both in terms of textures and flavour with the solid chocolate dome, smooth mousse center and the needed freshness from that tart berry coulis with the flavour of raspberry and blueberry really coming through. Mount Lavinia Hotel has always delivered in terms of desserts and this one was no different, we just wished they would have given us a more accurate description.\nMLH is as close to the ocean as a hotel gets, at least here in Colombo. So needless to say, the view from the terrace is fantastic and makes for one of the best dining locations around. The restaurant itself looked great to begin with, with its high ceilings and white washed walls, but we're looking forward to seeing what they do with the place.\nThe service at the hotel restaurants have been more than satisfactory on our previous visits, but this time around we noted some clear areas for improvement. The biggest issue was that the two young waiters who took our orders were almost clueless about the menus. We appreciated the fact that they were friendly and attentive, but they were quite confused when we named the dishes without pointing to them on the menu.\nWhile we did run into a hiccup with the service, the Governor's Restaurant made up for it with some flavoursome food. Our most impressive find, however, was that chocolate dome.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/governors-restaurant-mount-lavinia-hotel/review-64813",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_FQCT7a-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_FQCT7a-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_FQCT7a-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_ijJRHE-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_3GnvFK-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_djJItf-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_Jj4xsr-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_kO1Bmh-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_XYVXOL-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_QJeyoK-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_ODN6NK-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2017/05/yimg_IAPZv6-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_ODN6NK-360x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_ijJRHE-640x437.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_3GnvFK-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_Jj4xsr-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_kO1Bmh-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_FQCT7a-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_QJeyoK-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_djJItf-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_mOENRl-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oKIYgP-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_FQCT7a-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_ijJRHE-640x437.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_3GnvFK-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_djJItf-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}