{
  "name": "Grandpila Family Restaurant ",
  "address": "25, Marine Drive, Colombo 3",
  "open_until": " Open 10.00AM to 1.00AM ",
  "telephone": "0112055512",
  "description": "Pilawoos, the biggest players on Colombo's kottu scene, have set up a bigger, more family friendly restaurant on Marine Drive. The kottu and iced milo are still stellar. ",
  "reviews": "Pilawoos, Colombo's biggest kottu franchise, now has a bigger more family-friendly restaurant on Marine Drive: Grandpila. This is big news for Pilawoos' huge fanbase, who've for ages enjoyed their kottu, biriyani and iced milo across the city.\n'Pilawoos' is somewhat a diluted name now since like\n, you get a lot of posers with the same name, but the original from 1978, has branches in Bamba, Wellawatte, Ratmalana, Battaramulla and now Grandpila in Kollupitiya.\nObviously, we got the chicken cheese kottu. For Rs. 460, this is a superb dinner for two, and personally I think Pilawoos makes some of the best cheese kottu in town. It's a chunky, challenging meal - fat pieces of rotti indistinguishable (thanks to the epic slather of cheese) from a generous mix of vegetables and crunchy bits of roast chicken.\nWe also got the chicken biriyani, which for Rs. 320 comes in a smaller portion than the kottus do, good enough for one. You get a giant freshly roasted chicken, but the dish falls flat and doesn't have much flavour going on - until you mix in the chili paste. This is some quality, spicy-sweet chili paste, and unfortunately the biriyani isn't much without it.\nYou get a solid iced Milo here, unsurprisingly. Grandpila is one of the best places for drinks, all for a little less than Rs. 200. We got a tall, cool, nostalgia inducing glass of Milo and a very thick, delicious one of mango lassi.\nPilawoos' kades have typically been the place guys park their cars at late at night after clubbing and ask for a big plate of greasy kottu through their car windows. So Grandpila is a definite upgrade (we were told Pilawoos is also expanding into the Maldives now). It combines their delicious, cheap plates of Sri Lankan comfort food with a more family and women friendly environment. The place looks quite big from the outside, and inside is very clean and bright, featuring big signboards of stock images of food. The TV on our left played Bollywood item songs, while the one on the right was tuned into Animal Planet, so, entertainment? Check. Service was quick during our visit.\nGrandpila is definitely a warmly welcome addition to Colombo's food scene. It's from a franchise trusted for quality noms, it's inexpensive, and you can now enjoy it in a more comfortable space than your average Pilawoos kade.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/grandpila-family-restaurant/review-47513",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_sQ37JX-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_esu3Gl-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_JZeDIN-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_r1iios-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_LA9X8P-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_a75EpY-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_ReeHWv-150x100.JPG",
    "https://www.yamu.lk/uploads/dp/2015/06/Be7FWdmIZXRAmC8tEt.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_sQ37JX-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_esu3Gl-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_JZeDIN-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_ReeHWv-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_GmVOlX-600x250.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_rrZzWU-600x250.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_sQ37JX-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_esu3Gl-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_JZeDIN-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_r1iios-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}