{
  "name": "Grand Thai (Grand Hotel, NE)",
  "address": "Grand Hotel Rd, Nuwara Eliya",
  "open_until": " Open 12.00 PM - 3.30 PM & 6.30 PM - 10.30 PM",
  "telephone": "0522222881",
  "description": "Grand Thai is a relatively new Thai restaurant which resides at the former basement of The Grand Hotel. Taking the experience as a whole, we were very impressed. Good food, beautiful interior and some impeccable service.",
  "reviews": "Grand Thai is a new Thai restaurant in the basement of The Grand Hotel (Nuwara Eliya). Taking the experience as a whole, we were very impressed. Good food, beautiful interior and some impeccable service.\nAs far as restaurants go, Nuwara Eliya doesn't change much. Oldies like the Grand Indian and King Prawn still holding strong. We actually came just walked by Grand Thai and were struck by how it looked. This is probably one of the best looking restaurants in N'Eliya, which is ironic since it used to be the just basement of The Grand Hotel not so long ago. All of it was very well thought through with soft lighting, blue-white ceramic vases, purple orchids and some tasteful art complemented by acoustic Thai music.\nThe service we experienced was also nothing short of outstanding. All the waiters were well trained and coordinated, with a good knowledge of the different dishes. The entire staff was relatively young, talkative and seemed genuinely enthusiastic, so you really don't have any second thoughts when giving them a sizeable tip.\nWhen it comes to food, Grand Thai offers mostly classic Thai dishes and preparations, some with a bit of a modern touch. One thing we very much appreciated was the fact that all the prices on the menu were inclusive of taxes and service charge, so you know exactly how much you're paying. As if we didn't have enough reasons to love them already, the prices are very reasonable with the total damage for five coming to just Rs. 4800. The portions are tentatively meant for two but we found it was easily enough for three.\nFor starters we had the green papaya salad (Rs. 350) which was quite different from the salads we've tried elsewhere. As expected with Thai cuisine, the flavour of peanuts and peanut oil is abundantly apparent. The papaya itself was shaved into thin strips, served with a tangy sauce which had hints of soy sauce and fish sauce, topped off with a large pan fried prawn. The flavours here well balanced and with fresh papaya and peanuts adding texture.\nThe pad thai koong (Rs. 700) is one of the most popular Thai dishes, but Grand Thai does a bit differently, opting for a thick flat noodle. While that does change the texture, the flavours were more in line with the classic preparation. It's served with an omelette in the form of an egg net, prawns, peanuts and bean sprouts. While it lacks a bit of spice, the seasoning was on point so you won't be disappointed.\nThe stir fried pork belly in garlic sauce (Rs. 600) was also quite nice overall and will probably make pork lovers happy. The pork belly itself was cut into small cubes and cooked slightly crispy with the fat rendered well. Most of the flavour comes from the garlic sauce here, which had a good balance of sweetness and spice with flavour of the garlic enhancng it further.\nThe kai takrai (Rs. 600) is another well known Thai dish which is a lemon grass grilled chicken. The preparation itself is quite similar to the Sri Lankanized Chinese dishes, so this is something that'll appeal to most locals. The lemon grass flavour and aroma is also very prominent and complements chicken and the gravy quite nicely.\nThe best of dishes though was the beef massaman curry (Rs. 800) which was creamy and flavourful with plenty of added herbs and spices. In terms of heat, this was very mild with an emphasis on the coconut milk. The beef was also very tender, binding beautifully to the curry to really complete a great dish.\nTo wrap up, we tried the banana and pineapple fritters (Rs. 400) for dessert. Banana fritters are nothing new but the pineapple fritters were the real winner here. The batter is literally golden and glazed in syrup, we dove right in. The best part is that it isn't overly sweet, so the taste of the fruits still come through well.\nGrand Thai is easily one of the best restaurants in Nuwara Eliya. They give you everything you look for in a great restaurant- good food at affordable prices, excellent service and a setting to match.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/grand-thai-grand-hotel-ne/review-47630",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_VT5Nuh-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_vk1LeE-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_1DUQ2Z-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_JoGlHr-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_jmfIyi-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_65sd66-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_vYanmf-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_SdkilW-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_haLtJI-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_embWTu-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_haLtJI-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_VT5Nuh-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_vk1LeE-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_1DUQ2Z-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_SdkilW-640x444.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_vYanmf-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_JoGlHr-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_65sd66-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oKIYgP-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_mOENRl-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_VT5Nuh-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_vk1LeE-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_1DUQ2Z-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_JoGlHr-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}