{
  "name": "Harpo's Pizza ",
  "address": "79 Gregory's Road, Colombo 7",
  "open_until": " Open 11 to 10 PM from Sun-Thursday, open till 12 PM on Friday and Saturday",
  "telephone": "0114869000",
  "description": "Harpo's is known for their premium pizzas. The delivery though was an arduous process and took way longer than we expected. ",
  "reviews": "Harpo's Pizza generally serves up some of the best pies in the city, with fresh toppings and a wide range.\nThey've recently launched their Online Delivery site, so we thought we'd check that out during a special lunch sesh with the editorial team, but our experience wasn't as breezy as we thought it'd be.\nThe fancy new website portal is\n. You're required to sign in/sign up before you can place your order, and you'll get a confirmation number to your mobile phone.\nThe interface is quite alright, with rather bright colours and a categorised menu for easy access. It's easy , all you do is select your pizza, the size, and then it'll be added to your cart. Same goes for any other item you'd like to order (pizzas, sides, desserts etc).\nOnce you're done ordering, you go to your cart and then enter in your details, where you'd like to get it delivered etc.\nOnce you've made your decision, you confirm your order and then you're directed to the payment options and choose between card and cash.\nNote: They have some excellent deals on their websites, so make sure you check them out.\nWe took the Lunch Deal they had on offer, which means you order a 12\" pizza of your choice and get a regular 9\" pizza (there are only a couple of choices, of course) for free.\n\nThe two pizzas you can choose as your free pizza, are the Margherita and a Pizza Pollo.\n\nFor our main, we got the Pizza Pancetta and Parmigiana (Pork) which comes with crispy bacon mozarella and parmesan on a tomato base for Rs. 1700. The pizza was delicious with the mozarella and parmesan coming through perfectly. None of the ingredients overpowered each other and the tomato base was light and tangy.\nThe Pizza Pollo (Chicken) was so good I would've paid more just to have a 12\" to myself. It comes with bits of spicy chicken, roast capsicum, sauteed onions along with mozarella cheese on a tomato base. The chicken wasn't that spicy but I didn't mind. The onions were nice and crunchy and surprisingly enough didn't overthrow the pizza.\nFor dessert, we got the Apple Crumble Pizza (Rs. 600). Normally the idea of a dessert pizza sounds off to me, but I didn't dislike this. The apple was nice and sweet and the whole pizza had a slight cinnamon tinge to it. It also came with a light spread of nutella at the base, which we loved. Texturally this is a treat, with squashy nutella, crispy crumble, and lightly toasted pizza base.\nWe were seriously craving good pizza and drink on a gloomy afternoon, but of course life is never as simple as that.\nOnce we ordered, we were sent a confirmation message through the site telling us that our pizzas would be delivered shortly.\nAbout an hour later with no sign of the pizzas, we called them up and after a lengthy conversation they tell us that the orders haven't gone through due to an error in their internet connection. They told us that it'd take another 45 minutes for them to deliver and we were having second thoughts about whether it was worth waiting 2+ hours for a pizza. We caved since we were so hungry and it was 3 PM at this point and most lunch spots were closed, plus they told us the pizzas were on the house due to the inconvenience.\nWe appreciated the apologetic service, but still, nobody needs to wait 2+ hours for a pizza so that's a minus point from me.\nThe pizzas (when they finally arrived) were hot, and delicious. We were told the site glitch wouldn't happen again, but if you want to make sure your slice is on the way, maybe stick to the classic telephone order instead.\nHarpo's serves up some good pizza but they had a huge site glitch when we ordered through their new online-order option.\nHarpo's Pizza does some pretty great pizzas using high quality ingredients. They're not cheap, but the pizzas are authentic and  you get more bang for your buck than most other places.\nHarpo's Pizza is still a classic (though only five years old). They combine strange and interesting ingredients with a highly professional kitchen and delivery outfit. If you're having a party or working late or just don't want to cook, Harpo's Pizza still can't be beat.\n\nහාපෝස් පීසා තවමත් සම්භාව්‍යයි. (අවුරුදු පහක් වුණාට පරණ) අතිශය වෘත්තික මට්ටමේ කුස්සියක ඔවුන් අමුතු හා රසවත් දේ මුසුකරනවා. ඒ වගේම කදිම ගෙදරට ගෙනත් දීමේ සේවාවක් ඔවුන් සතුයි. ඔබට සාදයක් තිබේනම්, රෑබෝවනතුරු වැඩනම් හා උයන්න කම්මැලිනම්, Harpo's Pizza තරම් තවත් තැනක් නැහැ.\n\nஒட்டுமொத்தமாக பார்க்கையில்; ஐந்து ஆண்டுகளே வயதான ஹார்போஸ் பிட்ஸா தரமான பிட்ஸாக்களைத்தருகின்றது. அதுமட்டுமல்லாது டெலிவரி கூட நல்லதொரு தரத்தில் இருக்கின்றது. கொழும்பு 1 முதல் 15 வரையான இடங்களுக்கு இலவசமாகவும் அயற்பிரதேசங்களுக்கு ரூபா 100 கட்டணத்திலும் ஹோம் டெலிவரி சேவை கிடைக்கிறது (அழைக்க - 4869000). உங்கள் வீட்டில் ஏதேனும் கொண்டாட்டமா, நேரஞ்சென்று வீட்டிற்கு வருகிறீர்களா அல்லது சமைக்க சோம்பலாக இருக்கின்றதா? ஹார்போஸ் பீட்ஸாவை முயற்சித்து பாருங்கள்.\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/harpos-pizza/review-141260",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/11/yimg_XGnFt6-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/11/yimg_uR7vTY-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/11/yimg_UQW4BF-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/11/yimg_vaGp7n-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/11/yimg_7FEGxh-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/11/yimg_Wt7KTe-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/11/yimg_5S1x6B-150x100.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/09/DSCF0675-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/09/DSCF0664-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/09/DSCF0658-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/09/DSCF0668-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/09/DSCF0698-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/09/DSCF0701-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/09/DSCF0705-150x105.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/11/yimg_c1Ifa0-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/11/yimg_QeSetB-150x100.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/11/yimg_iC3SgV-150x100.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/11/yimg_Gnzzgn-150x100.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/11/yimg_qcYySh-150x100.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/11/yimg_5RUJyy-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2017/01/sFOlV64o5GU2djDVqy.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/11/yimg_qcYySh-640x366.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/11/yimg_Gnzzgn-640x362.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/11/yimg_uR7vTY-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/11/yimg_UQW4BF-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/11/yimg_vaGp7n-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/11/yimg_XGnFt6-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_AsMI9w-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/05/yimg_DoelfO-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2016/08/XeyiyT47QP0lwSxe3a.jpg",
    "https://www.yamu.lk/uploads/dp/2016/08/XeyiyT47QP0lwSxe3a.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/11/yimg_XGnFt6-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/11/yimg_uR7vTY-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/11/yimg_UQW4BF-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/11/yimg_vaGp7n-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}