{
  "name": "Health Factor",
  "address": "42, Dutugemunu Street, Dehiwala-Mount Lavinia",
  "open_until": " Open 7.00AM to 9.00PM",
  "telephone": "0117269808",
  "description": "Health Factor is an awesome little restaurant in Kohuwala that cooks up very tasty but healthy meals - at great prices. ",
  "reviews": "Health Factor is a simple little restaurant on the ground floor of big High Octane Fitness gym in Kohuwala. They've got a lovely healthy menu: the stuff we tried tasted great, and we came off feeling good too - because A) it was healthy and B) it didn't cost much.\nThe premises are occupied by The Chariot and High Octane too but we were told on the phone that they each have their own management.\nThe restaurant is very casual and simple looking. In terms of decor they've got wooden floor boards, and a nice cushiony space on the side. The chairs are quite tiny though, which was fine in my case, but probably looks strange when the Johnny Bravo's from the gym upstairs come and sit on them.\nYou can see the chefs cooking up your order through a glass wall. The place seemed to have a small staff, and the waiters aren't all that forthright - felt a bit canteeney in terms of service - but the dishes arrive soon, so we don't really have complaints.\nWe started off with a 'healthy' drink - something I'm personally not famous for trying, and so, was clueless - the waiter suggested carrot juice, with ginger. Man, this is a strong drink, bitter, though I guess it grows on you after a while - not recommended if you're a noob to healthy eating.\nThe carrot juice was a bumpy start, but we were thankfully, pleasantly surprised by our meals. The menu is small, with a random selection of salads, sandwiches, and healthy versions of Sri Lankan and Western style dishes. The funny thing is there are two menus - a green and a red one - so if you want to eat unhealthy (refer nasi goreng, eclairs etc.), you can go with the red one.\nWe got some kurakkan rotti with lunumiris - for the ridiculous price of only Rs. 120 - and this is a great way to start your morning. I was afraid of the kurakkan (all you people who grew up dreading veggies will understand this), but it was overpowered by the pol (coconut) in the rotti. The lunumiris was total dynamite and we packed some for home.\nWe also got a dish of pan-fried seer fish, for Rs. 950, one of the pricier options on the menu. It was very filling and took a while to finish, and with the thin sauce and boiled vegetables felt like a very fresh and healthy lunch.\nThe 'Thai spicy roast chicken with veg salad' was by far my favourite, for Rs. 350. Seems like a very easy-to-make dish - basically boiled vermicelli, cucumbers, plenty of bell peppers, lovely soft strips of mildly roasted chicken, and a bit of chilli sauce. It was served cool, which made all the difference, and we couldn't get enough of it.\nWe then sauntered over to the unhealthy glass cabinet that we found right there, next to our seats, full of puddings and such, and got an eclair for funsies (Rs. 70). Could use more filling but actually not bad at all, compared to typical bakeries.\nHealth Factor is a good place to head to if you want a very simple, tasty and health conscious meal, without busting your wallet. The recipes are healthy but unassuming, and if the carrot juice is getting you down - no pressure, just order some pudding. Junk food will always have its appeal but it seems eating healthy is fast becoming a concern in Colombo - what with places like\n,\nand\ncoming up - so we're glad there's one more place to add to the list.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/health-factor/review-39100",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_SdmMWQ-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_Vmz0NL-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_LGY2zq-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_anku3Y-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_kewcvB-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_vsz2eQ-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_zeVLt4-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_RfNozp-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_6QbudB-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_8LkvOy-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_Pev4v4-150x100.JPG",
    "https://www.yamu.lk/uploads/dp/2015/06/Be7FWdmIZXRAmC8tEt.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_Vmz0NL-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_6QbudB-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_kewcvB-640x516.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_anku3Y-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_RfNozp-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_SdmMWQ-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_vsz2eQ-640x464.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_LGY2zq-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_mOENRl-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/05/yimg_vsJCcO-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/Be7FWdmIZXRAmC8tEt.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_SdmMWQ-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_Vmz0NL-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_LGY2zq-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_anku3Y-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}