{
  "name": "Hotel Rolex (Jaffna)",
  "address": "340, Hospital Road, Jaffna",
  "open_until": null,
  "telephone": "779079888",
  "description": "Hotel Rolex and its misleading name are an experience not to be missed whilst in Jaffna. Hot, juicy biriyanis and sugary juices. This is legit Northern saivar kade territory.",
  "reviews": "So the superbly famous Hotel Rolex is neither a\nnor does it have anything to do with high-end watches. It is, however, a lurid green\nthat serves up lurid yellow biriyani. What Rolex lacks in chromatic subtlety, it makes up for in character and reputation. If you don't trust me, trust the photo of a leering bearded chef at the entrance (photos of this man are around the city at various eateries. Clearly his A-okay gesture is the Jaffna seal of excellence).\n\n\n\nA pretty typical kade, the restaurant is grimy, exciting, and loud. It features age-spotted mirrors flanking the walls, and plenty of uncles that can beat you senseless in a stare-down. The key feature of the place is however, the head waiter. A delightful chap whose name I didn't catch (although he seems like a Raju) bossed and commanded both the staff and the patrons with a bustling aplomb that's clearly taken decades to cultivate.\n\nSeeing as we slunk in at about 4pm hoping for lunch, we were pretty grateful the leftovers were even available. Unfortunately the food wasn't piping hot as it probably would've been 4 hours previous, but it was still tasty. Their main offerings are little snacks, parothas and biriyanis (none of which seem like tradtional Jaffna fare to me, in all honesty). We ordered a chicken biriyani and a prawn biriyani, both of which were about Rs. 280 - cheap by Colombo standards, pretty pricey by Jaffna standards.\n\n\n\nDespite the fact that our biriyanis had been lying in state for hours, they were pretty good. Standard saffron-tinged rice, teamed with formerly frozen green peas, chick peas\n, and some\n. The chicken was a nice chunky and crispy breast piece, and the prawns had a lovely\nsort of caramelized flavour. They were slightly shrimpy pieces with the shell intact though, which made for some difficult eating. We also tried a bright yellow mango juice which was okay, but a tad saccharine.\n\nThe service was pretty exciting. The Raju-esque man told me what I should eat, how I should eat it, and demanded I order a drink with that too. I'd usually be horrified if a swish Colombo waiter tried that, but in good old Jaffna it seemed terribly authentic. He scolded, queried, and proudly brandished forks for us to use. The other waiters seemed in awe and fear of him, and scurried about doing his imperious bidding in silent saronged servitude.\n\n\n\nYou don't really go to a kade for the ambience, unless you're a Colombo hipster. Especially since you go from people-watching to being people-watched, and also the general flurry of insects and grime can be unsettling to some. But Rolex does retain a certain charm - whether it's the retina melting green or the dubious chef photo at the entrance or the pieces of paper instead of tissue, I don't know.\n\nHotel Rolex and its misleading name are an experience not to be missed whilst in Jaffna. Hot, juicy biriyanis and sugary juices. This is legit Northern streetside kade territory.\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/hotel-rolex-jaffna/review-24856",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/06/DSCF8733-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/06/DSCF8734-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/06/DSCF8735-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/06/DSCF8737-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/06/DSCF8739-150x105.jpg",
    "https://www.yamu.lk/uploads/dp/2017/04/KE2F77hW9uoRt7RHja.jpg",
    "http://www.yamu.lk/wp-content/uploads/2014/06/DSCF8733-600x400.jpg",
    "http://www.yamu.lk/wp-content/uploads/2014/06/DSCF8739-600x400.jpg",
    "http://www.yamu.lk/wp-content/uploads/2014/06/DSCF8734-600x400.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_DKK32n-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/04/yimg_yZtAnw-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2015/07/uzI50We9CRr1yYpFEF.jpg",
    "https://www.yamu.lk/uploads/dp/2015/07/uzI50We9CRr1yYpFEF.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/06/DSCF8733-600x400.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/06/DSCF8734-600x400.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/06/DSCF8735-600x400.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/06/DSCF8737-600x400.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}