{
  "name": "Hotel De Buhari",
  "address": "15, Panchikawatte Road, Colombo 10",
  "open_until": " Open until 10:00 PM",
  "telephone": "0112431015",
  "description": "Local biryani doesn’t seem to get the attention it deserves.  If you think about it though those plates of saffron tinged rice are a central part of life for millions of Sri Lankans.",
  "reviews": "Hotel de Buhari, or Buhari’s, is a generational biriyani spot. Though they may not be as good as your grandparents recall, they still serve platefuls of saffron-gold splendour.\nAmong Sri Lanka's ubiquitous hotels without accommodation, only a few stand out. Chief among them is Buhari’s. It’s far from the empire it once was, but is still one of the best streetside eateries you can visit. Word to the wise, however, this place is hard core. I’ve heard many people whine and complain about the service and cleanliness and, quite honestly, if you’re looking for those two qualities in Buhari’s you’ve come to the wrong neighborhood. They do have new posher seating upstairs, but overall Buhari's is all business. That business is buriyani.\nI had one of their signature egg buriyanis (Rs. 200). The Buriyani initially looked like a small portion, but after half a serving I was nearly full. It lacked a bit of its usual taste, but this was more than made up for by the cool bite of the mint sambol and sweetness of the raisins. They could have been a bit more generous with those raisins though. You also get a cheap curry with your buriyani which supports the flavour a little.\nIf you’re like me and have often detested the orthodox bland, dry roast chicken most saivars and hotels offer, Buhari’s has an alternative. Ask for their chicken masala. Good gosh. The Buriyani and Masala were made for each other. At Rs. 280 for a quarter chicken, the chicken masala is a dish full of succulent goodness. It’s essentially strips of tender roast chicken that is made nice and moist with what appears to be lime and a bit of a masala curry mix.\nIf you’re looking for something else you could try their chicken Palandi (Rs. 290 per quarter). This is a slightly wetter option. In the Palandi’s case you’ve got strips of chicken in an oily onion curry mix. The Palandi is filling, so a quarter will cover two people with ease.\nMy drink was one of those cheap 80’s looking Coca Colas which can be quite refreshing on a warm Colombo afternoon. If you’re looking for dessert, and I’m saying this if you’re absolutely craving for something sweet, their faluda, and ice cream seemed popular with other diners. Personally I wouldn’t touch milk based products at any hotel with a 10 foot pole. My total bill with VAT was Rs. 875. A good deal considering I waddled out like a stuffed duck.\nAs far as food hotels go, Buhari’s is pretty good given that they’ve refurbished the upper floor and included air conditioning. The upper floor is actually quite pleasant, but the ground floor is still messy and noisy. You'll be washing your hands in a place so greasy you might as well not, so ask for a finger bowl. Service was good in my case. My orders were out in less than five minutes and were piping hot. My waiter, or 'boss' was a rather attentive fellow who was quick to respond. Just keep in mind that most of the waiters have been here since time immemorial, so they’ve either come to love or hate what they do.\nI’ve always looked forward to eating at Buhari’s, but I must say this time I was a little disappointed. While the food was tasty, it was not what I remember it to be. Inconsistency seems to be the whole problem here because a few months ago it was excellent. However, it remains a Maradana institution. If you’re ever in the neighborhood, you should still check it out.\nThough Hotel de Buhari may not be as good as your grandparents recall, they still serve platefuls of their saffron-gold splendour.\nLocal biryani doesn’t seem to get the attention it deserves.  If you think about it though those plates of saffron tinged rice are a central part of life for millions of Sri Lankans.\n\nඅවුරුදු ගාණක් ගිහින් වුණත්, එදා වගේ ම රසට අපේ තාලේ බුරියානි හදන බුහාරි හෝටලය ඇත්තට ම ජීවිතේ එක සැරයක් හරි ගිහින් කාලා එන්න වටින තැනක්.\n\nදේශීය බුරියානියට හිමිවියයුතු නියම ගෞරවය ලැබෙන්නේ නැහැ. ඒවුණාට එය මිලියන් ගණනක් ශ්‍රීලාංකිකයන්ගේ ආහාරයේ වැදගත් කොටසක්. විශේෂයෙන්ම මුස්ලිම්වරුත්, දෙමළ ජාතිකයනුත් ඔවුන්ගේ විශේෂ උත්සව සඳහා බුරියානි පිසිනවා. රටේ හැමකෙනෙක්මත් හොඳ බුරියානියකට කැමතියි.\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/buhari-hotel/review-46964",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/01/yimg_adGZnV-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/01/yimg_V0Mp3S-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/01/yimg_gMln6c-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/01/yimg_kfYdlJ-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_E5hzQl-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_qOEqMR-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_xfPlx6-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_2hxVSx-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_ZqGaR0-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_uhrULU-150x100.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/11/IMG_4836-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/11/IMG_4838-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/11/IMG_4840-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/11/IMG_4843-150x105.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/01/yimg_jLCora-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/07/r7ukSszy258MtvRTun.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_uhrULU-640x426.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_E5hzQl-640x426.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_ZqGaR0-640x426.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_xfPlx6-640x473.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_qOEqMR-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_XglW0a-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_L4QWMb-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2018/04/hfcSLSOqdDwdM8F6cI.jpg",
    "https://www.yamu.lk/uploads/dp/2018/05/sIJAcEVxrFdIsRfn2v.jpg",
    "https://www.yamu.lk/uploads/dp/2018/04/hfcSLSOqdDwdM8F6cI.jpg",
    "https://www.yamu.lk/uploads/dp/2018/05/sIJAcEVxrFdIsRfn2v.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/01/yimg_adGZnV-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/01/yimg_V0Mp3S-640x508.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/01/yimg_gMln6c-640x403.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/01/yimg_kfYdlJ-270x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}