{
  "name": "Hotel Amirthaa ",
  "address": "256 A, Galle Road, Colombo 04",
  "open_until": " Open 6.30 am to 10.30 pm every day.",
  "telephone": "0112593447",
  "description": "Amirthaa is a cheap, clean, pure-veg South Indian restaurant in Bambalapitiya. The place gets pretty hectic, but the food is good.",
  "reviews": "Amirthaa is a popular pure-veg South Indian restaurant in Bambalapitiya. The place is ridiculously busy all the time, but the food is cheap and tasty.\nIf you live around Bamba or Wellawatte, there's no shortage of vegetarian Indian restaurants. Amirthaa is one of the favourites along with the likes of\n. What's great about these places is that they're all cheap, so two people can easily stuff their faces under Rs. 500. In terms of variety they've got pretty much all the bases covered with the essentials like vadai, dosai and some interesting variations like their chili parata.\nTheir ghee dosai (Rs. 160) was generally thicker than most places, which makes it very filling. We had this while we were at the restaurant, and let's just say it gets a bit chaotic in there. The dosai is served with the usual sides - sambar, onion tomato chutney and coconut chutney. All of it is basically served on to the plate so they kind of ended up mixing together in our case, which wasn't ideal.\nThe dosai was crispy and a bit bigger than other places. So one is generally enough to fill you up. The coconut chutney in particular had a great balance of flavours and spice. The sambar, which you get a ton of, was creamy and light with a mix of veges and spices. If you don't mind the fact that its a bit messy, it's pretty good.\nWe also tried out their ulundu vadai and masala vadai (Rs. 45 each). The latter was awesomely crispy with a good amount of lentils and onions mixed in. The ulundu vadai on the other hand was dry, chalky and a bit bland. There's good chance the ulundu vadai was made in the morning since it was a bit cold.\nFor dessert we tried out their muscat (Rs. 30) and jelebi (Rs. 40). I love a good muscat, but it's becoming increasingly difficult to come by. The Amirthaa muscat was just plain disappointing, both in terms of flavour and texture. This was more along the lines of a hard jelly.\nThe jelebi, however, was excellent. It's also way bigger than any other single jelebi we've gotten. Sweet, oily and just generally unhealthy - all signs of good jelebi.\nTo say Hotel Amirthaa tends to get crowded, would be an understatement of epic proportions. This place is practically packed to capacity 24/7. The tricky part is that they've got some waiters in uniform and others in normal clothes, so the best advice would be to sit and wait for someone to take your order.\nThat being said, the service is extremely fast. You might think it's disorganized but they've clearly got a method to the madness.\nHotel Amirthaa is good choice for those looking to get some South Indian food in Colombo. It's good for a quick dosai but no so much if you want to have a peaceful meal. If you're expectations are in line, it's a good experience.\nAmirthaa is a cheap, clean, pure-veg South Indian restaurant in Bambalapitiya. The place gets pretty hectic, but the food is good.\nAmirthaa is a cheap, clean, pure-veg South Indian restaurant in Bambalapitiya that serves a good thali and various fried South Indian and Sri Lankan snacks such as thosai, paratha, samosa, and wade. The restaurant is really good for the price, and it stands out among the numerous - and mostly average - eating joints along this stretch of Galle Road.\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/hotel-amirthaa/review-43688",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_fGDGO8-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_MjVOe9-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_er1vDJ-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_OWjPUE-150x100.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/10/amirthaa-shorties-rs-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/10/amirthaa-door-resize-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/10/Amirthaa-outside-resize-150x105.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_fGDGO8-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_OWjPUE-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_MjVOe9-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_er1vDJ-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_VFHzof-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/05/yimg_MCsvCD-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2017/11/OEZvZCvsKjIkFHa8EL.jpg",
    "https://www.yamu.lk/uploads/dp/2018/06/8vWkh5taQ5CVDJgqpQ.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/VBxu8OQlwaXM6zpakX.jpg",
    "https://www.yamu.lk/uploads/dp/2017/11/OEZvZCvsKjIkFHa8EL.jpg",
    "https://www.yamu.lk/uploads/dp/2018/06/8vWkh5taQ5CVDJgqpQ.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/VBxu8OQlwaXM6zpakX.jpg",
    "https://www.yamu.lk/uploads/dp/2018/06/l0i3cDKDwjSz1EGF80.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_fGDGO8-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_MjVOe9-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_er1vDJ-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_OWjPUE-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}