{
  "name": "Hotel Bankshall",
  "address": "57, Bankshall Street, Colombo 11",
  "open_until": " Open until 12:00 AM",
  "telephone": "0112344321",
  "description": "Open from the crack of dawn till midnight, this is a great, clean rice-and- curry stop with quail on the menu.",
  "reviews": "This humble little restaurant is a serious contender in the rice-and-curry game, offering unlimited rice and sides for Rs. 110. As a bonus, they also offer quail, (yes, quail) for Rs. 260.\nIf you work around this part of Colombo, you need to try lunch here. It's been around for 18 years and has been renovated this year, and is quite clean for a cheap rice-and-curry place. Its location in the middle of Pettah makes it less than accessible to most, but the food is great and the general mood quite pleasant. They're open from the crack of dawn until midnight.\nI tried the rice and curry (Rs 110) with the side dishes of the day, which included brinjal, carrot curry,\nand\n. The rice was well-cooked and you can serve up as much as you want. We'll get to the sides later, that's not what I threw myself halfway across Colombo for. Let's get to the quail.\nBankshall Hotel is the only place we know of that serves quail. They call it '\n', pronounced\nwhich they source from a farm. These are not wild birds, so you don't have to worry about tough meat. If you're super serious about your quail, you might find theirs to be overcooked, but I enjoyed the soft flesh and the cute little bird sitting in a tray of what looked like chicken curry. It's not too spicy, and also tastes a lot like chicken curry. If you want to be able tell yourself that you ate a whole bird for Rs. 260, then this is the bird for you.\nNow the sides, I found the carrot curry to be sweet with its coconut milk base. The brinjal was not too oily, and packed quite a bit of heat, which made it quite enjoyable. Serious heat, mind you, for an otherwise unassuming vegetable. The\nwas the only let-down, being a little too watery for my liking. Oh, but the real winner was the\n.\n(dried shrimp) is a magical rice puller that, in my book, gives\n(or Maldive fish) a run for its money. It also turned this otherwise not-so-spicy\ninto a delicacy.\nI spotted\n(basil seeds) in a glass in the fridge, so I asked what it was doing there. On hindsight, this was a pretty silly question to ask, given that the place is run by Muslims from Kandy. The waiter suggested the\n(Rs. 150) that is topped with\nThe\nhere is actually pretty good. They serve it with a thick layer of sherbet at the bottom, milk and ice cream, and, if you happen to ask silly questions, lots of basil seeds. The ice cream is mediocre, but once you stir up all the ingredients, the drink turns a crazy hot pink and delivers a potent sugar rush. It tastes vaguely like rose essence, but who expects rose essence in\nanymore?\nGiven the somewhat recent renovation, this place is pretty clean. The bright white lights add to the sense of hygiene that a lot of rice and curry stops tend to lack. It's not the most spacious spot, so you don't want to go with too much of a crowd. It's best for a group of maybe four people. If you happen to be\naround Pettah, have lunch here. It will really brighten up your day. The staff are fairly attentive once you get there, but make your order quick, because they'll move on to the rest of the customers and then you can't really expect the same waiter to return to you. They're pretty high-volume once it gets to lunch time, so hit this place around noon.\nThis is one of the few places in Colombo that serves quail for lunch and dinner. That alone makes it quite special. The food is halal and the staff is fluent in Sinhala and Tamil. They also do\nand fried rice, but those don't really compete very well with other eateries. It's really the rice and curry that contributes to the charm. You can speak to the old man by the counter if you want to know the story of this establishment. He's the friendliest of the lot.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/hotel-bankshall/review-57561",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_dp0jyM-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_DcRJWZ-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_EVzzQr-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_8AZPRE-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_f5lrWl-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_tNHRXB-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_p0dFZx-150x100.JPG",
    "https://www.yamu.lk/uploads/dp/2015/12/0F34X3pTfLr7btifJN.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_EVzzQr-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_dp0jyM-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_DcRJWZ-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_tNHRXB-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_p0dFZx-320x480.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_8AZPRE-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_l2Y7dl-600x250.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_rrZzWU-600x250.JPG",
    "https://www.yamu.lk/uploads/dp/2016/12/mbIK67SlDJuiq9zdZS.jpg",
    "https://www.yamu.lk/uploads/dp/2016/12/mbIK67SlDJuiq9zdZS.jpg",
    "https://www.yamu.lk/uploads/dp/2015/12/0F34X3pTfLr7btifJN.jpg",
    "https://www.yamu.lk/uploads/dp/2015/12/0F34X3pTfLr7btifJN.jpg",
    "https://www.yamu.lk/uploads/dp/2015/12/0F34X3pTfLr7btifJN.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_dp0jyM-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_DcRJWZ-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_EVzzQr-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_8AZPRE-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}