{
  "name": "House Of Biriyani",
  "address": "35A, Temple Road, Kalubowila",
  "open_until": " Open 10.00 AM - 9.00 PM",
  "telephone": "0771404052",
  "description": "House of Biriyani is a new biriyani delivery and take out in Kalubowila. They offer good value for money along with a solid roast chicken, but they also have room for improvement.",
  "reviews": "House of Biriyani is a new biriyani delivery and take out in Kalubowila. They offer good value for money along with a solid roast chicken, but they also have room for improvement.\nBiriyani is just one of those things that doesn't go out of fashion here in Sri Lanka. We'll eat a lot of it, get sick of it, then a few weeks later, be right back at it. When it comes to caterers, the first places that'll come to mind are most likely\nand Galle Caterers who have been at it for a while now. More recently we had\njoin the fray, and now we've got House Of Biriyani.\nThere really isn't much to differentiate HoB from the competition, but their strength is definitely the value for money they offer. While most of the earlier mentioned spots offer only a single sawan size, usually to cater to groups of six and above, HoB also offer a smaller sawan for three. In reality though their small sawan still has enough rice to feed around five. The prices range from Rs. 1800 to Rs. 3900, depending on the sawan size and the type of meat (chicken, beef, mutton).\nThey're still very new so we didn't know much at all about their stuff, but after trying their chicken sawan, we were pretty happy. Like we mentioned earlier, even the small sawan comes with a pretty large portion of rice which can easily feed more than three. You also get a full roasted chicken, three boiled eggs, some chopped pineapple and onion rings, along with some caramelized onions and raisins, mixed in with the rice.\n\nFor the rice, they've chosen a type of short grain samba (might be\n, but not quite sure). The rice was fine but it didn't have the same quality of a basmati biriyani, which is understandable. I'm not a huge fans  of raisins in rice, so if you share the same sentiments, you may find yourself picking out quite a few. On the other hand, the caramelized onions complements the rice far better by adding  just a slight sweetness and a bit of crunch. The only real shortcoming in the rice was the lack of chicken in it. There was a bit of chicken here and there but definitely not enough considering the amount of rice.\nFor sides, they give you a creamy mint raita, mint chutney, a marmalade \nchutney and a gravy. The odd one out here was the marmalade chutney \nwhich was actually pretty great. It's quite sweet but it balances out well with the chilli flakes adding a bit of heat. The creamy mint\n raita was also quite nice, with the curd helping the moistness of the rice. The other two were okay but, I didn't find myself \ngoing back for more.\nYou can call House of Biriyani any time between 10 AM and 8 PM to place your orders. You can either pick it up from their premises at No. 35A, Temple Rd, Kalubowila or have them deliver it to you. The delivery charge depends on your location since they have it sent through a metered taxi.\nHouse of Biriyani doesn't look to change much from the norm when it comes biriyani preparation. They do, however, offer good value for money, large portion sizes, a good roast chicken and the convenience of delivery\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/house-of-biriyani/review-42619",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_uIJlEf-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_wBXHc0-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_uTFt2V-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_IK5Hy6-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_dPS0A0-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_uIJlEf-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_wBXHc0-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_uTFt2V-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_N8D6rk-600x250.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_Wkaxue-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_uIJlEf-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_wBXHc0-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_uTFt2V-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_IK5Hy6-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}