{
  "name": "Ikoi Tei (Dutch Hospital)",
  "address": "Dutch Hospital Shopping Precint,\nColombo 01",
  "open_until": " Open until 11:00 PM",
  "telephone": "112441275",
  "description": "An authentic and casual Japanese revamp of Work In Progress. Worth a try.",
  "reviews": "The Hilton's authentic yet casual revamp of the Dutch Hospital’s\n, Ikoi Tei is an interesting addition to the Colombo dining scene. Thankfully shying away from the über fine-dining scene that lots of other places seem to be aspiring to, it’s upscale casual. Basically for people who have money, but want to wear shorts and drink a beer.\nThe date of our visit was sandwiched between the soft opening and the hard opening, so we think we can give you a pretty good idea of what to expect.\nThe menu was quite extensive, and they also have a bunch of explanatory pictures on the side just in case you’re a Nihon novice. We found the prices quite a happy medium, cheaper than\nor\n, but a bit more expensive than\n. You’re looking at about Rs. 1500 per head if you avoid cocktails. Confusingly, some fresh juices (like the apple juice we ordered at Rs. 590) were more expensive than certain cocktails (like the Paradise Island we got at Rs. 500).\nEverything’s made fresh, so orders took barely 5-10 minutes to turn up. We ordered a tempura prawn roll at Rs. 750, Chicken Teriyaki at Rs. 800, and Chicken Katsu Curry at Rs. 850. I personally found each dish incredibly filling, enough for a full meal for one not-so-hungry person. Since the restaurant is yet to have its official opening, the management gave us some potato and egg salads on the house, so we could give them some feedback. It was creamy and not too heavy, and well flavoured. A good opening act.\nThe prawn tempura roll (Rs. 750) was light and crispy, tasted superbly fresh, and came topped with some imported\n(flying fish roe, deep orange in colour). I wasn’t a big fan of the abundance of\nmayonnaise that the roll was bedded on, despite it being less cloying than the usual American-style mayo.\n\n\nThe chicken and rice Katsu curry (Rs. 850) came next, along with the chicken Teriyaki (Rs. 800). Again, they arrived superbly quick and steaming hot. The plating was elegant and simple, no unnecessary garnishing or flourishes. What you’d expect from quality casual dining.\nThe katsu curry was a bit disappointing from a Sri Lankan perspective. I think places like\nand even Nihonbashi to some extent manage to cater to Lankan taste. Despite being well cooked (well crumbed and succulent yet not heavy/oily chicken), and quite large in quantity, it lacked the abundance of salt and spice that our palates are accustomed to. Of course, Japanese-style rice is boiled without salt, but the curry too lacked any definitive flavour. The teriyaki chicken was better, lovely crispy skin, and surprisingly light sauce. It was quite sweet, but at least it had discernible if not strong flavour.\nThe desserts they brought out were also complimentary, and quite interesting. Both the ice cream and the swiss roll were infused with\ngreen tea (a fine powder made of ground green tea leaves, which is incredibly beneficial to your health.\n\nIt’s easily the best green tea ice cream I’ve had, and was even better when I put chunks of the swiss roll in there to add texture.\nThe drinks were immensely bleak. The fresh apple juice was undoubtedly fresh, but just tasted like water with apple puree settling at the bottom. At Rs. 590, it was a total bust. I also ordered the restaurant’s signature cocktail, a champagne, lime jelly and vodka concoction, but they didn’t have it. So I ordered the Paradise Island instead which essentially tasted like Sunquick, a bit of arrack, and a lot of ice. Even more of a bust. A solid D.\nThey’ve maintained much of the old structure, like the same funky wrought iron lamps suspended from the same open wooden raftered ceilings. They have made a couple of key changes though, like expanding the kitchen by about 10 feet and adding some chic paintings in the Japanese flat screen-printing style of the Dutch Forts.\nThey’ve also installed a huge teppanyaki grill at the far end of the restaurant, surrounded by a ring of about 8-10 chairs. This looks perfect for a post-meeting dinner/drinks session with business partners, or a large family’s night out. It isn’t functioning just yet as they’re waiting for their teppan chef to arrive, but it should be ready in a couple of weeks.\nThe seating appears to be the same as WIP, but the cutlery and ceramicware are all sleek imported pieces from Malaysia and Japan. The lengths that they’ve gone to maintain authenticity are pretty impressive.\nWe’re not entirely sure maintaining WIP’s ochre painted walls was a good idea, as it’s a bit too warm for the usual minimalist chic Japanese vibe. We also didn’t particularly love the Christmas table decor or the bright green table lamps, but we’re sure they’ll work on better table decor soon.\nI found the service impeccable. There were plenty of helpful, knowledgeable, and attentive servers and staff around. They knew their way around the menu, they explained to us the restaurant’s theme and aims, and were very efficient. They initially misheard the first tempura roll order, and brought just tempura prawns out, but then profusely apologized and rectified the mistake within minutes. I was very impressed.\nThey also unobtrusively checked everything was fine and asked for feedback a couple of times, which we were happy to give. I had a few questions about where they sourced their\nfrom, and the chef, Hikaru Takahashi, promptly came out to explain and have a chat.\nWe quite liked the place. It was simple, quick, easy, yet upscale. The decor, especially the ochre walls, left a bit to be desired, but perhaps they’ll work on that in time. Quite excited about the teppanyaki grill opening, and a severe revamp of their drinks selection. The service was great, and we hope it’s maintained over the next few months, even on busy weekend nights.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/ikoi-tei/review-69716",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_23b8ms-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_POjaMP-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_LK1KaB-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_flZJCb-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_cq0Evw-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_oe3TDA-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_EsE5KM-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_A4Wvb2-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2017/04/KE2F77hW9uoRt7RHja.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_A4Wvb2-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_cq0Evw-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_EsE5KM-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_LK1KaB-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_oe3TDA-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_flZJCb-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_Z9mUmz-600x250.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_sdbGWc-600x250.JPG",
    "https://www.yamu.lk/uploads/dp/2015/12/0F34X3pTfLr7btifJN.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_23b8ms-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_POjaMP-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_LK1KaB-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_flZJCb-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}