{
  "name": "Il Cielo",
  "address": "The Goldblock, 5th Floor, \r\n101/11 Hunupitiya Lake Road,\r\nColombo 2, \r\nSri Lanka",
  "open_until": null,
  "telephone": "0114366355",
  "description": "New rooftop Italian fine dining restaurant behind Gangaramaya Temple",
  "reviews": "Il Cielo is the new Italian fine dining joint hidden behind Gangaramaya Temple. Run by the team who do Tsing Tao (which we\nwell), we went in hoping for good things. Unfortunately, the contemporary theme and stylish ambiance didn’t match the quality of the food or the service.\nAs you head up the street, you’ll see a cool Il Cielo/Berlin Sky Lounge mural on the right hand side of the road and you'll find the restaurant opposite. First impressions are great once you get to the top, with a two floored indoor seating area and a large outdoor balcony (we’re not too sure what they do when it rains). We chose to sit on the balcony, where you get a great view of the Beira Lake and the surroundings. It seems this is one of the few areas of Colombo that doesn’t have high rises blocking the views, and it definitely helps. You can also see into the two tiered kitchen from the balcony, which is a slick touch.\nTheir décor is modern, and the seating well placed to give a busy but not crowded feel. This paired with some great chilled lounge/jazz music finished off the elegant milieu.\nWe opted for a starter to share, a couple of mains and a dessert. Once we had ordered, a bread basket arrived. The bread was a fragrant herby rosemary focaccia, but lacked seasoning and was dry. Its saving grace was the (also) herby butter, which was creamy and rich.\nOur starter was\n(prawns wrapped in bacon) at Rs. 690, which sounded awesome at face value. While the prawns were cooked reasonably well, the bacon was almost mushy and pretty tasteless, not giving the saltiness the prawns craved. Then the presentation was wholly unappetizing, with a meagre 3 prawns on the plate, one with its head fallen off, and then the tiniest smidge of balsamic glaze on the plate as though it was meant to be artsy.\nThis whole thrilling experience was interrupted by one of the mains,\n(tagliatelle with pesto, Rs. 890), being brought 2 minutes after the starter arrived. We sent it back asking for it to be remade when the other main was ready so it wouldn’t be cold and congealed.\nAfter the starter was removed, the tagliatelle reappeared pretty sharpish. Sadly our instructions had been ignored, and the pasta clearly had been left under a heat lamp, so was hot in some places and cold in others, and was sticking together in a congealed lump. Surprisingly the flavour of the pesto was beautiful, with the right balance of basil, oil and pine nuts, and the pasta was al dente. This was a recommendation from the waiter so we were impressed on that front, shame we couldn’t get it fresh.\nAbout 40 minutes after the pasta had arrived; we finally got the second main,\n(grilled calamari) at Rs. 1,190. Again presentation was woeful, with a pile of calamari on one side of the plate and a pile of roasted vegetables on the other. The calamari lacked seasoning and was rubbery while the vegetables had a distinct bitter after-taste. Considering this a very simple dish to make, execution was calamitous.\nFor dessert we went for the Italian staple of Tiramisu. While the flavour was lovely, the texture was not. The cream was watery, as if the Tiramisu had been frozen. Not a good end to the night.\nFor drinks we had the Kamikaze cocktail for Rs. 620 and an Apple Spark (apple, cider, and beer cocktail) at Rs. 480. The Kamikaze was well balanced, with a strong hit of lime to counter the sweetness. The Apple Spark on the other hand was poorly mixed and overly sweet so you either got a load of sugar or a smaller load of sugar depending if you drank from the bottom or the top of the glass. The concept could have worked if not for this, as the flavour of the apple, cider and beer were there, but were killed by the saccharine taste.\nService overall was below par, despite a very friendly manager. After arriving at such a nice environment, we were seated fairly quickly, and then it all went downhill. The waiter couldn’t seem to handle taking food and drink orders at once, we were asked for our drinks order twice. The pasta, as mentioned above, was brought too soon after the starter, and the calamari arrived\nlater than the pasta. If the food didn’t kill the dining experience, this certainly did. It’s not fun watching your dining partner scoff down their food, while you have to wait, ravenous. The whole session took over 2 hours, which is way too long.\nIl Cielo certainly has the location and ambiance on point, their food and service really lets it down though. This may be because the restaurant has only been open a week or two, so it may be teething issues. For now, we’d say go there for drinks and the pesto.\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/il-cielo/review-82808",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_BSc3fg-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_sDvSEM-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_uUwRda-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_dJdxeL-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_ZZz3wB-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_8EsbGa-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2016/05/uqi8BASRyQ9lCH2tmd.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_uUwRda-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_ZZz3wB-640x383.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_BSc3fg-640x432.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_8EsbGa-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_dJdxeL-640x406.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_sDvSEM-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_mOENRl-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_GGYNaT-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_BSc3fg-640x432.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_sDvSEM-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_uUwRda-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_dJdxeL-640x406.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}