{
  "name": "Il Gelato (Duplication Road)",
  "address": "R A De Mel Mawatha, Colombo",
  "open_until": " Open until 10:00 PM",
  "telephone": "0115328328",
  "description": "Ice cream lovers rejoice! Il Gelato is back on Duplication Road. They've moved to a smaller location than their previous outlet, but the gelato is still as good.",
  "reviews": "Ice cream lovers rejoice! Il Gelato is back on Duplication Road. Yes, yes we know ice cream and gelato are different, but you get what we mean. They've moved to a smaller location than their previous outlet, but the gelato is still as good.\nAt this point more or less anyone in Colombo has probably heard of Il Gelato, and for good reason; they serve up arguably the best gelato/ice cream/sorbet in the city. In a general sense, not much has changed but we did notice a few interesting new flavours like the panacotta.\nPrices have also remained more or less the same with a single scoop at Rs. 320 and a double scoop at Rs. 440 (which just makes way more sense). Besides the gelato, they've also now introduced flavoured crushed ice at Rs. 150, which is actually not too steep considering the fact that you get a decent portion.\nThe frutti di bosco is their new berry mix which seems to (at least temporarily) have replaced their strawberry flavour. It's still quite similar in terms of flavour, with a bit of added tartness from the frozen blueberries. This is an excellent way to cleanse the palate after a meal since this has an almost sorbet like texture, as opposed to the creamier flavours.\nThe panacotta is one of their newer additions and it's pretty accurate in terms of flavour as well. It's not for everyone though, since it does come across as a sort of creamy custard ice cream. At the very least, it's worth a try.\nWe also got a combo of dark chocolate (\n) and biscotto which was a surprisingly decent pairing. The former is extremely chocolatey and that's abundantly clear when you see it. I'm personally not huge fan of dark chocolate, but this is a great choice for those who are. Combining it with the biscotto helped lighten up the intensity of the chocolate and add a bit of creaminess. I love the biscotto because the flavour of the biscuit comes through so distinctly, but our only gripe was that the biscuit pieces in it were really soggy. But I guess that's unavoidable the longer it's stored.\nThey had around four flavours of the crushed ice, of which we chose the passion fruit. All in all for Rs. 150 this is a pretty good deal since it comes in larger cup than the gelato. It's very refreshing with good amount of passion fruit blended into it. Perfect for a warm day.\n\nThe new space offers the same amount of wiggle room (like literally) as the Odel outlet, which is to say it's pretty tiny. While it's not nearly as spacious as the former Duplication Road outlet, they do have an Illy cafe opening up on the first floor with a bit more seating space.\nThey don't have any real parking space, so parking on Queen's Road or Alfred House Gardens is advisable. In terms of service a bit more enthusiasm certainly wouldn't have hurt the cause.\nIl Gelato is as solid as ever, and we're really happy to see them back on Duplication Road. The new location is smaller than the former but also more accessible and they've added some interesting new flavours as well as a relatively affordable option in their crushed ice.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/il-gelato-queens-road/review-77952",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_IYar0a-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_YELKaV-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_nHA8Gj-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_RlwNMv-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_YAd9RE-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_907F6g-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_9Wgk3e-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_DXZLaS-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_RlwNMv-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_IYar0a-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_YELKaV-292x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_nHA8Gj-640x441.jpg",
    "https://media.giphy.com/media/aQ0PfLFwagW52/giphy.gif",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_9Wgk3e-640x239.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_YAd9RE-318x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_mOENRl-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oKIYgP-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_IYar0a-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_YELKaV-292x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_nHA8Gj-640x441.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_RlwNMv-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}