{
  "name": "Il Ponte (Hilton)",
  "address": "2, Sir Chittampalam A Gardiner Mawatha, Colombo 01",
  "open_until": " Open 10.00 AM - 11.00 PM",
  "telephone": "0112492492",
  "description": "Il Ponte at Hilton is one of the older Italian restaurants in Colombo. It may not be as popular as it was back in the day, but their Italian fare is pretty solid all-round.",
  "reviews": "Il Ponte at Hilton is one of the older Italian restaurants in Colombo. It\nmay not be as popular as it was back in the day, but their food is still pretty\nsolid all-round, although the setting could use some work.\nThe last time I was at Il Ponte was back in 2008, and I quite literally\nforgot about it until I realised that we hadn't reviewed it. Coming back, it\nseems like nothing much has changed in terms of ambience, at least not for the\nbetter. The poolside setting is still pleasant but it lacks the charm it\nonce had. The dining area is plain with generic furniture and nothing else to\nreally emphasise the Italian theme. However, most of the hotel is being\nrenovated, so hopefully this section will follow suit soon.\nWhile friendly and brisk, the service was inconsistent. \nWe found ourselves having to look around for the\nwaiters (who were busy watching the match at times) when we were the only\ncustomers.\nTrue to its name, Il Ponte offers a small, almost entirely Italian menu,\nbesides a few oddities like fish and chips. The prices vary widely\nbut we'd recommend Il Ponte for the pizzas, which are quite reasonably\npriced between Rs 1,100-Rs 2,200 for a large, eight-slice pie. The mains, on\nthe other hand, are definitely pricey in comparison, with most costing upwards\nof Rs 2,000. That being said, we didn't really come across any major flaws in\nthe dishes we tried.\nWe started things off with the spicy cheese croquettes (Rs 495), which were\nwell seasoned and crispy with a soft and creamy cheese filling. They were not\nexcessively spicy, but had enough heat to justify the description. These were\nserved with a side of what was meant to be a tomato confit, although I'd say it\ntasted more like a thick tomato sauce.\nThe pollo picante pizza (Rs 1,350) was surprisingly large for the price.\nConsidering the flavour and quality of the ingredients used, we'd say it's good\nvalue for money. Nowadays, stringy mozzarella pizzas are found mostly just on\nTV adverts (thanks Pizza Hut -.-), but that's exactly what we got with this\none. It came with plenty of roast chicken, a good amount of bell peppers and\nsautéed onions for added texture. The only minor issue we had with it was that\nthe chicken was a bit dry, but it was seasoned perfectly. With eight\nsubstantial slices, this can be shared among two to three people (provided it's\nnot the only thing you order).\nAnother affordable menu option was the beef lasagna (Rs 1,395), which was\nactually our favourite dish of the lot. Once again, we got a generous amount of\nmozzarella baked over a substantial portion of lasagna, which was cooked just\nright. We also liked the fact that they didn't skimp on the minced beef, which\nwas moist and flavoursome thanks to the tomato sauce. The sauce also added a\nhint of sweetness, balancing out the flavours nicely.\nTo wrap up our very Italian meal, we went with the tiramisu (Rs. 695) for\ndessert. It's still quite tough to find a good tiramisu in Colombo, but Il\nPonte's certainly makes a strong claim. The standout element of this tiramisu\nwas undoubtedly the mascarpone cheese, which was light and smooth with the\nslightest coffee undertone. The coffee hit came through with the cake, which\ncould have been thicker. But the overall flavour was still excellent.\nThough it may seem like Il Ponte is old news, their Italian fare is still\ntop notch. They aren't the cheapest place in town and the service has room for\nimprovement, but their pizzas certainly offer good value for\nmoney.\nIl Ponte at Hilton is one of the older Italian restaurants in Colombo. It may not be as popular as it was back in the day, but their food is still pretty solid all-round, although the setting could use some work.\n\nIl Ponte at Hilton is one of the older Italian restaurants in Colombo. It may not be as popular as it was back in the day, but their Italian fare is pretty solid all-round.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/il-ponte/review-51665",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_Sm2PJn-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_5EEmte-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_hyTX2t-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_eiNnoL-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_M6t7QO-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_jofULr-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_SN2eBN-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_mJkWI5-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_2F4WDC-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_AqqmnU-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_eiNnoL-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_SN2eBN-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_M6t7QO-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_5EEmte-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_Sm2PJn-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_jofULr-318x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_mOENRl-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/02/yimg_kz2rgV-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_Sm2PJn-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_5EEmte-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_hyTX2t-640x480.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_eiNnoL-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}