{
  "name": "Indian Spice",
  "address": "38, Sea Avenue,  (Marine Drive) Colombo 03.",
  "open_until": " Open 11:00 AM to 3:00 PM & 6:00 PM to 11:00 PM",
  "telephone": "0112576807",
  "description": "Indian Spice is a low-key Indian restaurant that shares the premises with the equally modest, yet somewhat dodgy China Town. The place may give out a slightly dicey feel, but the food actually isn't half bad with a pretty legit butter chicken.",
  "reviews": "Indian Spice is a low-key Indian restaurant that shares its premises with the equally modest, yet somewhat dodgy China Town. The place may give out a slightly dicey feel, but the food actually isn't that bad, offering a pretty legit butter chicken.\nAs a rule of thumb, I'm usually quite skeptical about restaurants that try to serve multiple cuisines, and Chinese and Indian are about as contrasting as it gets. With so much competition around we're honestly quite surprised that the two have been around for as long as they have. Indian Spice's menu is unremarkable, with the usual fare of naan, biriyani and classic curries. While they won't blow your mind, they do have a few dishes that they do quite well. The prices fall in the mid range in terms of Indian restaurants, so expect to pay around Rs. 800 per head.\nThe Naan (Rs. 90) at Indian Spice was on the thicker side compared to the norm. We got both the butter naan and the garlic naan, with the latter being our preference since the extra butter made it a bit crispier. The garlic naan was also decent, with a good amount of chopped garlic, though we would have liked it better had it not been as doughy, since it didn't have the crunch of the butter naan.\nWe got two curries along with the naan, the first being the Butter Chicken Masala (Rs. 540). The presentation here is a bit sloppy, with gravy lapping at the sides of a flat white bowl. Curries aren't always the prettiest of foods, but we felt a bit more effort could have been put into the appearance. What caught us by surprise, however, was that this butter chicken actually tasted pretty good.\nThe boneless chicken was cooked well, with the thick curry binding well to it. The gravy on this one was actually a darker shade of orange than we've come across, with more distinct spices and seasoning than the milder butter chicken curries at most other Indian restaurants.\nThe Mutton Masala (Rs. 690), probably because of its brownish colour, somehow looked worse than the former. Unfortunately, this one didn't hit it off as well with us. The meat itself was a bit tough and chewy, with the curry being lumpy and lacking that balance of flavour, on top of looking quite unappetizing.\nWe also tried out their Chicken Biriyani (Rs. 490) which is actually higher or on par with most of Colombo's contemporary Indian restaurants. The portion is just about enough for two, but probably not if it's two really hungry people. The long grain basmati rice was the best part about the dish, quite light and fragrant. The chicken in the biriyani was a tad on the dry side and lacking in terms of seasoning, but the accompanying gravy helped the texture while also adding a bit more flavour.\nIndian Spice is located on Marine Drive, though we wouldn't blame you if you drove past it every day and never noticed it. The parking area is barely lit which would have probably scared away more than a few potential customers. The interior is as bland as it gets with white walls and plain wooden furniture. There really isn't much to see here, but it's clean and air conditioned.\nIt's really hard to spot the waiters at Indian Spice since they don't really have a uniform or colour code, so there's a good chance of mistaking another diner for a waiter. The service was pretty slow when we dropped in for dinner, and only one other table was occupied on the night.\nJust like its Chinese partner, Indian Spice doesn't really stand out in a city with more Indian restaurants than we can count. They do, however, serve up a solid biriyani and a suprisingly good butter chicken, which along with a couple of naans can make for tasty meal that isn't not too hard on the wallet.\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/indian-spice/review-87133",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_HBgEKY-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_I3AewG-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_ApP5pz-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_PJ8ZEO-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_dO9KTi-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_z7SGVZ-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_ApP5pz-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_dO9KTi-640x412.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_I3AewG-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_z7SGVZ-640x419.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_HBgEKY-640x393.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_PJ8ZEO-640x453.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_SUwgge-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/01/yimg_akemXM-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_HBgEKY-640x393.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_I3AewG-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_ApP5pz-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_PJ8ZEO-640x453.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}