{
  "name": "Jasmine Song",
  "address": "169, E L Senanayake Veediya, Kandy, Central Province 20000",
  "open_until": " Open until 10:30 PM",
  "telephone": "0812232888",
  "description": "A decent Chinese restaurant in Kandy",
  "reviews": "Jasmine song is operated by the same family who used to run Flower Song, once the most famous Chinese restaurant in Kandy, and the well-known Flower Drum Restaurant in Colombo, the Gyis. A family dispute after the death of the previous owner led to all other properties eventually being closed down due to mismanagement, as a very forthcoming waiter, who’d been with the family for eighteen years, told us.\nMany of the staff of Flower Song are now at Jasmine Song, run by a daughter of the family. Based on the subtext of the tale we heard, there is probably a very interesting story (with dramatic plot twists) about capitalism, family politics and the dos and don’ts of Chinese Restaurant management in Sri Lanka here if anyone cares to write a book about it. A YAMU review of the Mount Lavinia branch can be found\n.\nThe prices aren’t exactly Main Street, but you get what you pay for, most of the time.\nWe started with the Chicken Spring Rolls (Rs. 750 for 3 pieces). They were excellent and the best thing we tried on the menu. They had a crispy exterior and were not too doughey, with an amazing cluster of fresh chicken and vegetables packed in a spicy, juicy mixture that melted in your mouth.\nFor mains we picked the Chilli Chiken with Cashewnuts (Rs. 775 for a small portion), the Mushrooms with Hot Butter Sauce (Rs. 700) and a bowl of rice (Rs. 195). The chilli chicken was good, but the dish could have featured a little less onion and a little more chicken. Sprigs of fresh leeks and greens added a nice crispy texture that was pleasant to bite into.\n\nThe mushrooms were crunchy and had great texture, but were a little too oily, with the generously applied hot butter sauce drowning out the flavor of the mushrooms.\nA lot of other items listed on the menu that we wanted to try out, such as seafood, weren’t available. Business appeared to be slow and Jasmine Song seems to have wanted to concentrate on stocking up only for the most frequently ordered items. Everything we tried was freshly made with good produce.\n\nDesserts were disappointing. Again because most of what you would consider to be ‘Chinese’ desserts, like the lychee items, simply weren’t available. We were given a choice of either cream caramel, chocolate biscuit pudding or vanilla ice cream. In other words, everyday Sri Lankan desserts you can find almost anywhere. We went for the ice cream (Rs. 150 for a small bowl), it was good, but it’s also hard to screw up vanilla ice cream.\n\n\nQuick, friendly and efficient. Most of the staff have been with the family for years and seem quite experienced. We only had to wait about 15 minutes for the food.\n\nThe restaurant features a nice combination of red, white and black with Chinese lanterns hanging from the ceilings. The tables aren’t packed too tightly together, and there’s plenty of room to move around. Wide windows facing the street let in a lot of light. The TV was on when we went in, and the staff were watching an Indian historical drama, dubbed in Sinhala, full of swords, wizards, adventurous princes and maidens in distress.\n\n\nOn an overall basis Jasmine Song offers nothing to wow you. But it’s a great place for Chinese food in Kandy, centrally located and easy to access. The service is fast and efficient and the food is mostly decent.\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/jasmine-song-2/review-203564",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_TdkRdh-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_miXVD0-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_hmXdOO-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_HJoLBZ-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_HJoLBZ-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_miXVD0-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_hmXdOO-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_TdkRdh-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_Orn7Mw-600x250.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_5kH7qF-600x250.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_TdkRdh-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_miXVD0-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_hmXdOO-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_HJoLBZ-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}