{
  "name": "Kate Ryori",
  "address": "237/64, Polhengoda Road, Kirulapone, Colombo 05",
  "open_until": null,
  "telephone": "0773088036",
  "description": "Kate Ryori is a homecook in Colombo that serves up tasty Japanese cuisine at affordable prices with some pretty filling portions to boot. It's a tiny operation, but she's pretty much the only Japanese homecook we know of and it's a great change-up from the usual Japanese restaurants.",
  "reviews": "Kate Ryori is a home cook in Colombo 5 that serves up tasty Japanese cuisine at affordable prices, with some pretty filling portions to boot. It's a tiny operation, but she's pretty much the only Japanese homecook we know of and it's a great change-up from the usual Japanese restaurants.\nOne thing we always look forward to at YAMU HQ is trying out a new\n, and thankfully Colombo has multitude of them. Even among them, Kate Ryori (which apparently translates to Japanese home cooking) is a rarity since she's the only one that serves up\n. It's actually very difficult to pull off since Japanese relies so much on fresh seafood and veggies, which can be tough to come by for a home cook. The best part about Kate Ryori, however, is the fact that you're getting great value for money.\nShe's got a pretty impressive menu as well with all the classic sushi options, all of which are under Rs. 1000 for 8-12 pieces and some really affordable bento boxes as well. You'll need to call one day in advance for seafood dishes since she gets fresh ingredients depending on the order.\nThe first thing we tried was bento box (Rs. 800) which comes with katsu chicken and prawns, sushi, mixed salad, egg roll and japanese pickle. For the amount of stuff you're getting, this is well worth it. Both the katsu chicken and prawns were cooked just right with crispy golden, well seasoned batter. The chicken in particular was moist and soft, with the dark soy sauce adding bit of added saltiness. I'm usually not a fan of chicken in sushi (cooked, obviously), but Kate Ryori's chicken sushi was surprisingly tasty. The egg roll was fine for the most part but it was missing that slight sweetness that tamago usually has.\nThe ten don (Rs. 700) is short for tempura donburi which is basically tempura fried prawns and veggies served with rice and miso soup. From the four dishes we tried, this was the only one we weren't really happy about, mostly because the tempura batter was on the soggy side. That's party due to the travel time but also because veggies like aubergines don't really fare that well since they need be served fast. That being said, the prawns were cooked well with a light crunch and didn't have the same issue as the vegetables. The miso soup was definitely saltier than usual, and while I actually liked that, this may not be for everyone.\nThe tuna temaki (Rs. 800 for 4) was our favourite of the bunch. I was actually surprised to even find this one the menu but this sushi cone was filled with fresh tuna. It also didn't have too much rice, so the flavour of that tuna comes through beautifully. The lettuce adds a welcome crunch while a good hit of wasabi kicks in at the end to really bring it all together.\nNigiri sushi, if you were to get it from one of the usual restaurants, would cost around Rs. 200 each. So Kate Ryori's salmon nigiri (Rs. 850 for 8) is a steal. At first glance, these didn't seem to be the freshest, but once we tasted it we didn't really find it lacking in terms of taste. Flavourwise this is as good as any salmon nigiri we've had delivered from\nor\n. Just like any other sushi you'd need to eat this as soon as possible since it can dry up if left out, though a bit of soy could help on that end. She also sends a bit of mayo on the side, so you can mix it with the wasabi and make a wasabi mayo.\nKate Ryori is a one-woman operation, so it's still pretty small scale. Orders can be placed by calling\n. She currently does take-away only from her residence in Colombo 5. Our best advice would be to call a day in advance so that she has enough time to get everything prepped and ready.\nKate Ryori is a welcome change from the usual Japanese restaurants, and it's not hard on the wallet either. We're always looking for tasty, affordable Japanese and now we've got a home cook who offers just that.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/kate-ryori/review-64241",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_SGt2Z7-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_qtXALd-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_dZYjBz-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_a3KMuY-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_2ZPU3W-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_A4sjel-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_2ZPU3W-640x452.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_A4sjel-640x452.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_SGt2Z7-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_qtXALd-640x357.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_a3KMuY-640x445.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_dZYjBz-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_NW6Myw-600x250.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/05/yimg_qKlg07-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2016/02/9QJpU4sf8B5pT1WYSG.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_SGt2Z7-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_qtXALd-640x357.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_dZYjBz-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_a3KMuY-640x445.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}