{
  "name": "KGN Burgers on Wheels",
  "address": "Hill Street, Dehiwala (After Dharmarama Rd)",
  "open_until": " Open 6 PM - 10.30 PM",
  "telephone": "0773457949",
  "description": "KGN Burgers on Wheels is a food truck on Hill Street that serves up some surprisingly tasty burgers. It's only a two man operation, but it's very efficient, clean and they seem to be a hit with the folks.",
  "reviews": "KGN Burgers on Wheels, as the name suggests, is a food truck we found on Hill Street that serves up some surprisingly tasty burgers. It's only a two man operation, but it's very efficient, clean and they seem to be a hit with the folks.\nHere in Sri Lanka food trucks are all but non-existent. Which is a shame since they open up so many new opportunities for talented cooks. Here in Colombo all we've really got is\n, which does a fairly good take on waffles. While KGN is a smaller truck, they still manage to handle the demand quite well. From what we gather, they're still very new. So the menu is understandably small, which is fine since they're not trying to do too much too soon. For the time being, they serve up mostly burgers, along with a few subs and hot dogs priced between Rs. 130 to Rs. 360, which is not bad at all. According to their\nthey also serve up barbecue chicken on some days. However, what I liked the most about KGN was the fact that it isn't another\nclone.\nMost of their stuff is chicken based, but they do have few beef options like the KGN special burger (Rs. 280). This was a mixed chicken and beef patty, wrapped in an omelette. I honestly wasn't expecting much, but this turned out to be surprisingly flavoursome. The patty itself was cooked just right; cooked through, but still tender. We could also actually distinguish between both the different textures and flavours of the meats in the patty. The three types of sauces- tomato, mayo and chilli mayo (not quite sure), helped enhance the taste.\nThey also toast the buns with a good layer of butter right before constructing the burger, so it's got a nice little crunch to it. From what I could tell, the rest of the composition was the same across the board with a slice of cheese placed below the patty so that it melts when the patty is kept on it. I would have preferred the cheese on top, since it tends to sort of melt into the bread, masking the texture. As for veges, it's just a slice of tomato (technically a fruit, I know) and a bit of cabbage for crunch.\nWe also tried the classic chicken cordon bleu (Rs. 360) and KGN's take on it was comparable, if not better than Burger's King's. It's the usual recipe with the chicken ham and cheese filling, but we think the chicken itself was executed a bit better than BK's with a more crisp, well seasoned crumbed batter and a more generous slice of ham (albeit chicken ham).\nWe actually came across KGN by pure happenstance, when our tuk missed the intended turn off on Hill Street. They were parked right past Dharmarama Rd, with a few tables set up for anyone who wants to sit and have their meal.\nWhat really impressed us was how compact the food truck actually was. It's a modified Dimo\n, with just enough space for two people move around in. Having a peek inside, I was happy to see that they run a very clean station, working well in tandem. Since the burgers are made to order it took just under ten minutes to prepare, which is still quite fast, especially considering the fact that they sent out around seven other burgers in that time.\nWe're really glad to see someone pull off a successful food truck in the suburbs. KGN's modest little food truck serves up burgers that are big on flavour. It's fast, tasty and affordable, which is exactly what we look for in street food.\nKGN Burgers on Wheels is a food truck on Hill Street that serves up some surprisingly tasty burgers.\n\nමේ බර්ගර් නම් දෙහිවලට හොයාගෙන ගිහින් කාලා ආවත් පාඩු නෑ.\n\nකොහාම වුනත් යන එන ගමනෙ හැදෙන පොඩි බඩ ගින්නකට, නැත්තම් රෑ කෑමකට වුනත් උණුම උණු, රසම රස බර්ගර් එකක් කාල යන්න වගේම අරන් ගිහින් කන්නත් KGN වීල් එක නම් මරු තැන.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/kgn-burgers-on-wheels/review-78429",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_x67bs7-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_NeMfkS-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_redIG1-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_gGCaGX-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_KzLjgI-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_nJt3Ep-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_YxCfvz-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_EfGPpZ-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_XvpR8O-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_q562Uz-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_6KP1Ip-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_gGCaGX-640x355.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_KzLjgI-640x399.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_nJt3Ep-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_EfGPpZ-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_redIG1-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_YxCfvz-640x376.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_IUGtdH-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/06/yimg_j6PpZJ-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_x67bs7-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_NeMfkS-640x440.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_redIG1-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_gGCaGX-640x355.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}