{
  "name": "King Coconut",
  "address": "No. 11, Poruthota Road, Ettukala, Negombo",
  "open_until": " Open 9 AM–11 PM",
  "telephone": "0312278043",
  "description": "The King Coconut has a tropical vibe  with its roof dotted with coconut fronds and bamboo fences all round. It's also very chilled out, with a great view of the sea and the wind whipping around.",
  "reviews": "When you think of Negombo, the first image that (most probably) pops into your mind is that of the sun, the sand, and the sea.\nStaying true to the whole tropical vibe of palm trees and nice beaches, King Coconut is one of the many restaurants that line the Negombo beach. It offers you a meal with a sea view to boot. We were told that it's also the oldest restaurant in town (at\n30 years old), but this was mentioned by one of the chatty proprietors there, so I'm not sure if he was exaggerating or not. Either way, for something that's been around so long, they haven't really learnt how to whip up great food. Oops.\nLet's get this out right at the beginning — the service is not great. We were given a warm welcome at the entrance and guided to the table, and then asked if we were Sri Lankan. When we said yes, the man nodded nicely and then disappeared and was never to be seen again. None of the other servers came our way either, and also refused to look in our direction. My friend and I are both really skinny, so it's probable that they never saw us sitting there in the first place. Yeah, right.\nTwenty minutes and many failed attempts at making eye contact later, I finally managed to flag a waiter down. He ambled over, and then had a hard time taking down our order. Sometimes, I wonder if the people who work in restaurants are actually aware of what they have on offer at their respective establishments. This minor obstacle was overcome by opening up the menu card and pointing to what we wanted. I like to think it helped, since we got our food another 20-30 minutes later.\nThe ambience is nice and relaxed, although that has a lot to do with the whole chilled-out beach setup. There's a mix of cultures within the restaurant with flags of at least five different countries strung around, and large, orange, Chinese lanterns hanging from the ceiling.\nThe food is a bit on the pricey side, with rice dishes going at Rs. 900 and above, and pizzas at Rs. 1,100 upwards (except the veggie pizza, which costs Rs. 850).\nWe went for a Sweet Corn Crab Soup (Rs. 400), Prawns Provencal with Yellow Rice (Rs. 1,000), Cheese Garlic Toast (Rs. 450), and a drink, the Minchi Lemon (Rs. 300).\nThe Minchi Lemon had a nice tangy taste to it. The lemony flavour came out quite strongly, but the mint was more of a subtle after-taste. It also came in an enormous glass, which made it pretty much a meal in itself. The drink was an interesting colour — a really thick, dark green that I'd even call murky. Goodness knows how it got to be that shade, because there really wasn't that much mint blended in there.\nThe Sweet Corn Crab soup was yum. Unlike the mint in the Minchi Lemon, there was plenty of corn and crab in this. We got enough and more with each spoonful. The texture and taste was similar to that of chicken corn soup. However, it lacked garnish and, in my opinion, a dash of salt would have done wonders.\nThe Cheese Garlic Toast was basically sliced bread topped with lots of cheese. It was amazing to behold and\nto taste. There was plenty of cheese, and the garlicky flavour came out strongly, but the dish was cold and the bread was moist. I'm not sure if that's a good thing or a bad thing when you order toast, given that toast is supposed to generally be, well, toasty. The dish is nice to\nat though. You can feast your eyes on it, if nothing else.\nAnd finally, the Prawns Provencal. Before I begin to describe it, let's take a good look at it. Those luscious prawns, the yellow rice. The portion large enough to feed two.\n\"Oh my,\" one would say, \"Look at those prawns. Such a LOT of them! And that rice, mmm, so good. I can't WAIT to try it out!\"\nI'm assuming that's what you'd say because it was almost exactly my reaction.\nBut boy oh boy, weren't we way off the mark.\nI know that Prawns Provencal is a dish in which the prawns go hand-in-hand with tomato sauce. But in this case, it seemed like the tomato sauce had invaded, killed, and discarded the prawns entirely. That's all you could taste in it — tomato sauce. The prawns themselves were quite bland, and that's a huge pity because they were plentiful and really soft. The tomato sauce was thick and tasted like it was straight out of a tin. It was a tad bit like drinking ketchup. To be honest, the prawns weren't flavourless — you got a fishy odour when biting into them, but not one that was appetising.\nThe rice wasn't anything to write home about either, so we'll just skip that part. (\"\nwas one comment I got,\n)\nOverall, what an absolute waste.\nI know this review comes off as really harsh. But, to use a cliché, the truth hurts. It's not that great a place, and except for the soup, the food is quite bland. And if you're a local, the service is pretty callous. On the flip side, you get superpowers and turn invisible for while, so yeah.\nOH, P.S: There are plenty of hawkers lining the bamboo fences that demarcate the restaurant's border, and they're quite nice if you know how to deal with them. We met an interesting gypsy and got to meet Barbara, his python.\nP.P.S: There's also a completely randomly placed statue of a T-rex at the entrance.\n",
  "yamu_rating": "We don’t like it",
  "url": "https://www.yamu.lk/place/king-coconut/review-52733",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_T3chP5-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_hsVtDH-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_htl2BJ-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_pQTRAy-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_E7lQIx-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_W1T5QJ-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_5XBYX7-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_SLqAhH-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_bsMfYL-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_83qYtw-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_DQcnYl-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_NkLOTO-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_d37prp-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_MupMIU-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_TepjE2-150x100.JPG",
    "https://www.yamu.lk/uploads/dp/2015/08/bf9TdKPSlnqFHMaZrC.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_bsMfYL-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_W1T5QJ-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_E7lQIx-320x480.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_5XBYX7-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_T3chP5-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_hsVtDH-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_d37prp-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_SLqAhH-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_htl2BJ-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_yXlGAg-600x250.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/10/8111726824_3394e7f15c_z-588x250.jpeg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_T3chP5-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_hsVtDH-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_htl2BJ-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_pQTRAy-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}