{
  "name": "Kottu & Co",
  "address": "123-127 Vinyalankara Mawatha, Colombo 10",
  "open_until": null,
  "telephone": "777540048",
  "description": "A stall at Food Station that does kottu and iced milo all day.",
  "reviews": "Kottu & Co, serves, as the name implies kottu. And iced Milo, and cheese roti and other things Sri Lankans only have at night or in certain places. Right now it's just a stall in the Food Station (Maradana), but it's a good idea.\nKottu is a classic Sri Lankan food - flatbread (godamba roti) chopped together with veg and meat and cheese and whatever else you can imagine. It also has a tradition of only being served after dark. Because it makes you sleepy? Because it overcooks at noon? The vampire market? Who knows.\nThere are only a few places that serve kottu all day, like\nnow at ODEL, and now Kottu & Co. Let's try a few. Well, let's try two.\nThe beef palandi (Rs. 420) was quite interesting. Beef is a less common kottu meat (except on the east coast) and the palandi variant (with curd) is also unsual (you can\n). So I tried it.\nThis isn't a cheese kottu but it has a lot of the same creaminess plus a tartness from the curd. The beef is well cooked and not crazy tough and it has a decent amount of vegetation. This is a rich meal and I couldn't finish more than half. Even that left me feeling full for hours.\nThe chicken and cheese kottu (Rs. 430) is more of a classic. If you order a 'cheese kottu' at most places, this is what you get. What you get at Kottu & Co is a very cheesy kottu, that's the main impression. Dinul mentioned that the roti (flatbread) in both dishes tasted the same, and that in a classic kottu the chicken flavor would infuse the starch.\nThen we figured out the difference. It's that at Kottu & Co they don't include hodi (gravy). At other places they either pour chicken gravy over or serve it alongside, which of course infuses everything with chicken flavor. I think this is honestly a matter of taste. I personally don't add gravy when it's available as I find it overpowering. Perhaps it's something you prefer, just be aware.\nThey had something called a Dinosaur Milo (Rs. 230) on the menu which I just had to try. This is iced Milo plus two spoons of Milo powder on top. Apparently it's quite popular in Malaysia and Singapore (under the name\n).\nIt seems excessive, and it is, unless you compare it to a Godzilla Milo (this plus ice cream) which Kottu & Co says they'll be serving soon. How does it taste? Well, more Milo isn't a bad thing, and this is a lot of Milo. Near the end it becomes a gritty, sugary sludge which feels like it's definitely not good for you, but which definitely tastes good. It's an indulgence.\nThat plus the kottu honestly left me pretty comatose.\nKottu & Co is a stall inside the\n, a place that also serves Sri Lankan food, chicken wings, waffles, etc. It's off Dean's Road (past the ODEL roundabout) in a pretty cool space. It's two stories high, takarang roof and with a lot of seating.\nThe draw here is that you can get some small-scale creative food and drink options, and eat at most of them for less than Rs. 500 (if you want). Kottu & Co also serves shisha for Rs. 850 and it's the kind of place where school kids or whoever can hang out and chill for as long as they want.\nThe downside is that the street noise can get a bit loud and it's not AC'd, but besides that it's comfortable enough.\nWhat's cool about this concept is that you get people who love what they're doing but maybe can't open a full restaurant, like I suppose Kottu & Co.\nThe gentleman we interacted with was friendly, knew the menu (presumably his menu) and liked what he was doing. The kottus did take about 25 minutes to arrive though, which was a bit slow.\nFood Station is a great idea, and Kottu & Co is a pretty good place for kottu. It's rich, filling and indulgent, but if you're in the hood we'd give this place a recommend.\nA stall at Food Station that does kottu and iced milo all day.\n\nඔය පාරේ අයිනේ තියෙන කොත්තු කඩවල්වලට වඩා කොත්තු ඇන්ඩ් කෝපරේෂන් එකේ කොත්තුවල ගණන් හිලව් තරමක් වැඩි කියලත් කෙනෙක්ට හිතෙන්න පුළුවන්.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/kottu-co/review-196628",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_L1WcrZ-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_AHRgWX-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_RG7JkC-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_VYtHK2-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_xYWzSS-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_bc1xCC-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_Ll8bmO-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_14dNY7-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/07/uzI50We9CRr1yYpFEF.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_VYtHK2-320x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_bc1xCC-320x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_L1WcrZ-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_RG7JkC-360x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_Ll8bmO-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_XglW0a-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_Ptuiqe-600x250.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_L1WcrZ-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_AHRgWX-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_RG7JkC-360x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_VYtHK2-320x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}