{
  "name": "Krua Thai by Dao",
  "address": "618, Galle Rd Kollupitiya, Colombo 3",
  "open_until": " Open until 10:00 PM",
  "telephone": "0779603760",
  "description": "Krua Thai is a brand new street food joint at Galle Road. Although they claim they're a street food type place, they've got a nice seating area and whatnot. We loved it!",
  "reviews": "Krua Thai by Dao was founded by Ms. Dao after she decided to move here from Thailand. Her idea was to maintain a warm environment offering a range of foods from Thailand's street food culture. We liked the sound of this as soon as we heard about it and our experience here exceeded all expectations.\nTo start off, I got a Thai Set Menu with Steamed Rice (Rs. 600) This is a real deal here because you're getting a free bowl of soup as well.\nYou get to opt for either fried or steamed rice, but the fried rice costs extra and I'm poor so I had to settle for steamed instead.\nThis wasn't so bad because there's pretty much an explosion of flavour from all the other elements present. To get fried rice with it would have made it far too rich.\nThere was a portion of vegetables tossed and glazed with some distinctly tart yet sweet, saucy coating. A livelier version of the standard chop-suey that we've all come to love.\nA mildly spicy, milky gravy was present with two scarce bits of chicken. There were also a few wasabi coated peas so be prepared for an unexpected surprise. We wish there had been more chicken present on account of the abundance of rice piled high on that plate.\n\nThe soup was a small helping of classic Tom Yum Goong soup and came with an assortment of prawns, cuttlefish and chopped veg. I'd suggest you simply skip out on the rice and go for the soups because this feels like someone fired a lemongrass-y bullet down my throat and cleansed my nasal cavities of the 'flu and all other evils.\nBEWARE\n.\n\nWe got the Thai Veg Fried Rice (Rs. 600) and it was alright, honestly. Certainly very rich and a far more sophisicated rice in comparison with its local kadé cousin.\nIt's got flavour, it's got spice, and everything's on cue. I just don't know about the Rs. 600 price tag, although it's justifiable if you think about a normal packet of fried rice costing Rs. 400+ in any street shop.\nThe Chicken Pad Thai (Rs. 650) was a hasty, last-minute decision on my part because I realised I'd walk out of the place an utter fool if I only tried the rice dishes.\nI'm glad we ordered this. I can't believe we almost didn't. The noodles were oozing with stock and peanut sauce. There were large pieces of boiled, but extremely well marinated chicken.\nThe whole dish was just one, massive tease because every time you think you've had your fill, you bite into a piece of chicken and whoops you're chomping away again. Not good if you're on a diet.\nThe Sticky Mango Rice (Rs. 350) was what we waited with bated breath for. Every thought of each grain, coated with thick coconut milk was pushed far into the depths of my mind as I ploughed through the savoury dishes. Y'know, to keep myself from hyper-salivating.\nBut alas, when the dessert was delivered to our table it didn't exactly delight us. For one, the rice was a congealed gunk that you had to scrape at to get a decent spoonful. However, paired with the fresh mango and a short attention span it made us slightly happy. Could have been better, though.\n\nThe Thai Iced Tea (Rs. 200) was a full glass seeping with pure saccharine. There was a strong hit of tea which I liked, but it was far too sweet for my taste. I'm being biased here because I normally take very little to no sugar with my drinks.\nIt was a questionable, peach colour so there's a possibility that food colouring may have made a quiet appearance.\n\nThe minute you walk in you're hit with the familiar aroma of a very busy kitchen and little to no ventilation. The place is fairly small but with adequate seating. It's quite warm inside so the place wouldn't be a cool refuge on a hot day, unfortunately. Keep in mind that they're a street food joint, so it isn't fair to them to walk in expecting a 7 star ambience.\nThe fellow in charge of service is a bit unattentive although this is because he's very busy. This is excusable, but they certainly need more staff on hand because I can see this place blowing up and becoming a neighbourhood fave.\nNara Thai's finally got competition, but in a more affordable and tastier form. The lady manning the place is a real sweetheart so ask her for recommendations. They also have dumplings and they serve pork, so y'all have no excuse not to visit.\nKrua Thai by Dao is the closest Colombo has come to good, affordable Thai street food. We loved the place!\n\nඩාඕ මහත්මිය කෑම හදන මේ රෙස්ටෝරන්ට් එක තියෙන්නේ කොල්ලුපිටියේ.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/krua-thai/review-196342",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_fHXAlN-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_WePb0A-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_HHP4dq-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_qy8VIZ-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_CpTou6-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_DxdBjk-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_TaOAbE-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_Wd9il4-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_sXsJBr-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2017/01/sFOlV64o5GU2djDVqy.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_fHXAlN-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_WePb0A-640x458.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_HHP4dq-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_CpTou6-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_qy8VIZ-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_TaOAbE-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_DxdBjk-640x428.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_Wd9il4-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_mOENRl-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/02/yimg_O1b66I-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2018/06/8vWkh5taQ5CVDJgqpQ.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/user/2017/11/yimg_e8bbV2HXDoqDPn8Xqu-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2016/08/XeyiyT47QP0lwSxe3a.jpg",
    "https://www.yamu.lk/uploads/dp/2017/01/sFOlV64o5GU2djDVqy.jpg",
    "https://www.yamu.lk/uploads/dp/2017/01/sFOlV64o5GU2djDVqy.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_fHXAlN-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_WePb0A-640x458.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_HHP4dq-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_qy8VIZ-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}