{
  "name": "Kuuraku Colombo",
  "address": "48B Park Street Mews, Park Street, Colombo 2",
  "open_until": " Open until 11:00 PM",
  "telephone": "0112307600",
  "description": "Kuuraku is the latest addition to Colombo’s Japanese scene and easily one of the best restaurants that came out this year.",
  "reviews": "Kuuraku is the latest addition to Colombo’s Japanese scene and easily one of the best restaurants that came out this year. It may be a bit too early to pass judgement, but their great selection of contemporary Japanese cuisine, yakitori and sushi make it one to look out for.\nWe rarely open with the service since it’s quite often an afterthought, but Kuuraku impressed on multiple fronts. At the time of this writing we’ve been there around three times, and they’ve been impressive across the board. The waiters are friendly, attentive and trained well enough to identify dishes by their Japanese names. Service times can vary a bit with the crowd but they pace the dishes in sensible intervals. Also look out for their \"Irasshaimase!”  that’ll probably catch off guard you as soon as you set foot.\nThe thing that struck us as a bit odd was the fact that we had to ask for the wasabi, which is a something that’s usually served to the table. They also told us that they don’t offer ginger which is served almost everywhere else.\nThe ambience at Kuuraku is pretty straight forward with some artsy Japanese highlights in the form of Japanese door curtains, lampshades and an upstairs section which is for reservations only. Another thing we really appreciate here is that it’s BYOB. Kinita also insists I mention the fact that they have possibly the best-equipped ladies washroom at any restaurant in Colombo, complete mouthwash, sanitary pads, earbuds, toothpicks, and more.\nThe moment you mention Japanese food in Colombo, people immediately assume it’s all about raw fish, which is a real shame since their meat preparations can be bloody brilliant. So we were immediately excited when we heard about Kuuraku’s yakitori offerings. In a broad sense we can confidently say that Kuuraku does some of the best meat dishes among Colombo’s Japanese contemporaries. The prices of the yakitori, ranging between Rs. 300 - Rs. 650, won’t break the bank either.\nYakitori most often refers grilled chicken on skewers, but we (and by that I mean me) were thrilled to see that they had pork as well! The pork belly with garlic sauce (Rs. 400) was cooked well with a few fatty layers and a good balance of flavours from the garlic sauce which was at just the right intensity.\nWe decided to be a bit adventurous with chicken and try out the aortas (Rs. 350) and came away really impressed. The aorta itself was had a surprisingly welcoming, slightly chewy texture which worked brilliantly with the lightly sweetened glaze.\nWe also got their broiled pork belly (Rs. 980) from their specials, and while it sounds pretty mundane, the end result was just the opposite. The pork belly was served up as relatively thin slices, with a very thin fat layer and searing on the skin. The meat itself was moist and just melted in the mouth, with a great balance of seasoning. We only wish the portion was a bit more generous since it’s practically Rs. 1000.\nAfter starting off with the meats, we had high hopes for Kuuraku’s sushi and sashimi and they didn’t disappoint. Prices are a bit higher for their seafood, ranging between Rs. 700 - Rs. 1200 depending on whether you go for three or five pieces. We mostly stuck to their specialized sushi with the quintessential nigiri thrown in as well.\nBoth their tuna nigiri (Rs. 680 for 3) and their aburi salmon nigiri (Rs. 1080 for 5) were both very fresh with good execution in terms of presentation and knifemanship. The tuna had very little fat to it so the flavour was very clean with just a light kick from the wasabi at the end. The aburi salmon with its light outer searing also worked well, giving it both a bit of texture on the outside while still retaining the freshness.\nHowever, our favourite was the spicy tuna maki (Rs. 980 for 8) which is also probably one of their best value sushi. It had a bit of everything with a spicy tuna filling, fresh tuna garnish and crushed tempura on the outside to give it that extra crunch.\nThe only sushi we felt didn’t quite hit the mark, was the California roll (Rs. 980 for 5). This was made with crab stick instead of actual crab which didn’t quite measure up in terms of flavour. We also felt that some tobiko  would have helped improve the overall presentation and texture.\nAs far as first looks go, Kuuraku is pretty much as good as it gets. After three visits, we've come away with praise each time. The corkage-free BYOB option is also superb if you want to have a classy dinner and save some cash.\n",
  "yamu_rating": "We love this!",
  "url": "https://www.yamu.lk/place/kuuraku-colombo/review-132244",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_S0qBQF-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_ePwqhh-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_CEnOw3-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_B6PatA-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_UAalNf-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_WQQNr4-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_yKJglc-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_WyUHwL-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_RoUEg5-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_Vfnpp0-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_Vfnpp0-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_yKJglc-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_B6PatA-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_WyUHwL-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_CEnOw3-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_ePwqhh-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_UAalNf-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_S0qBQF-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_RoUEg5-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/02/yimg_wZHxyG-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/05/yimg_qKlg07-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2017/12/FiFPUuxeX5qjqmlM8U.jpg",
    "https://www.yamu.lk/uploads/dp/2017/12/FiFPUuxeX5qjqmlM8U.jpg",
    "https://www.yamu.lk/uploads/dp/2015/12/0F34X3pTfLr7btifJN.jpg",
    "https://www.yamu.lk/uploads/dp/2015/09/FhTnhSksTaaXWVTOkU.jpg",
    "https://www.yamu.lk/uploads/dp/2017/04/KE2F77hW9uoRt7RHja.jpg",
    "https://www.yamu.lk/uploads/dp/2017/04/KE2F77hW9uoRt7RHja.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_S0qBQF-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_ePwqhh-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_CEnOw3-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_B6PatA-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}