{
  "name": "Kyung Bok Kung",
  "address": "Juliana Hotel, 316 Galle Road, Kollupitiya, Colombo 3",
  "open_until": " Open until 11:00 PM",
  "telephone": "0115334222",
  "description": "Kyung Bok Kung at Hotel Juliana does a pretty authentic take on Korean cuisine. The setting might be slightly dubious, and the DIY style might not be for everyone, but order the right dishes and you'll be glad you dropped in.",
  "reviews": "Kyung Bok Kung at Hotel Juliana does a pretty authentic take on Korean cuisine. The setting might be slightly dubious, and the DIY style might not be for everyone, but order the right dishes and you'll be glad you dropped in.\nKorean cuisine is quite scarce here in Colombo, which is a shame since it has so many interesting elements to it. Kyung Bok Kung, along with\nare the only real Korean restaurants in Colombo (besides KBQ, which does fried chicken).\nKorean eating is best with a group, it's family style and you get to experience more variety that way. All the dishes come in one portion size which is usually enough for 2-3 people. Prices vary greatly depending on what you order with dishes priced between Rs. 800 - Rs. 2500.\nFor a casual visit Rs. 1500 per head should suffice.\nThe style here is that you can BBQ your own food on the table, there's a heating element provided. You order a meat and a bunch of sides and then combine.  A safe bet is the BBQ pork (Rs. 900 for 4 large slices), which comes with an array of sides - kimchi, bean curd, bean sprouts, cuttlefish, beef, Korean pancakes and of course the lettuce.\nYou can either let the waiter cook the meat for you (if you're not quite sure how you want it cooked) or you can opt to do it yourself. We opted for the latter, and it came out quite decently, specially when wrapped with the lettuce, bean curd, cuttlefish and kimchi.\nOne thing to note is that this particular dish can get quite messy. Trust me, it's not easy to get off pants.\nKorean restaurants are also known for their 'event' soups. Don't be fooled by the word soup though, the portion is huge and it's pretty much a meal. We tried the yukgaejang (Rs. 900), a spicy beef and vegetable soup. The main elements here are the beef, mushrooms and a plethora of vegetables along with soy sauce and  a good amount of chili. While we loved the kick of the chili, we felt that needed a bit more salt.\nAll in all we'd say this was a pretty good take on a yukgaejang.\nFinally we tried the dolsot bibimbap (Rs. 1000). If you want a simple meal in a bowl this is a good bet. It's like the elements of a very generous fried rice in separate portions.\nOurs came with carrots, daikon, bean sprouts, egg and diced beef, topped with a hefty layer of diced lettuce. As far as signature Korean dishes go, bibimbap is pretty much as iconic as it gets. While the overall presentation was on point, this did have one flaw that dragged the dish down. That being the diced beef, which was under-seasoned and diced too finely to really experience any texture. This is a shame since the other elements of the dish were just right.\nKyung Bok Kung is hidden away in Hotel Juliana. The Juliana has a reputation as, well, it's a nice hotel but some people might feel awkward going in there. In our experience, however, this seems to be where the Korean expats are at. Kyung Bok Kung is at the back of the hotel, through the lobby.\nThe restaurant itself is very simple in terms of ambience with wooden furniture and folding screens. It'ss well lit, clean and has it's own rustic charm with the customary BBQ in the center of each table\nThe service was actually very impressive and the local waiters were friendly and very helpful when we asked about certain dishes. One thing that this place really needs though, are napkins. Right now all they've got is paper serviettes which just don't cut it with all the kimchi in the dishes. It's also quite possible that I'm just a total clutz.\nIf you haven't had Korean cuisine yet, Kyong Bok Kung is a good place to give it a try. It can get a bit messy if you aren't careful, but it's definitely a unique experience.\nKyung Bok Kung at Hotel Juliana does a pretty authentic take on Korean cuisine. The setting might be slightly dubious, and the DIY style might not be for everyone, but order the right dishes and you'll be glad you dropped in.\nKyung Bok Kung is an absolute gem of a Korean restaurant hidden away behind the walls of the rather dubious Juliana Hotel in Colpetty. To enter the restaurant, one must first tread through the valley of Juliana's delightfully seedy lobby.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/kyung-bok-kung/review-37421",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2014/12/yimg_vrTPEP-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2014/12/yimg_Tpkbr3-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2014/12/yimg_2UArQZ-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2014/12/yimg_xbJd3d-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2014/12/yimg_QqXOnM-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2014/12/yimg_SNkbjo-150x100.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/01/DSCF1571-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/01/DSCF1562-2-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/01/DSCF1564-2-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/01/DSCF1570-2-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/01/DSCF1573-2-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/01/DSCF1574-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/01/DSCF1576-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/01/DSCF1578-150x105.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://www.yamu.lk/uploads/files/2014/12/yimg_xbJd3d-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2014/12/yimg_Tpkbr3-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2014/12/yimg_2UArQZ-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2014/12/yimg_vrTPEP-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2014/12/yimg_QqXOnM-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2014/12/yimg_SNkbjo-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_mH58pA-600x250.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/04/yimg_ANEokG-600x250.JPG",
    "https://www.yamu.lk/uploads/dp/2016/02/IJIBS4jxZQsZJFls0R.jpg",
    "https://www.yamu.lk/uploads/dp/2016/02/IJIBS4jxZQsZJFls0R.jpg",
    "https://www.yamu.lk/uploads/dp/2016/02/IJIBS4jxZQsZJFls0R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2014/12/yimg_vrTPEP-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2014/12/yimg_Tpkbr3-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2014/12/yimg_2UArQZ-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2014/12/yimg_xbJd3d-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}