{
  "name": "Le Papillon",
  "address": "No. 21A, Sir Ernest De Silva Mawatha, Colombo 7.",
  "open_until": " Open until 11:00 PM",
  "telephone": "0772020212",
  "description": "A multi cuisine restaurant serving some dope waffles and coffee.",
  "reviews": "Le Papillon is a boutique hotel located on Flower Road. Their restaurant is open to the public and you don't need to make any reservations beforehand. We dropped in on a quiet Tuesday and had a decent experience.\nTheir menu is extensive as it a multi-cuisine restaurant. They serve a range of entrees, soups, salads as well as waffles, sandwiches along with a separate section for their mains.\nWe started off with the Lentil Prawn Vadai (Rs. 500). We were expecting a\nwith a prawn filling but it wasn't quite that. They have made the vadai mixture into a batter, so the result was more a battered prawn than a vadai. It did taste good, but didn't satisfy our vadai craving. The large prawns were well cooked with the shells taken off. The salsa on the side was spicy and delicious, which was great.\nAs our main, we tried the Spicy Fried Rice (Rs. 950). As you can probably tell, this looks more like a nasi goreng than a fried rice but either way, it was quite decent. However, we didn't feel like it was worth the money as the overall dish was very oily, to the point where the rice had become sticky from it. It had a good amount of well-seasoned seafood bits as well.\nLet's talk about the Waffle with Blueberries and Butterscotch (Rs. 950). Oh man! It has been a while since I came across something that I devoured within minutes. This was so good! The waffle was fluffy in the middle and a little crispy around the edges. It had the perfect density that prevented it from getting soggy. They certainly did not skimp on the blueberries and the whipped cream. The butterscotch syrup made it sweeter than I would have liked, but overall, it was excellent.\nThe Caramel Tart (Rs. 650) was decent. It didn't have a biscuit base which was disappointing because it wouldn't be a tart without the pastry. The chocolate was decadent and very chocolatey with a sticky caramel mixture. It wasn't overwhelmingly sweet which was good, but the lack of a biscuit base made the whole thing pretty bland.\nTheir drinks menu includes coffee, hot chocolate, tea, fresh juices, mocktails and soft drinks. They do not serve alcohol yet, but we were told they soon plan to.\nVishvi and I are pretty obvious when it comes to our love of coffee, so of course, that's what we got. The Hazelnut Cappuccino (Rs. 300) was delicious. The hazelnut flavor, while being strong, did not overpower the coffee taste. The lush texture of the cappuccino was a clear sign of a good milk to coffee ratio.\nThe Cafe Mocha (Rs. 375) too was excellent. You can certainly have it without sugar because the chocolatey taste will easily compensate that. Just like the cappuccino, the texture was on point with a mild coffee aroma of a great mocha.\nThe staff was friendly and well-mannered. There were few people dining around the time we went, but our food served within 15-20 minutes which was good.\nThe hotel is basically a house flipped into a hotel which is why it gives a very homey and peaceful atmosphere. The dining area inside is very beautiful with shades of brown running through from the walls to the furniture. It's very spacious, cozy and air-conditioned.\nThey also have a living room vibe area with couches and comfy chairs for you to sit and enjoy an evening cuppa while getting your work done. The modern house decors and the furniture really bring out the homey feeling, which we really appreciated.\nIn all honesty, this is more of a 3.5-star rating because, while the ambience and the coffee stood out, most of the dishes we tried could improve considering the price range and the establishment. Either way, it's a great spot to enjoy some good coffee and mouthwatering waffles.\nA multi-cuisine restaurant with a hidden talent for waffles.\n\nඇත්තට ම දවල්ටත් වඩා මේ තැන හැන්දෑවට වගේ හුඟක් ලස්සන ඇති කියලයි අපට හිතුණේ. මොකද හරි “හෝමි” වාතාවරණයක් මෙතැනදී දැකගන්න පුළුවන්නේ.\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/le-papillon/review-215846",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_2HXDfH-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_7vw2GE-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_4E9mWE-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_UiLtVZ-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_mYbXrT-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_IepNCU-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_Pf7sZn-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_xWWRXf-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_G7XUp6-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_cYMHzg-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_i79aKv-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_gxZ1pM-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2017/05/8ASFnC1F2g6DeTqofz.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_mYbXrT-1024x593.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_2HXDfH-1024x720.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_7vw2GE-1024x776.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_Pf7sZn-1024x576.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_4E9mWE-1024x576.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_gxZ1pM-1024x768.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_xWWRXf-1024x576.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_cYMHzg-1024x576.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_mOENRl-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/02/yimg_O1b66I-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2018/03/6a9EqpA65HjsShlfj1.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_2HXDfH-640x450.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_7vw2GE-640x485.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_4E9mWE-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_UiLtVZ-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}