{
  "name": "Life Food",
  "address": "14, Reid Avenue, Colombo 07",
  "open_until": " Open 8.00 AM - 8.00 PM",
  "telephone": "0117221351",
  "description": "Life Food is a low key health food stall that manages to keep things healthy and fresh while not compromising on flavour.",
  "reviews": "Life Food is a salad and juice counter at The Good Market shop in Lakpahana. We tried out their stuff and came away quite impressed.\nOver the past month we covered a lot of the\nin Colombo, but Life Food managed to slip under our radar. We finally got around to trying out their stuff, and it's safe to say their salads are comparable to some of the best we've had in Colombo.\nAt first glance life juice is a small health food counter, but they actually offer a pretty varied menu with a whole lot of salads and juices to choose from. They aren't really cheap at around Rs. 500 per salad, but all the vegetables and fruits are fresh, organic and responsibly sourced.\nThe Japanese salad (Rs. 500) is a fresh garden salad with iceberg lettuce, red lettuce, brocolli, carrots and red radish, to name a few. What makes it Japanese is the carrot, sesame and ginger dressing infused with miso. This one is really fresh with a good mix of flavours and textures from all the different veges with the dressing adding slightly tangy undertone. It's also got a good hit of umami (savory).\nFor a contrast, we also tried the strawberry salad (Rs. 500) - strawberries, lettuce, avocado, cucumber, feta cheese and caramelized cashews, served with a subtly sweet strawberry dressing. This salad was an intrigue blend, it was fresh and sweet with the feta cheese adding a bit of saltiness. What we loved the most was the caramelized cashews. This added bursts of sweetness as well as a nice crunch.\nFor drinks we tried the mango booster (Rs. 280) and the extinguisher (Rs. 280). The former of which is a mix of mango, passion fruit and ginger. I had this along with the strawberry salad and the two went together quite well. From what we tasted there was no added sugar with the sweetness coming from the mangos.\nThe extinguisher is a mix of mint leaves, passion fruit and cinnamon powder. This one definitely tasted really healthy, which is to say that it isn't really sweet at all. That being said you can pretty much taste every single element and if you're looking for something that is actually good for you, this would definitely fit the bill.\nLife Food is at\nin Lakpahana, neighboring another one of our favourites,\n. It's a charming little space with a patio along the side of the shop with chairs and tables so it's a bit like a outdoor cafe space.\nThe service wasn't very fast but the stuff we got tasted great and Lakapahana makes for pleasant location to just chill while the food comes to the table.\nLife Food maybe quite low key, but their salads and drinks are excellent. They manage to keep things healthy and fresh while not compromising on flavour.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/life-food/review-42535",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_9grfou-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_j9qwXT-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_WQo0yI-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_O6cJiZ-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_SuEkPV-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_xhXWJ1-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_96Cwxy-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_MOxOzD-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_xhXWJ1-543x768.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_j9qwXT-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_9grfou-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_WQo0yI-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_O6cJiZ-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_mOENRl-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_jbPlMM-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_9grfou-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_j9qwXT-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_WQo0yI-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_O6cJiZ-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}