{
  "name": "Lobby Bistro (The Kingsbury Luxury Serviced Apartments at Platinum 1)",
  "address": "Platinum 1, 1, Bagatalle Road, Colombo 03",
  "open_until": null,
  "telephone": "94765561111",
  "description": "The bar at the Kingsbury's luxury serviced apartments in Colombo 03. Available for short stays or long term rent.",
  "reviews": "You must have noticed the sleek, glossy, black monolith over the fancy Mango, Body Shop, and Charles & Keith shops on Galle Road. That's the Platinum1 building, a serviced luxury apartment complex under the Kingsbury's management. You can rent properties there either on a nightly basis or long term rentals. We'll keep you posted on the rooms and service in the near future. In this review, we'll focus on the happy hour (5-7 PM everyday) at their main dining/drinks spot, the Lobby Bistro.\nThe bar is on the fourth floor, a bit of a pity since the building goes way higher than that, and a rooftop bar would be a much better utilization of the space. As it stands, the restaurant/bar is surrounded by a lot of construction, which kills the view.\nThe outer area features a pool and a few tables, which are nice enough. The section inside looks like your typical hotel bar, featuring comfy large armchairs, open glass windows, and a bar area. There are a few dodgy busts painted gold around which we liked for their kitsch value.\nThe crowd consisted solely of men; one other table of generically starey post-office guys, and a tourist family of very, very loud and splashy boys in the pool. It wasn't exactly obtrusive - just not the chill sunset scene we were hoping for.\nThe beverage menu reflects that of Sky Lounge a lot, both in terms of variety and price. They do, however, have a lot of Mabroc tea cocktails, which we liked.\nThe two tea cocktails we opted for were the Kingsbury Rum & Tea Crush, and the Kingsbury Iced Tea Mojito, both at Rs. 1200++ each. We also tried a Kings Basil Gimlet at Rs. 950. We could barely discern the taste difference between the two tea cocktails, with the crush ever so slightly sweeter. They looked the same too, in uninspiring water tumblers with only the mint leaves to provide any aesthetic variation. They were good, albeit cloudy cocktails, with a light amount of local rum and a good mix of tea. Was it worth some Rs.1500 each? Probably not - but it was worth it at about Rs.600 on happy hour.\nThe gimlet was boozy and limey. That's honestly all you need to know about it. A gimlet is also defined as:\nɡɪmlɪt/\n: a small T-shaped tool with a screw tip for boring holes.\nGiven the whacks of alcohol and lime this drink proffered, the boring holes definition still stands true. Plus, the Rs 470 odd we paid thanks to the discount was totally justified by the sheer amount of gin in this.\nFor our nibbles, we opted for a little snack of lightly-battered Chicken Chili Fry (Rs.650). It was meant to come with a side of rice, which we thought was strange for a bar menu's tapas option, so we asked for it to be switched to good old fries instead. Complete with\nand fries, this dish was pretty great, with well flavoured and succulent chicken.\nWe wanted to try more stuff off their tapas menu, but most of it wasn't available at the time that we visited.\nOverall, the service was very friendly and enthusiastic. However, there were some glitches in efficiency. The waitstaff definitely did not know their way around the menu, and didn't know what to recommend or suggest. Drinks and food came out quickly enough though, and they were very polite.\nWe're always fans of\n, so we'd recommend you head up here for a quick beer if you're done shopping at one of the nice shops below, or your office is right around the area. We think the ambience and drinks could have been excellent with better vision and direction, but they're just alright as of now. Our discounted happy hour bill for 3 drinks and a snack came to Rs.3028 after service charge, VAT, and NBT.\n",
  "yamu_rating": "\n                                \n                            ",
  "url": "https://www.yamu.lk/place/lobby-bistro-platinum1-kingsbury-luxury-apartments/review-160764",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/02/yimg_j9vwkr-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/02/yimg_4JDffC-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/02/yimg_DyPSBZ-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/02/yimg_phmDiF-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/02/yimg_9Ex8cT-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/02/yimg_EJ05nT-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/02/yimg_9kBTg3-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/02/yimg_gqOvvV-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/02/yimg_69ampe-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2017/04/KE2F77hW9uoRt7RHja.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/02/yimg_j9vwkr-320x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/02/yimg_9Ex8cT-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/02/yimg_phmDiF-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/02/yimg_69ampe-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/02/yimg_DyPSBZ-320x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/02/yimg_EJ05nT-320x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/02/yimg_9kBTg3-320x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/02/yimg_gqOvvV-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/02/yimg_4JDffC-320x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/01/yimg_mGk61d-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_L4Ylap-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/02/yimg_j9vwkr-320x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/02/yimg_4JDffC-320x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/02/yimg_DyPSBZ-320x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/02/yimg_phmDiF-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}