{
  "name": "London Grill  (Cinnamon Grand)",
  "address": "Cinnamon Grand, 77 Galle Rd, Colombo 3",
  "open_until": null,
  "telephone": "112497379",
  "description": "A first class fine dining experience. Perfect for when you want to pull out all the stops and celebrate. Primarily a steakhouse.",
  "reviews": "Colombo's fine dining options are limited and sometimes condescending. The London Grill, however, has managed to maintain its steak, standards and clientele for years on end now. The menu and plate presentation could do with an update, but our experience was wonderful apart from that.\nI've always seen the London Grill as the gold standard for good steak in Colombo. However, they do also have a pretty formidable seafood selection ranging from oysters to lobster. While you can't go wrong with the classics, the choices are ever so slightly dated - lobster thermidor, steak with mashed potato, surf and turf, gravy sauce on everything. The normal fare you'd see at a high-end steakhouse.\nThey brought out a complimentary amuse bouche, a delicate sliver of dragon fruit with appeared to be pancetta bits on top. It was a tiny but interesting start to the meal for me, especially since I love cured meat.\nWe decided to skip the starter course and go straight for our mains. If you are keen on a starter, I'd recommend the crab ravioli (Rs. 1200). I would have liked some fresh oysters, but unfortunately, their oysters come gratinated. For our mains we opted for an Organic Sous Vide Pork and a Surf & Turf Angus Fillet.\nAt Rs. 1450++, the pork is one of the cheapest options on the menu, but by no means the worst. A local, totally organic section of pork belly and pork loin came surrounded by some mashed potato, walnuts, and asparagus. Lightly seared and full of flavour, this dish was superb, although the loin was slightly dry.\nMy Surf & Turf was priced at the restaurant's average, around Rs. 3700++. The Angus fillet of beef was prepared medium rare, just as I asked for it, which is a rare occurrence in Colombo's dining. The meat itself was succulent and lightly flavoured, drizzled in a delicious thick jus. The accompanying two king prawns, two over-roasted baby potatoes, two pieces of broccoli and two pieces of cauliflower seemed like an oddly stingy recreation of Noah's Ark. Apart from the potatoes, they were all well-prepared but just looked stark in terms of quantity and presentation. I still thoroughly enjoyed my meal, but that was predominantly thanks to the excellent steak.\nThe wine list here is extensive and well-curated. While there are plenty of nice Continental bottles ranging upto Rs. 25,000-30,000, there are a couple of reasonable options at about Rs. 5,000 or so. We opted for a palatable light French rosé from the Loire Valley, a Rosé d'Anjou.\nThey also have the usual cocktail collection, along with a few interesting dessert and coffee liqueur options. I chose a Mexican Coffee at Rs. 890 in lieu of dessert, a delightful confection of Kahlua, espresso, and Tia Maria (an fun substitution for the usual tequila), topped with a delicious generous blob of cream. They assembled it at my table, which made for some great tableside flair.\nYou'll encounter some of the best service in the city here. Every waiter and the maître d' we came into contact with was polite, efficient, and knew their way around the menu. One of our orders was mixed up, but without a murmur or argument, the staff apologized profusely and brought us the correct dish within 10 minutes. Overall, they're very dedicated but seemed stretched thin as the restaurant got more crowded.\nI'd also informed them that it was my partner's birthday when I made my reservation, and the staff went out of their way to make us feel special. They set us up with a lovely table, and at the end of our meal the pianist started tinkling Happy Birthday and they brought out a little cake complete with candles and a personal message. The entire thing wasn't loud or obtrusive, but warm and classy.\nThis feels like an upscale English pub, with open brick walls, dull gilded crests, wooden awnings, and dim lighting sometimes punctuated by the sudden flare of a flambé. The piano music is a selection of pop classics ranging from Foreigner to Ed Sheeran, which I found hilarious because we were expecting Tchaikovsky or something gently pretentious. It's a charming dining experience, with tables for couples as well as larger groups. Just be warned that you might get a bit chilly if you're in a slinky dress.\nWe'd highly recommend Cinnamon's London Grill to anyone looking for a consistently classy dinner. Good food, great service, and the perfect setting for a special occasion, especially if you're into old school classics like steak, good wine, and a piano man. Just be prepared to shell out a minimum of about Rs. 8000 for two without wine, or around Rs. 15,000 for two with wine.\nOne of the best fine dining options in Colombo.\nA first class fine dining experience. Perfect for when you want to pull out all the stops and celebrate. Primarily a steakhouse.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/london-grill/review-189002",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_3MZ8hz-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_Q6sMfd-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_e5BjqH-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_dytbIf-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_sG1diy-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_aCgR00-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_6Di6RK-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_55K6BP-150x100.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/02/Interior2-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/02/IMG_0770-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/02/Breast-of-duck-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/02/Eggs-Benedict-with-smoked-salmon-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/02/Sirloin-steak-150x105.jpg",
    "https://www.yamu.lk/uploads/dp/2017/04/KE2F77hW9uoRt7RHja.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_dytbIf-640x372.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_e5BjqH-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_sG1diy-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_Q6sMfd-640x371.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_55K6BP-338x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_6Di6RK-640x361.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_3MZ8hz-640x372.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/06/yimg_QQpjsV-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/07/yimg_X5AI4H-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_3MZ8hz-640x372.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_Q6sMfd-640x371.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_e5BjqH-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/07/yimg_dytbIf-640x372.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}