{
  "name": "Lords (Negombo)",
  "address": "80,\nPoruthota Road,\nNegombo",
  "open_until": " Open until 11:00 AM",
  "telephone": "0772853190",
  "description": "One of Negombo's long term dining institutions.",
  "reviews": "Lords has been named Trip Advisor's top spot in Negombo for years now, with good reason.\nSo the main gripe we hear about Lords is that the prices are pretty steep by Lankan standards. You're looking at about Rs. 1,500 per meal, but after actually eating there we thought it was justified.  We tried the Prawns, Spinach, and Coconut Creme Curry. It was a full meal served with tomato curry, beetroot and coconut pickle, coconut sambol, mixed fried rice, and papadams. The absolute best part, more than the quantity or the presentation, was just how dang creamy that curry was. It even smelled smooth.\nI liked the thali-style presentation. The meal managed to prance along the fine line between Sri Lankan spicing and Western palatability, which impressed me. There was an abundance of fresh Negombo prawns that had been delicately simmered in the rich curry, and the mixed rice was well done. The pickles and side sambols were fine, but I didn't really pay them much attention as they were overshadowed by the lovely prawn/spinach/coconut curry. I'm not sure who realised that those three would make a good combination, but they were right.\nIt was afternoon, so a beer seemed appropriate. A nice, chilled small Lion at Rs. 350. Not much to say about it except that it was welcomed with glee in the Negombo heat. I did also notice that bottles of wine were pretty reasonable, like you could get a basic Chilean Sauvignon Blanc for under Rs. 3000.\nFor a place with a crickety moniker, the place is blissfully free of tacky cricketing references or paraphenelia. Instead, there's a lot of local art on sale, both figurative and abstract, in various mediums. There are also a lot of water features and aquatic life, like a mini waterfall as you enter, a big fish pond as the central feature of the dining area, and the fish foot spa within the complex.\nOh right, it's also actually called the Lords\n, because the place is surprisingly massive once you actually start exploring it. There's a whole bunch of different sections and areas, although unfortunately no accommodation which is a pity since it's such a busy touristy area. Lunch is usually served in the first pond area, but the back areas open up after about 5 PM for drinks and food.\nWe liked the place because it employed a lot of natural light and ventilation, and the water features give everything a fresh feel even in the scorching mid-day sun.\nApart from the great food and location right in the heart of Negombo's popular beach strip, Lords' service is spectacular. I was welcomed at the gate, asked how my day was, ushered in to a seat I liked, and fussed over by two efficient waiters. They helped me choose my dish, made recommendations, and checked that everything was fine. They also discreetly asked if I needed a refill or anything added to my meal, waiting till I paused reading so as to not disturb me.\nWe know Lords is a popular spot, and we see why. It's good food (albeit a bit pricey by beach standards), and great service. They also have a live band or DJ on popular nights, which tends to draw a good crowd. We'd recommend it.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/lords-negombo/review-77173",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_cTy67U-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_R9h43y-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_9b4eNl-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_GpZAWD-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_A9KXHi-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_NT7koq-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_R6vKiZ-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_UWPxBs-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_dPrL0l-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_3ICObM-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_Q3bVvY-150x100.JPG",
    "https://www.yamu.lk/uploads/dp/2017/04/KE2F77hW9uoRt7RHja.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_cTy67U-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_3ICObM-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_Q3bVvY-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_dPrL0l-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oKIYgP-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_mOENRl-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_cTy67U-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_R9h43y-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_9b4eNl-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_GpZAWD-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}