{
  "name": "Lounge 171",
  "address": "171, Old Kottawa Road, Nawinna, Maharagama",
  "open_until": " Open until 10:00 PM",
  "telephone": "0711965892",
  "description": "Lounge 171 is the coffee house of the popular One Seven One Restaurant at Maharagama. They've got great food, good coffee and the nicest ambience.",
  "reviews": "171 Restaurant is a popular spot for anyone living in Maharagama, not only for its family dining but also for the rooftop parties. Now they have expanded their brand and opened up a new coffee lounge in the building right next to it, called Lounge 171. Both these buildings can be found on Old Kottawa Road.\nLounge 171 serves up a range of burgers, wraps, submarines, and pizza. As for drinks, they’ve got coffee, tea, milkshakes, and mocktails.\nWe started with the Ham, Cheese and Egg Submarine (Rs. 550), which was simply amazing! It was a delicious and juicy submarine with three cheese slices, two chicken ham slices, a fried egg, crunchy lettuce, plum tomatoes, and onions. It was very filling, for obvious reasons. Just looking at it fills you up.\nThe buttery-sweet flavored bun that holds all these together was soft with a rich texture. The chicken ham was well cooked with a hint of crispiness. The vegetables were fresh and delicious with the cheese elevating all the flavors.\nThe potato wedges at had the ideal amount of seasoning. It was crispy on the outside, soft on the inside. The coleslaw had the same freshness in its veggies and combined with the mustard sauce, it complimented the main dish adequately. The entire meal was absolutely enjoyable. We highly recommend it.\nAs we had the option, we went for a half and half pizza: a Diavola pizza and a Spicy Chicken Devilled pizza (Rs.1200 and Rs.1150 respectively for full pizzas). Both of the pizzas were incredibly cheesy and had a succulent thin crust that gave a satisfying crunch.\nTopped with spicy salami and hot chili peppers, the Diavola pizza had an abundance of spiciness to it which we loved and there was a thick generous layer of mozzarella. According to the menu, it is supposed to have buffalo mozzarella, but clearly, it was the same mozzarella that was used in the other half of the pizza.\nIf you’re a fan of classic Sri Lankan devilled chicken curry, you’ve got to try this spicy chicken devilled pizza. The devilishly hot, chewy bits of chicken were dispersed evenly throughout the pizza, and each bite had a deep, spicy and a slightly sour feel on the tongue that complimented the green chilis and the tomato slices.\nBe mindful that while they are generous with the cheese, unless you finish the pizza within 30 minutes, the cheese dries up and starts to get crumbly.\nAs for dessert, we opted for their Belgium Coffee Chocolate Tart (Rs.300), which we absolutely loved! It consisted of three layers - a decadent dark chocolate base, a light coffee infused layer of chocolate in the middle, topped with another layer of buttery chocolate. This is indeed a worthy purchase if you’re a chocolate lover.\nThe Cappucino (Rs.350) was quite good with its strong coffee flavor which was diluted by its the foamy texture. It was served in a massive cup with a nice caramel art on top, and the milk to coffee ratio was well-balanced. They use Lavazza beans in their coffee.\nThe Hot chocolate (Rs.280) on the other hand, was quite the steal. A strong chocolatey aroma came through this while balancing the milkiness and the sweetness to its perfection.\nThe ambiance is very quiet and cozy with wooden tables and leather seatings. They also have bean bag chairs as well as a Marshall sound system which is very cool as it allows you to plug your phone and listen to your favorite beats while sipping on a cuppa. The orangy bricked walls decorated with frames give the place a vintage vibe which goes well with the ambiance of the place.\nIn terms of the service, it was very uninviting at first as the staff did not seem at all interested in serving us, to the point where we had to walk over to the counter and ask for the menu. Nonetheless, it gradually got better and it was clear that they had a thorough understanding of the menu as well as what is available and what is not.\nAll in all, we think it is a great spot for those who live in the area or anyone passing by. Step in after a tiring day of work and wind up with a cup of coffee and a delicious meal, you can end your day much happier.\nNewest coffee lounge in Maharagama serving a range of pizzas and filling, cheesy submarines.\n\nමහරගම පැත්තේ පදිංචි වෙලා ඉන්න අයට මේක සෑහෙන්න සුබ ආරංචියක් වෙයි කියලා අපි හිතනවා.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/lounge-171/review-209003",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/12/yimg_Gs2yF1-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/12/yimg_OoWGgz-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/12/yimg_2AT5Fg-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/12/yimg_QywnM3-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/12/yimg_iUCsSl-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/12/yimg_91lQKZ-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/12/yimg_Kr3Jw5-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/12/yimg_2enbC3-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/12/yimg_W8rNrV-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2017/05/8ASFnC1F2g6DeTqofz.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/12/yimg_OoWGgz-1024x657.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/12/yimg_2AT5Fg-1024x576.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/12/yimg_91lQKZ-1024x576.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/12/yimg_Gs2yF1-1024x576.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/12/yimg_Kr3Jw5-1024x576.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/12/yimg_QywnM3-1024x576.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/12/yimg_iUCsSl-1024x588.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oKIYgP-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_mOENRl-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/12/yimg_Gs2yF1-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/12/yimg_OoWGgz-640x411.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/12/yimg_2AT5Fg-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/12/yimg_QywnM3-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}