{
  "name": "McDonald's (Welisara)",
  "address": "595/1, Negombo Road, Welisara",
  "open_until": " Open until 12:00 AM",
  "telephone": "0115555555",
  "description": "There's a McDonald's outside of Colombo as well.",
  "reviews": "Just in case people didn't know *looks at Indi*, there IS a McDonald's outlet in Wattala. Welisara, to be precise, but that's just a nuance. Although I'm not sure exactly when it opened, I know it's been around for at least a decade, coz I remember going there for ice cream back when they had the chocolate flavour, and when the chocolate dip wasn't practically double the price of the non-dipped.\nWe went for breakfast. McDonald's is McDonald's, so you get slightly sweet bread which makes up for tiny burgers that disappear in two or three bites. We picked the\nmeal, the local version of Maccies, with caramelised onion sambol wrapped in a fried egg, which is sandwiched inside the bun. Along with the\nburger, the meal also includes black coffee and a hash brown. We also tried the hotcakes (which is just a fancy name for pancakes), milk tea, and an apple pie.\nSweet, onion-y and on point, the\nwas typical of the kind you find in roast\n. The pancakes were fluffy but a tad heavy. I thought they could have been kept on the stove a bit longer because they looked too pale. They were not under-cooked, but didn't have that golden, toasty colour either. It was more like a very light tan.\nThe hash brown was a chunky, deep-fried slice of cholesterol, but it was crispy, light and tasty nonetheless. Well, as tasty as processed potatoes can be.\nTea was a cup of (presumably fresh) hot milk, with a tea bag to dunk into it. This wasn't that great because the tea was too milky and one bag didn't really cut it. But they gave us two more bags when we asked. That was really nice of them, and the tea was sufficiently strong after that.\nThe coffee, on the other hand, was well brewed. It was steaming hot, with a strong aroma. The cup says they use their own brand of Arabica beans, so I presume it isn't Harischandra.\nMoving onto the apple pie, this was a piping hot pocket of sweetness — crisp and flaky on the outside, moist and cinnamon-y on the inside.\nIn terms of service, the staff are really friendly and helpful. They are also all-smiles, which you don't see in too many places around here. It's always nice to have a friendly person behind the counter.\nThis McDonald's outlet has had a recent face lift, and looks much better on the inside. The interior is quite hip with a funky wall of typography and an assortment of weirdly matched chairs. It's a fun place to hang out, which gets quite crowded in the evenings but is deserted in the morning hours.\nMcDonald's isn't anywhere close to the healthiest place for breakfast, but if you want a quick bite, hot coffee, and friendly service in Welisara, then this is the place for you.\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/mcdonalds-5/review-53721",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_LNI0Ho-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_ddsg8z-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_sUnjCw-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_rMCSOA-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_VVMN1Q-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_7uSKCO-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_tFyKkw-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_5yMbnb-150x100.JPG",
    "https://www.yamu.lk/uploads/dp/2015/08/bf9TdKPSlnqFHMaZrC.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_rMCSOA-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_VVMN1Q-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_5yMbnb-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_ddsg8z-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://www.yamu.lk/wp-content/uploads/2014/03/DSCF7791-588x250.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/09/photo-588x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_LNI0Ho-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_ddsg8z-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_sUnjCw-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_rMCSOA-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}