{
  "name": "Mintage Restaurant & Pub",
  "address": "154, Kynsey Road, Colombo 08.",
  "open_until": " Open 11 AM–11 PM ",
  "telephone": "112680171",
  "description": "A chilled out place in the heart of Colombo for a nibble and drink after work with friends, which doesn't require you to dress up or shell out serious dough.",
  "reviews": "Mintage has been around for little over two years now, and has since become a popular watering hole among Colombo's working crowd. We like Mintage — they serve up some pretty good Sri Lankan Chinese along with cheap booze. That's a classic combo.\nThese days Mintage is known mostly for its bar, but their restaurant serves up some classic Sri Lankan Chinese dishes, and they do it quite well for the most part. Their menu is on par with most other contemporary Sri Lankan Chinese restaurants in terms of variety. Most of it is priced very reasonably, so if you're not drinking too much, you can manage at Rs. 1,000 per head.\nIt's pretty straight forward as far as booze goes 'cause Mintage doesn't offer any cocktails. You can simply grab your alcohol of choice along with some chasers and make a night of it. The good thing, however, is that the booze is quite cheap so you can grab a bottle of Old Arrack for around Rs. 1,600. The no cocktails part is a bit of a bummer, but Mintage still remains one of the most affordable taverns in Colombo.\nGetting back to the food, we started out with some onion rings (Rs. 399), which weren't too shabby at all. We got a pretty decent portion considering the price. It was on point in terms of texture and flavour, with a crispy golden-brown batter that was well-seasoned and not too thick.\nTheir yang chow fried rice (Rs. 889 for a large portion) was okay. It's basically a mixed fried rice with nothing to really set it apart from the usual fare. On a positive note, it did have quite a bit of meat in there so I wouldn't say we were unhappy.\nTheir stir fried belly pork (Rs. 730 for a large) was a pleasant surprise with plenty of flavour. Though it was a stir fry\nthe dish itself had quite a thick consistency due to the sauce as opposed to the oilier preparations you find elsewhere\nwith the flavour of soy and oyster sauce coming through distinctly. The pork itself was cooked well, cut into relatively thin slices with a good portion of fat.\nIt was definitely on the saltier end of the spectrum, but it was balanced out by the less intensely seasoned rice.\nThe best of the dishes we tried, however, was their HBC (Rs. 889 for a large). As classic as it gets in terms of preparation, it featured a crisp, well-seasoned batter, spring onions and dried chillies. We find a lot of new places tend to put a spin on the HBC recipe to make it their own. While that adds more variety, we always appreciate a classic HBC, which is exactly what Mintage's version was.\nThe atmosphere at Mintage is pretty simple and casual with the restaurant on the ground floor and the bar upstairs. The bar area is considerably smaller than the restaurant but they've managed to make the most of the space with a few enclosed booths that small groups can reserve.\nOn the day Friday we dropped in, however, the bar was filled to capacty, which made it quite claustrophobic. They were cool with us having our drinks in the restaurant area along with our dinner.\nService was actually quite fast, with the food arriving in 15 minutes or thereabouts. That's quite impressive considering the crowds. The waiters were friendly and casual, although their attentiveness understandably dipped when the numbers increased.\nIt's pretty tough to find restaurants or bars in Colombo that strike a balance between pleasant ambience, fast service and affordability. But Mintage offers just that, along with cheap booze and tasty Sri Lankanized Chinese fare.\nMintage has been around for little over two years now, and has since become a popular watering hole among Colombo's working crowd. We like Mintage — they serve up some pretty good Sri Lankan Chinese along with cheap booze.\nA nice, chill place for a nibble and drink after work with friends, and doesn't require you to dress up or shell out.\n\nඔයත් කෑම ගන්න ගමන් ඉඳලා හිටලා ෂොට් එකක් දාන්න කැමති කෙනෙක්ද? එහෙනම් මින්ටේජ් එක තමයි ඔයාට හරි යන පොට් එක. දවස පුරා ම සැර බීම ජාති හරි අඩු මිලකට  මෙතැනින් ගන්න පුළුවන්. කෑමවලට වුණත් මේකේ යන වියදම සෑහෙන්න සාධාරණයි. ඒ නිසා බඩ කට පුරවගන්න පුළුවන් හිතේ හැටියට.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/mintage-restaurant-pub/review-54566",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_bJ3uFX-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_gl8t6j-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_EoZN31-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_CaKYrI-150x100.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/06/DSCF8680-150x105.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_Wxr3Ln-150x100.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/06/DSCF8693-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/06/DSCF8694-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/06/DSCF8699-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/06/DSCF8701-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/06/DSCF8703-150x105.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_T7MyiM-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_jYmD3P-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_3J8qcP-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_ljVe4L-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_VL9Uyx-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_J9yQQN-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_R3X86x-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_XZzdK3-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_wDpzgH-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_lxtXV0-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_jYmD3P-318x480.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_gl8t6j-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_Wxr3Ln-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_T7MyiM-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_bJ3uFX-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_CaKYrI-640x425.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/06/DSCF8699-600x398.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_zFF92D-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_GtXgMC-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_bJ3uFX-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_gl8t6j-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_EoZN31-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_CaKYrI-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}