{
  "name": "Mirissa Beach Wadiya",
  "address": "Udupila Junction, Mirissa",
  "open_until": " Open until 10:00 PM",
  "telephone": "0779506074",
  "description": "So Mirissa's got their own Beach Wadiya (though not associated with Colombo's Wadiya). They offer a decent variety of seafood with an emphasis on the day's catch. The execution, however, was inconsistent.",
  "reviews": "Mirissa's got their own Beach Wadiya (though not associated with Colombo's Wadiya). They offer a decent variety of seafood with an emphasis on the day's catch. The execution, however, is inconsistent.\nMirissa's beach stretch is jam-packed with beachside restaurants, most of them focusing on seafood. Mirissa Beach Wadiya very much keeps to type.\nTheir menu is pretty generic when it comes to the selection of seafood, but unlike other places where you order to the table, Wadiya's dishes come bundled with fries and a bit of salad. Prices are in the mid-to-high range, with dishes generally priced around Rs. 700 to Rs. 1,000, but that's no surprise at a tourist hotspot like Mirissa. Besides the seafood, they offer a few chicken dishes, but we think having beef and pork would have added more variety.\nThe prawn fried rice (Rs. 600) was pretty average overall. The usual Sri Lankan Chinese preparation was what they were going for but it fell short due to the lack of seasoning. The portion wasn't the biggest either. We managed to share it between two but we had stuffed our faces at\na few hours before. So we wouldn't say this is enough for two hungry people. The one positive, however, was that there was a good amount of prawns. A bit more salt would have really brought out their flavour.\nThe crispy fried chicken (Rs. 700) was the only non-seafood item that we got. Once again, for the price, we got just two pieces of batter-fried chicken. It came with fries and salad, but what we really wanted here was more chicken. For what it was worth, the fries and salad were quite nice, with a good crunch and freshness. The chicken was on point in terms of texture with a crispy batter and soft, well-cooked meat in the centre. But alas, this dish was also crying out for salt and a perhaps a bit of spice.\nThey did, however, nail the hot butter calamari (Rs. 700). This was prepared as thick, batter-fried calamari in a sweet and sour sauce, quite different from what we usually come across in Colombo. If we had to recommend what to get here, it would be just this dish. It had what all the other dishes lacked—a balance of flavours and the right amount of seasoning—plus a touch of sweet and spice from the sauce.\nAfter the waiter showed us the day's fresh tuna (Rs. 700), we were quite hopeful. But they somehow managed to almost completely ruin it by grilling it to the point where the meat was just chalky and dry as the desert. It came with a garlic sauce that helped a bit in terms of flavour but we just didn't want to take more than a few bites, since the texture was just so unpleasant.\nJust like the food, Mirissa Beach Wadiya does little by way of ambience to set itself apart from the rest of the beachside eateries. They've got dining both inside as well as on the beach but there wasn't anything really distinct that caught our eye. They're really relying on the beach to do all the work.\nService was the only area where we had no complaints whatsoever. The waiter who served us was very polite, friendly and genuinely enthusiastic. We saw him scurrying about urging the cooks to have our food ready ASAP, which isn't something you see often.\nAll in all, Mirissa Beach Wadiya doesn't come close to its likely unrelated\nin Colombo. With high prices and mediocre food, we can't really recommend it. A short walk along the beach to\nwould be far more worthwhile.\n",
  "yamu_rating": "We don’t like it",
  "url": "https://www.yamu.lk/place/mirissa-beach-wadiya/review-56708",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_yXlGAg-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_xtJ7Sc-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_hq6R64-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_xFLhyF-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_S7I2QQ-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_uTUBun-150x100.JPG",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_uTUBun-640x425.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_S7I2QQ-640x472.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_xFLhyF-640x437.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_xtJ7Sc-640x452.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_hq6R64-640x484.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_yXlGAg-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oKIYgP-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_zFF92D-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_yXlGAg-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_xtJ7Sc-640x452.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_hq6R64-640x484.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_xFLhyF-640x437.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}