{
  "name": "MOMO",
  "address": "No 11, Negombo Road, Wattala",
  "open_until": " Open until 11:00 PM",
  "telephone": "0112934688",
  "description": "MoMo's has an extensive menu ranging from naans to lasagna to seafood and pastas. It has a nice, comfy interior, and is a vibrant space for families.",
  "reviews": "MOMO's is a new restaurant where the (now old) Negombo Road begins. However, it's a welcome new addition to the locality and adds a lot of vibe and color to the area. They opened up just over a week ago, and the food on their Facebook page looks pretty fab, so we went to check them out over the weekend.\nMOMO has an appetizing menu  with separate breakfast, lunch and dinner options, some which are also 'all day' menus. Soon after we were seated, the staff greeted us and asked us if we'd like a welcome drink (it wasn't on the house) and offered us a choice of homemade ginger beer or homemade lime and mint. We went for the ginger beer which was quite strong and tangy, and thankfully tasted less of soda and had more of an authentic ginger. It was quite a pleasant drink, to say the least.\nThe staff are extremely friendly and pleasant. They'd come and check up on you every few minutes, and during our first five minutes there, apologized that the food would take a little while to prepare. The manager made sure to ask if we were taken good care of, and our server was also very attentive.\nOur food\narrived in about 20 minutes, which isn't too bad.\nThe\nserved in a pot, came with a side of raita, gravy, and eggplant moju. The chicken in the biryani was great - it was soft, succulent, and you know that it's been marinated just right. The spices blended in nicely, and this was the highlight of the dish. There was quite a lot of spices within the dish, but they weren't overpowering.\nOnce you add the raita in, the biryani balances nicely. On the downside though (yes, there\na downside), the food wasn't piping hot, it was just mildly warm. We think it would have been wayyy better if it was at least semi-hot.\nThe mutton lasagna, though small, was a cheesy, gooey, slab of goodness.\nThe minced meat was literally dripping off the edges, and the layer of cheese on top was thick and lovely. The combo blended well with each other, and even though you know you're going to put on about ten kilos and get cholesterol by the time you're done with it, it was just too good to stop. We were also really hungry and this was the first thing to come, so yeah. Oh, this wasn't that hot either, it was mildly warm... so maybe it's something to do with the way they prepare their dishes.\nWith the hot hot kochchi beef (that's its legit name) I expected to eat fire and cry my eyes out, but we were severely disappointed in this end. It was neither hot (no surprises there now, is it) nor spicy. I think it tasted a lot similar to a beef chopsuey dish. The beef was also very rubbery and a bit difficult to eat as it took a concentrated effort to chew through it.\nMOMO's has a cheery, well-lit, and bright interior. There are partitions made out of the cross section of bamboo canes, and it's pretty cool. There's also an open kitchen and a live fish market (spoiler alert, the fish are dead).\nBut it's still really nice to see something like this in Wattala, and it's a new concept for that area. The place has a lot of business and customers keep coming in, so that's nice as well. The side of the restaurant which faces the main road is of glass, so people passing by outside can see you on the inside. This was a slightly uncomfortable thought at first, but you get over it pretty fast. The restaurant is on a higher elevation than the road, so you're not on eye-level with those passing by and it's not that awkward.\nThe seating arrangements are comfortable, and it's not congested though all space had been utilized for tables and chairs.  The space isn't a large one, but it's well lit and well arranged, so the overall ambience is pleasant and chilled out.\nMOMO's is a nice place to take your family out to dinner with, or even hang out with a bunch of friends. The service is exceptional, but the food we sampled wasn't as great as I expected it to be. They're just over a week old, so I guess they're still sorting things out. This will hopefully improve with time.\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/momo/review-53482",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_d4gI6Y-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_uTPU09-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_9FxDSS-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_5pfGdJ-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_ionBBk-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_zFQ8KO-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_FMGQcd-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_uasGlG-150x100.JPG",
    "https://www.yamu.lk/uploads/dp/2015/08/bf9TdKPSlnqFHMaZrC.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_ionBBk-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_zFQ8KO-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_5pfGdJ-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_uTPU09-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_d4gI6Y-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_9FxDSS-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_XglW0a-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_DKK32n-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_d4gI6Y-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_uTPU09-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_9FxDSS-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_5pfGdJ-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}