{
  "name": "Monsoon",
  "address": "50/2 Park Street, Colombo 2",
  "open_until": " Open until 11:00 PM",
  "telephone": "0112302449",
  "description": "Excellent South-East Asian cuisine in a beautiful and buzzing location.",
  "reviews": "Monsoon serves amazing South-East Asian food in a beautiful location at the end of Park Street Mews. You should go.\nAs a Sri Lankan I like punchy spices, a lot of flavor and rice or noodles. Hence, a top-class restaurant that serves Indonesian, Malaysian, Singaporean, Thai and Vietnamese fills a good niche here. People like those cuisines generally, and Monsoon does them very well.\nLet's start with the Hainese Chicken (Rs. 950). Despite its Chinese name, it's an immigrant dish, the national dish of Singapore.\nI'll just mention three ingredients.\nThose are the basics of the dish and they were executed perfectly. The accompanying sides and sauces were just icing on the cake.\nAlso, take this, the Crispy Hoisin BBQ Ribs (Rs. 1,300). Perhaps you can't see cause the fancy (and inept) soft focus, but there's a thick, sweet glaze covering the perfectly cooked meat. The meat flakes easily off the bone and, slathering it with the sauce, it's a perfectly balanced delight.\nRibs are normally hard to eat in polite company, but the pork here just falls off the bone with a touch of the fork. We ordered two.\nAlso, Duck Salad (Rs. 750). Duck is popping up on menus all over Colombo, usually sweetened into oblivion. Here it is served charred and balanced with acidity from pomelo (fancy grapefruit) and given sweetness from roasted beetroot and sweet basil chili. Duck is such a rich meat that it can easily throw a preparation off balance, but done right it's mouth magic.\nThis is just a Rs. 300 side, but the long beans are also perfectly cooked in a rich and tart coconut milk sauce. This stuff is all hitting the sweet spot of my sub-continental palate.\nAs you can perhaps see, we ordered a lot of different things and shared. This is also a fun way to eat, no?\nHere is the Pork Belly (Rs. 1,300), which just melts in your mouth, given form and crunchy by the fresh onions.\nHere also is the Beef Rendang, an Indonesian classic. I had a bad experience with some unrelated beef earlier that day and didn't really try this. My dinnermates said it was good.\nThis is the worst photo for one of the better dishes, my apologies. This is the Golden Fragrant Prawns (Rs 1,200). I seem to have got the basil in focus which is the least interesting part.\nFragrant refers to smell, but smell and taste are intimately connected. The experience here is that you get the sweet softness of prawn immediately, then a late hit of smokey spice. I'm a sucker for food that changes in your mouth, and this is a good example.\nNormally in this section we just comment that the people were nice enough, but that doesn't really matter if you're hungry. The\nof good service is generally speed, and we were surprised at how fast dishes came out.\nAt Monsoon, the dishes started coming out within 10-15 minutes from our order. They come out as they're made (not all at once) but that's part of the experience. It was nice to be able to try so many different things and not be stuck with whatever appetizer/main combo each person orders, with only a furtive nibble of something better. The experience is similar to ordering shared plates at\n.\nThe other thing is that our bill ended up being way less than expected. We paid about 2k per head, though two people didn't eat much. I'd say you can be happy with 3k each, which is a steal given Colombo restaurant prices these days.\nNote that they don't have a liquor license, so bring your own wine, or spirits or whatever you like. There's no corkage, or at least we weren't charged any.\nOne thing I'll add is that pork, vegetarian and nuts are clearly marked on the menu. This is a life-saver for me (I have a peanut allergy) and great if you're trying to keep halal or vegetarian. Note that I don't know if everything is certified halal, but I think marking pork dishes is enough for most diners.\nHere is where my photos really fail you. I didn't even try to photograph the whole interior because the place was buzzing and I felt embarrassed standing up in the middle of it. Let me try and paint a picture with words.\nPark Street Mews is already one of the most beautiful locations in Colombo with exposed brick walls and large spaces, originally meant for horses I assume. Monsoon doesn't change their hall too dramatically, besides tiling one wall. Instead, the design goes vertical with plants hanging from the ceiling and some see-thru bookshelves.\nThe effect draws your perception up, making the space feel expansive.\nThe rest of the effect is in the furniture - mixed marble for the tables - and comfy rattan for the chairs. There's also a bar in the middle and a couch in the center. Though the restaurant is packed you still have some distance from other diners, so you can have an honest conversation. The height of the space mixes all conversation into a pleasant buzz.\nMonsoon also has a key feature that many locations lack. People. When we went the place was full, and full of conversation, forming that low level human vibration that makes dining out exciting. There were people coming in and out, busy waiters, the place is alive. It's a good scene.\nMonsoon is great. It's competitive in quality with Colombo's fine dining restaurants, but it's quite unpretentious food. The inspiration is South-East Asian street food (which everybody loves), taken that extra 10% with plating and ambience.\nPark Street Mews is already the most buzzing, walkable place in Colombo and Monsoon is the ideal capstone. When you're there you feel like you're in the middle of a vibrant, cosmopolitan city, where you can have a nice meal and stumble out onto a street full of interesting places and people.\nThe final thing is that it's not crazy expensive. So I don't know what to tell you. Just go.\n",
  "yamu_rating": "We love this!",
  "url": "https://www.yamu.lk/place/monsoon/review-203264",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_aljszj-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_M1Z5BT-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_ycgz6y-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_IwKMWr-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_OYKPFM-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_WxNO0S-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_Sr8UIe-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_9WMcLm-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_tybdOK-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_7oKtWt-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/07/uzI50We9CRr1yYpFEF.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_OYKPFM-319x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_IwKMWr-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_tybdOK-319x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_ycgz6y-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_Sr8UIe-319x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_9WMcLm-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_M1Z5BT-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_7oKtWt-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_WxNO0S-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_aljszj-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oKIYgP-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_THqciZ-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/user/2017/12/yimg_fnpcQVwUAHWkCoexss-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/user/2017/12/yimg_NGpNDWUQJtnwxUJp1P-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/user/2017/12/yimg_q02bxc3IhOns0xdzm7-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/user/2017/12/yimg_qLVNJZYDAGiHIAI32X-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/user/2017/12/yimg_gRSgNyxDeCZAmrrv7c-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_aljszj-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_M1Z5BT-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_ycgz6y-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_IwKMWr-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}