{
  "name": "Moon River",
  "address": "140, Thimbirigasyaya Road,  Colombo 05,",
  "open_until": " Open 11.00 AM-3.00 PM & 6.00PM -11.00 pm",
  "telephone": "0112596882",
  "description": "Besides one dish, Moon River gave us nothing to be happy about. We honestly cannot recommend it with all the new alternatives in Colombo.",
  "reviews": "Moon River is a member of the old guard of Chinese restaurants in Colombo is always full. While large crowds usually means good food, that wasn't the case for us. The food here is mediocre and the service for locals is not good.\nLately we've seen a a deterioration in quality among older Chinese restaurants, and it seems Moon River is no exception.\nFor the carb base of our meal, we tried the deep fried Shanghai noodles with seafood (Rs. 998 for S). While the noodles are deep fried, it's a wet dish, which we hoped would  be a nice contrast. It wasn't. The fried noodles just ended up soggy and the whole thing ended up like a tasteless soup. While there were plenty of prawns and calamari in the noodles, the dish was under-seasoned and bland.\nThe hot butter cuttlefish (Rs. 698 for S) wasn't too impressive either. While the texture of the batter and the cuttlefish were fine, this too lacked the seasoning and that kick of chilli that really helps the overall flavour of a good HBC. There were dried chillies in this one but just sprinkled over the top which doesn't really bind to anything.\nThe salt and pepper chicken (Rs. 598 for S) was okay, but nothing to write home about. It's very simple preparation with lightly batter fried chicken cubes, tossed in salt and pepper, served with diced tomatoes and onions. After the bland noodles and HBC we were just glad to finally taste some salt and pepper.\nAfter our recent feature on where to get\n, we got a recommendation for the village style pork (Rs. 998) at Moon River. We gave it a shot and it turned out to be quite nice indeed. It's mostly pork belly prepared like a stir fry with a good amount of soy. The downside here is that it's equal parts pork to green beans and green chillies. The beans and chilli are nearly indistinguishable from each other, making the dish a bit of a minefield. Just keep a cup of water handy.\nPrice-wise, they're not too bad. Small dishes are priced at around Rs. 550 and large is around Rs. 850. The only issue is that not all the dishes are available in small and large, with the more specialized ones available only in a single portion size, which seems to be too much for two and too little for four. One good thing is their menu has images for every single dish, albeit only vaguely accurate.\nService at Moon River left much to be desired. They have both local and Chinese waiters with each catering to their respective clientele. While the Chinese waiters seemed so nice to the Chinese customers, the local waiters were dismissive at best. Before coming to our table the waiter gave us a look that pretty much translated to \"why are you even here?\", perhaps because we dropped in at the end of the lunch service. While the food came to the table fast, the poor customer service left a bad impression.\nWe don't think they've done any real improvements to the interior since the place first opened up. They've also stuffed as many tables as humanly possible in here, so be prepared to hear the entire conversation the folks at the neighboring tables are having. You'll also most likely be flailing your arms around quite a bit to keep the flies off the food.\nBesides that one pork dish, Moon River gave us nothing to be happy about, which leads us to wonder how they have such large crowds. We honestly cannot recommend it with all the new\nalternatives in Colombo.\nBesides one dish, Moon River gave us nothing to be happy about. We honestly cannot recommend it with all the new alternatives in Colombo.\nBesides one dish, Moon River gave us nothing to be happy about. We honestly cannot recommend it with all the new alternatives in Colombo.\n\nඒක වෙලාවකට හිතෙනවා කොළඹ කොච්චර චීන අවන්හල් තියෙනවද කියලා. වායුසමීකරණය කරන ලද වාඩිවෙලා ආහාර ගන්න පුළුවන් අවන්හල් ගණන් කරලා බැලුවොත් චීන අවන්හල් තමයි අනිත් ඒවාට වඩා වැඩි වෙන්නේ. ශ්‍රී ලාංකික අවන්හල් වලටත් වඩා චීන අවන්හල් තියේවි. මම හරියාකාර සංගණනයක් කරලා නැහැ. ඒත් අඩුම තරමේ චීන අවන්හල් 100ක්වත් කොළඹ නගරයේ ඇති.හොට් බටර් කට්ල්ෆිෂ් පිඟන් මිලියනයක් කාලා බැලුවට පස්සෙවත් හිතෙන්නේ නැද්ද ඇයි ඔබ වෙනස් තැනකට නොයන්නේ කියලා? අපිට තායි අවන්හල් තව ටිකක් තිබුණොත් කොහොමද? කියුබන් අවන්හල් කොහොමද? මයන්මාර් නැත්නම් සෙනෙගාල් අවන්හල් කොහොමට ඇද්ද? ඒත් කොළඹ ජනගහනයෙන් විශාල කොටසකට චීන අහාර තමයි හුරුපුරුදු.\n",
  "yamu_rating": "We don’t like it",
  "url": "https://www.yamu.lk/place/moon-river/review-41973",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_RxDG3l-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_Dx7GJF-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_AqnbYE-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_50ogYs-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_W4HrqJ-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_CTojmH-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_50ogYs-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_AqnbYE-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_Dx7GJF-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_RxDG3l-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_CTojmH-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_W4HrqJ-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/04/yimg_wJVf8O-600x250.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oKIYgP-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2017/04/dLA6pW8SpcKi851aKb.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_RxDG3l-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_Dx7GJF-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_AqnbYE-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_50ogYs-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}