{
  "name": "Mount Grill",
  "address": "21, Galle Road, Mount Lavinia",
  "open_until": " Open 11.00 AM - 11.00 PM",
  "telephone": "0112722558",
  "description": "Mount Grill is an old restaurant in Mount Lavinia that serves a lot of Sri Lankan favorites. The place looks pretty run down now, but the food is actually quite good, especially some of their meat dishes.",
  "reviews": "Mount Grill is an old restaurant in Mount Lavinia with a lot of Sri Lankan favorites. The place looks pretty run down now, but the food is actually quite good, especially some of their meat dishes.\nLiving in Mt. Lavinia I drive past Mount Grill nearly everyday, but never really got around to actually having a meal there since it isn't the most visually appealing spot. That said, I was happy to see that they have a menu with basically everything that Sri Lankans like eat - from HBC to Nasi Goreng to Noodles. It's obviously not the most sophisticated selection, but judging from by the crowd during lunch, I'd say it's working for them. While the portions aren't massive like at some Sri Lankan Chinese restaurants, the small portions are plenty for two so you can easily manage for under Rs. 1000 per head.\nThe mixed fried rice (Rs. 420) was probably the least impressive of the dishes we tried. It's honestly not terrible, but it's basically the same fried rice you'll get at mostly any Sri Lankan Chinese restaurant. This one comes with the trifecta of chicken, beef and pork but the pieces were quite small.\nTheir Hot Butter Cuttlefish (Rs. 500) is one of the most straight forward renditions you'll find, and it's quite good. Unlike most other places, Mount Grill uses cuttlefish rings which I actually prefer since it's easier to eat. There was also an odd sweetness to this one that I liked, but that one can go either way depending on personal preference. One thing this HBC did not have was chili, which I really didn't mind as a change from the norm.\nTheir pork baduma (Rs. 370) was interesting dish, but it's certainly not for everyone, especially if you're watching your cholesterol. As the name suggests, it's basically like a Sri Lankan baduma, only this one comes with pork. Flavourwise it was fine with a bit of heat and a good balance of seasoning. The onions were a welcome addition here as well providing a contrast in textures. The problem with this dish was the fact that the pork itself was almost entirely fat. Combine that with an already oily dish, and you've got a dish that'll make your heart cry.\nOur favourite dish, however, was the cripsy deep fried beef (Rs. 370), which sounds incredibly plain but turned out be really tasty. This was quite simply crumb fried beef with some mayo drizzled over it, but for some reason it had so much flavour and texture. Just goes to show how good a dish can taste purely through proper seasoning.\nAs far as ambience goes, it's unlikely that Mount Grill will impress. The location itself is quite accessible, but the interior can be best described as \"rustic\". They've got a little garden area at the back which does add a bit of colour to the otherwise glum interior. I actually didn't mind most it, but what I did mind was the cushionless metal seats which were just plain uncomfortable.\nWe had no complaints when it came to the service, which was both friendly and fast. The only minor issue was that the waiters would stand near the entrance so getting their attention at times was tough.\nMount Grill's offerings are far from the best around, but hell, I went the next day just to get that beef. What I'm trying to say is that if you're hungry, but don't want to spend more than Rs. 1000, then MG will likely make you happy.\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/mount-grill/review-49655",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_OPPFAb-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_VwVaJa-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_dA4xL7-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_o3XHiz-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_44WYPG-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_lFiU8A-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_d8js1z-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_VwVaJa-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_o3XHiz-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_d8js1z-318x480.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_OPPFAb-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_44WYPG-640x480.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_dA4xL7-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/11/yimg_tabxl7-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/04/yimg_p3U7z2-600x250.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_OPPFAb-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_VwVaJa-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_dA4xL7-640x480.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_o3XHiz-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}