{
  "name": "Mr Burger",
  "address": "It's right next to the bike shop at Galle Road.",
  "open_until": " Open until 11:00 PM",
  "telephone": "112585050",
  "description": "Mr Burger is a new burger joint down Bambalapitiya. Most of their burgers are so-so, but we love their Quarter Pounder.",
  "reviews": "Mr Burger down Galle Road is a new, almost invisible burger joint that has a small range of burgers and an even smaller seating space. They make up for this by dishing out some decent burgers which you can rely on for the occassional guilty pleasure.\nAll their burgers come with a minuscule side of fries. They've also got other dishes like nuggets, chicken wings, shawarma and hotdogs but their specialties are the burgers so we didn't stray.\nWe got a Cordon Bleu burger (Rs. 430) and it wasn't that good. The patty was wayyyyyyy too small (you can't even see it on account of the amount of sauce it was doused in), and it just wasn't satisfactory.\nThat being said, what we could taste of the chicken indicated that there was indeed a puny bit of cheese and what seemed like the remnants of a slice of chicken ham all packed into the fillet. Safe to say their picture is a bit misleading and I recommend you don't get this one.\nTheir menu didn't have any vegetarian options on it but they assured us that it just wasn't printed is all.\nThe Veggie Burger (Rs. 260) comes with a soft, well cooked vegetable patty. I could taste a hint of chickpea and potato which is what I'm assuming the burger is made of. It's not the best burger in town but it isn't the worst either. I strongly suggest you stick to the meaty stuff.\nBeef burgers are all fun and games until someone decides to be careless and either overcooks the bloody thing leaving us with a rubbery, flattened tyre of a patty. Not good.\nI've enjoyed beef burgers from Royal Burger, Burger's King, not to mention Rocket Burger and even McDonald's. I'm proud to announce that I've finally found myself a brilliant beef burger here in the city.\nThe Quarter Pounder (Rs. 490) is their culinary pièce de résistance so to speak on account of its two, tender patties that basically melt in your mouth. The burger also comes with two slices of processed (packaged) cheese, but that's fine because there's nothing wrong with the burger. It's actually really, really good.\nMy only qualm with this is the amount of sauce and perhaps you ought to ask them to go easy on the sauce if you're not a fan of excessive condiments.\nFor drinks we got a Lime Juice (Rs. 100) and an Iced Milo (Rs. 180). The lime juice tasted extremely artificial, like the Tang instant-mix packets. It wasn't bad, it just isn't real. Which can be bad.\nThe Milo was an instant hit. It's a tad too sweet, but survivably so. It's also very chocolatey which we liked.\nService is good, but a little slow. Our burgers took about 15-20 minutes to be served which is questionable because there's not much to do. The servers are friendly and attentive.\nThe place is extremely small, with just a small counter-top style table for seating. It does have an outdoor area though, but it's best utilised at night once the intense Galle Road traffic has died down.\nHonestly I wouldn't ask you to drive out of your way to dine here. Their burgers are a step up from the generic franchises you'll find in the area, but you can still get better burgers at Burger's King (now renamed Fazly's).\nIf you do go, try the Quarter Pounder.\nMr Burger is Galle Road's new burger spot. The quarter pounder is great, the rest is alright.\n\nඔන්න ඉතින් අඩු ගාණට, ඒත් වැඩිම රසට බර්ගර් ඕනේ නම් යන්න පුළුවන් තවත් තැනක් තමයි මේ.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/mr-burger/review-197776",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_Lz2ncJ-150x100.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_xMfINP-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_GdaJne-150x100.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_hf4jQV-150x100.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_AC1oOk-150x100.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_HxChxA-150x100.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_TWjA4B-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2017/01/sFOlV64o5GU2djDVqy.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_hf4jQV-640x372.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_AC1oOk-640x453.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_GdaJne-640x434.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_Lz2ncJ-640x402.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_HxChxA-640x401.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_TWjA4B-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_xMfINP-640x431.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/12/yimg_GdoPPK-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/01/yimg_lFKc6Y-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2017/01/sFOlV64o5GU2djDVqy.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_Lz2ncJ-640x402.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_xMfINP-640x431.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_GdaJne-640x434.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_hf4jQV-640x372.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}