{
  "name": "My Burger",
  "address": "No. 244, High Level Road, Nugegoda",
  "open_until": " Open until 10:30 PM",
  "telephone": "0113081071",
  "description": "One of the oldest burger spots in Nugegoda serving burgers and cheese kottu.",
  "reviews": "Anyone who lives in Nugegoda knows about My Burger. Before\n, if I ever needed Cheese Kottu, this was my go-to place. Buddika has done a review almost a year ago and we finally got around to it too. It's conveniently located on High Level Road, right opposite the Glitz, pretty hard to miss.\nAside from the burgers, they have all your favorite fast food items like submarines, wraps, cheese kottu and even rice.\nSince Buddika had raved about this one, we tried the Double Crispy Chicken Burger (Rs. 450). Their standards have certainly gone down in terms of presentation because this did not look very appealing. Even the chicken pieces have gotten significantly smaller. It was still delicious and very filling but as you can see, they have used only one burger bun, as opposed to two. The one thing I appreciated was how everything held so well together which made it really easy to dig in.\nWe also tried the Veggie Burger (Rs. 200). Although it might not look good in the picture, it was definitely worth the price. The thick patty with lettuce on top, along with mayo and cheese, made up for a filling and tasty burger. You cannot expect more for that price but we would have preferred if they had slightly grilled the bun because it was a tad bit crumbly.\nThe Cheese Chicken Kottu (Rs. 450) was definitely the clear winner here. It was a massive plate of kottu soaked in milk and dripping with cheese. The roast chicken was slathered with a sweet chili sauce which added the perfect balance of sweetness to the kottu. The chicken itself was well roasted with a slight juicy texture on the inside. We highly recommend this.\nIn terms of beverages, they have homemade iced coffee and iced milo aside from the soft drinks.\nWe got the Iced Milo (Rs. 150) which turned out to be way too sweet. It had a thick texture but the flavors were overpowered by the amount of sugar in it. For a sweet tooth, I guess this would be a treat, but it certainly was not for me. I only took a few sips to quench my thirst after eating the food.\nTheir service was efficient and friendly. Our food arrived in less than 10 minutes. Though we were the only ones to dine-in, they did have a few takeaway orders going on as well as, so it was impressive how fast our food was served.\nThe ambience kind of explained why most people preferred take-out. It's a small area with wooden benches and a couple of tables; quite congested. The most annoying thing was the flies. There were so many flying around that one actually landed on our drink. They were nice enough to replace us with a new one and immediately got rid of the rest of the flies, but there was no way we could enjoy our food after that. It wasn't easy to take pictures as well, cause I was constantly waving off the flies in one hand. I would not recommend you dine-in, definitely order-in or get take-out.\nIt's a great place for some delicious kottu but the burgers are pretty average. You can call them up for delivery or have take-out, avoid dine-in.\nA burger joint, but the kottu's better.\n\nඇසි පිය හෙළන නියාවෙන්, හැඳි ගෑරුප්පු අතට ගත්ත දේශානි කොත්තුවට වග කියන්න පටන් ගත්තා. මමත් නිකං හිටියෙ නෑ. එහෙන් මෙහෙන් අත දාලා කොත්තු කෑල්ලක්, චිකන් කෑල්ලක් අරන් රහ බැලුවා. ෂහ්, පංකාදු පහයි ඈ.\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/my-burger/review-212827",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_vNM75n-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_PPoD7N-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_qTKaap-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_SaqsJF-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_Ej0eX4-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DKTOQY-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_AOYRXS-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_w1Gyg5-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/02/yimg_2cI3Oa-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/02/yimg_wKIXBP-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/02/yimg_UpKHr8-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2017/05/8ASFnC1F2g6DeTqofz.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/02/yimg_wKIXBP-1024x768.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/02/yimg_UpKHr8-1024x801.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/02/yimg_2cI3Oa-1024x768.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DKTOQY-512x768.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_w1Gyg5-512x768.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/02/yimg_88LCB4-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_mmMlXX-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_vNM75n-640x384.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_PPoD7N-640x312.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_qTKaap-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_SaqsJF-640x464.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}