{
  "name": "Mythi's",
  "address": "9, Station Road, Colombo 4",
  "open_until": null,
  "telephone": "0112596814",
  "description": "Mythi's is a small streetside restaurant on Fife Road that offers arguably the best black pork curry in Colombo, along with a killer rice and curry.",
  "reviews": "Mythi's used to be a small spot down Fife Road, and now it's an even smaller spot right opposite the KFC at Majestic City. The venue has changed, but has the food? We investigated.\nThe new Mythi's has just one little table that seats 4 and a glass counter with all their curries. There's a mysterious kitchen area that you can't see, but you just have to believe in. Service is generally just one person behind the counter, and it doesn't take more than a minute or two to get served, pay, and be on your way.\nNobody really comes here to dine in, so you probably should just get take out. Just be warned that they use a lot of packaging (plastic lunch sheet, paper box, numerous plastic bags), so if you plan on being a regular maybe just bring your own lunch box.\nThe star of the show at Mythi's has always been their black pork curry. You can always opt for just their curries at varying prices, pork at Rs. 190, chicken and fish at Rs. 110, vegetable at Rs. 40, which is what we did. The meat itself varies from little boneless bits to little fatty bits (which I know irk many, but I personally love), all soft and perfectly marinated. I didn't come across any chewy, tough, or gristly bits, which was great, and the flavour was excellent too with the usual goraka and even some very mild hints of tamarind coming through. I'd definitely say it's comparable to some of Colombo's most popular BPCs, like the one at the\n.\nYou can choose from a rice and curry, with either red or white rice, and a choice of chicken (Rs. 240), vegetable (Rs. 160), fish (Rs. 240), or pork (Rs. 320). Any of your choices come with an array of sides and curries, which in our case consisted of parippu, pol sambol, beans, kekiri, papadam, dried chillies and a little piece of karawala. In the past they've also had stuff like gotukola malung and jackfruit curry, so you'll just have to turn up and see what's on the menu for the day. Every component of our fish rice and curry was well prepared, albeit with enough rice to feed 3 people and not enough curry to soak through all of it.\nThey also have \"specials\" like Fried Rice and Nasi Goreng, but we don't really recommend it. We tried the Chicken Fried Rice (Rs. 280) which came with a piece of sweet chilli fried chicken, chilli paste, and an omelette. There wasn't really any vegetable or curry, so this was a bit dry and underwhelming.\nIf you're into black pork curry and don't have the cash or enthusiasm to dine at the\n, Mythi's is a good substitute (just don't expect the same ambience obviously). It's a good spot for your lunch break take away rice and curry, at a super central location.\nThe new Mythi's doesn't have a lot of seating, but they do have plenty of great curries!\nMythi's is a small streetside restaurant on Fife Road that offers arguably the best black pork curry in Colombo, along with a killer rice and curry.\nAt Mythis you can always find get a good serving of pork curry- arguably the best local meat curry. For Rs. 260 you get a generous helping of pork, a good splash of the day’s vegetable curries- dhal, beetroot, okra, breadfruit, a papadam and some sambols on a typical day.  It’s a good meal for the price and - by the standards of buth kades - Mythis is clean and well ventilated.\n\nහොඳම දේශීය මස් කරියැයි තර්ක කළහැකි ඌරු මස් කරියක් හැමවිටම ඔබට 'මිතිස්' වෙතින් ලබා ගත හැකිය. සාමාන්‍ය දවසකදී ඔබට රු. 260ක මිළකට  හොඳ මස් පංගුවක් සහ පරිප්පු, බීට්රූට්, බණ්ඩක්කා, දෙල් වැනි දවසේ එළවළු ව්‍යංජන, පපඩම් හා පොල් සබ්‍ම්බලක් සමග හොඳ බත් පිඟානක් කෑ හැකිය. එය මිළට හා බත් කඩ ප්‍රමිතියට අනුව හොඳ ආහාර වේලකි. 'මිතිස්' පිරිසිදු, හොඳින් වාතාශ්‍රය ඇති තැනකි.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/mythis/review-181088",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_5upggX-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/06/yimg_S8a2aY-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/06/yimg_e48yhg-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/06/yimg_oh2HrR-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/06/yimg_qhhyrQ-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/06/yimg_1ytB5h-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_hxpAz7-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_mgdCZj-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/06/yimg_WkMZqJ-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2017/04/KE2F77hW9uoRt7RHja.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/06/yimg_WkMZqJ-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/06/yimg_e48yhg-640x389.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/06/yimg_oh2HrR-640x373.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/06/yimg_qhhyrQ-640x405.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/11/yimg_Zxwp7X-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_KNwFTs-600x250.JPG",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://www.yamu.lk/uploads/dp/2017/04/KE2F77hW9uoRt7RHja.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_5upggX-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/06/yimg_S8a2aY-640x395.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/06/yimg_e48yhg-640x389.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/06/yimg_oh2HrR-640x373.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}