{
  "name": "Nasi Lemak Corner",
  "address": "No 13, Mahawatte Road Embuldeniya Colombo, Sri Lanka",
  "open_until": null,
  "telephone": "0769123440",
  "description": "Authentic Malay nasi lemak for delivery or pick-up",
  "reviews": "Nasi Lemak is a Malaysian dish typically served for breakfast, but it being basically rice based, can be eaten at any other time one would eat rice. Which, in Sri Lanka, is basically at\nThe Nasi Lemak corner is a relatively new business operating out of Embuldeniya, somewhere around Kotte. They don't have dine-in facilities for the moment so you'll need to pick your orders up. Alternatively, they will offer delivery if you pay the charge for the tuk tuk meter. I got some food sent to Ratmalana and they only charged Rs.400, which is on the reasonable side as tuk tuk rates go.\nOh yes, and you also need to order one day in advance to make sure you get your food. So plan ahead for this one. No spontaneous cravings will be entertained.\nI tried nasi lemak once in Malaysia and it was one of the best things i'd ever tasted. Maybe I idealized the experience a little too much because the mental explosion I was expecting didn't happen. Still, the food from Nasi Lemak Corner was far from disappointing.\nThe coconut cream rice is milky but grainy. And the spicy-sweet sambal is a fantastic combination that ends up giving you a sensation that is spicy, sweet a well as wholesomely buttery. There is also fresh, sliced cucumber for palette cleansing, boiled egg and a nice little packet of deep fried anchovies (aka sprats) and peanuts, the trademark nasi lemak 'rice-puller'.\nThey have three items on the menu at the moment, Nasi Lemak Chicken (Rs. 550), Egg (Rs. 250) and Prawn (Rs. 570). Aside from the meat supplements, everything else in the pack is standard. The egg rice is good value at Rs. 250. The fried chicken was good too, but slightly dry and lacking in flavor. The prawns howvever, were excellent.\nThe food comes in plastic boxes with a layer of banana leaf at the bottom. But eating it out of the box is cumbersome, so you'll need a plate. The strips of banana leaf also unfortunately, fall apart as you do this.\nThis is a small home cook business and the people (voices on the phone as I got the food delivered) seemed no nonsense, practical and friendly. The tuk tuk delivery guy even offered me a mark down from the delivery price. Really happy with the service.\nA great place to get lunch to the office or home, but you'll need to order one day ahead. Also, this isn't exactly diet friendly food, unless part of your day involves hard labor in the humid sun.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/nasi-lemak-corner/review-206748",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/12/yimg_DRuCjc-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/12/yimg_xBt2mc-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/12/yimg_HvAck5-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/12/yimg_S5W8JR-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/12/yimg_YoBmNy-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/12/yimg_YoBmNy-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/12/yimg_HvAck5-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/05/yimg_DfDMo2-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_3bWLpL-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/12/yimg_DRuCjc-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/12/yimg_xBt2mc-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/12/yimg_HvAck5-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/12/yimg_S5W8JR-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}