{
  "name": "Navratna (Taj) ",
  "address": "25, Taj Samudra Hotel, Galle Face Center Road, Colombo 3",
  "open_until": " Open 12.30PM to 3.00PM, 7.00PM to 11.30PM",
  "telephone": "0112446622",
  "description": "Navratna, the Taj's Indian restaurant, is one of the few great places in the city for an authentic Indian dining experience. ",
  "reviews": "If you've got all the wealth of a Maharaj, or your uncle is a Sultan, Taj Samudra's Navratna will appease. It's good food, but for that price it had better be. Dishes here are typically in the Rs. 1000 - 1500 range, with some of the plates going up to even Rs. 2000+. So the damage really depends on the choices you make.\nService at Navratna left us with mixed emotions to say the least. The place seems to be locked in an eternal battle between customer and kitchen staff- there's just so many people clamouring to get seats. It is absolutely necessary to make a reservation. We made a reservation and the staff member over the clamour of service accidentally took my name down as one \"Mr. Partheepan.\" Heading to the restaurant the lady at the front desk categorically denied that there was any reservation under my actual surname or \"Mr.Partheepan\". When we showed her the call log however she apologised and got us a seat in under five minutes which is appreciated. Service is friendly and warm, though in my opinion lacking a bit of professionalism; the food took its own time leaving me stewing like an overly cooked Buriyani.\nambience-wise, Navratna goes for the full Mughal experience. A group of players with their sitars and drums play music of an era bygone while you ponder your life's decisions and gaze at the wall's colourful murals. Deep.\nThe restaurant isn't super spacious, but it's like...\n.\nMost Sri Lankans will admit that Indians are good at most things except cricket. With that in mind, I've always preferred the flavoursome, thick curries and meats of India as opposed to thinner Sri Lankan curries. (Brace yourself \"patriots\" are coming). Indian cuisine does meat justice. The meat is given due respect and massaged and rubbed with a coat of spices, and what-not before its left to marinate.\nHowever, given this, Indian cuisine is filling and heavy, so don't over order at places like Navratna.\nThe kitchen staff sent hot orders of prawn, and mutton buryani, mutton rogan josh, a platter of tandoori chicken, Paneer and an assortment of Indian flat breads.\nThere is nothing better than a butter naan with a bit of curry. The assortment of hot naan came with a selection of butter and garlic naan, and a soft textured variant (the indian name is beyond me). The flat breads are soft. My personal favourite would be the butter naan, because anything tastes good with butter on it. The garlic naan was flavoursome, but I didn't care much for the soft layered variant. It might be good to dip into curry, but it can't hold a candle to the butter and garlic naan.\nFor those who live on the more stuffy side of things the Buriyani will appease. The rice was moist, flavoursome and filling- An excellent base to any of the meats and curries we ordered. The tender chunks of mutton in the mutton buriyani were plentiful and full of taste. I didn't much care for the prawn buryani but other diners liked it. Essentially the same buryani as its mutton brother, except for the fact that I didn't find the prawns to complement the saffron-gold splendour as nicely.\nOn the less memorable side of things were the Rogan Josh and Lassis we ordered. I've fantasised about Rogan Josh ever since I had to cover Jumpa Lahiri's literature for my exams. The mutton was tender, but it could have been any old curry in the dish. This wasn't as great as the the stories make them out to be. Even the lassis, not properly cooled came with an unpleasant hint in the flavour.\nHere's where things get more interesting. The paneer and tandoori were by far the best dishes of the the dinner. - Think \"indian ambrosia\" carefully selected for the hindu pantheon. Wow. Just. Wow.\nThe paneer isn't as awesome as the tandoori, but it was a great dish nevertheless. There's plenty of chunks of cottage cheese covered in flavoursome curry for about three to four to share. I snuck in more than my share. Hehehe 3:).\nNow, the platter of tandoori chicken, which interestingly falls under the \"Kebab\" section of the menu is an aphrodisiac. There's that iconic intense tandoori flavour that sinks into the meat leaving for a wholly satisfying experience. If you're craving chicken this should be on your list.\nNavratna's service has receded marginally since we last visited but their food is still among the best. It's a bit taxing on the wallet. It cost about Rs.15,000- 16,000 for five diners so head there only if you've got the bucks to be building a certain mausoleum in Agra simultaneously.\nIf you've got all the wealth of a Maharaj, or your uncle is a Sultan, Taj Samudra's Navratna will appease. It's good food, but for that price it had better be.\nNavratna, the Taj's Indian restaurant, is one of the few great places in the city for an authentic Indian dining experience.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/navratna-taj/review-50315",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_RnSqWT-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_PLzP2R-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_PBG3Gb-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_Z8NGpg-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_i7uRCt-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_u1flYZ-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_8PjEkP-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_mOwJzm-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_NsWy43-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_8WlWQB-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_S0ta51-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_KwiphU-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_OLU1VF-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_nqnbFH-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_QsujCc-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_e56SMk-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/07/r7ukSszy258MtvRTun.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_mOwJzm-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_Z8NGpg-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_RnSqWT-640x542.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_u1flYZ-640x497.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_8PjEkP-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_QsujCc-323x480.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_e56SMk-640x480.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_nqnbFH-640x499.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_PBG3Gb-423x480.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_OLU1VF-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/05/yimg_wPMcog-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oKIYgP-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2015/07/r7ukSszy258MtvRTun.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_RnSqWT-640x542.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_PLzP2R-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_PBG3Gb-423x480.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_Z8NGpg-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}