{
  "name": "New Hotel Mayuri",
  "address": "451, Galle Road, Wellawatte",
  "open_until": " Open until 10:00 PM",
  "telephone": "0112502488",
  "description": "The atmosphere of this restaurant may not be inspiring, but the seafood dishes survive the taste test.\n",
  "reviews": "On my last trip to Jafna, my last meal was a hearty bowlful of Jaffna\n, the thick, seafood stew that is one of the signature dishes of the region. With a big smack of umami from the assorted seafood (and shells) cooked in a base of\n(or palymrah root) flour, this flavoursome soup very quickly rose in the rankings of my favourite foods. I found myself longing for it one recent Sunday — and that's how we arrived at New Hotel Mayuri, a Wellawatte joint that has long enjoyed a reputation for its\nand other seafood offerings.\nIt's foolish to go New Hotel Mayuri expecting ambience, because there is none. Dimly lit and slightly worse for wear, the restaurant has a purely functional air. A few diners occupied the tables and benches when we visited, tucking into the\nthat is served in the same plastic container that we took away. Clearly, this isn't the sort of place where you'd dawdle over your meal — you eat and you get on with it.\nMost of the seafood that the restaurant is well known for is displayed behind a glass counter that looks like it could use a good wash. But that small detail has never deterred us, so we took away a couple of\n,\n(or cuttlefish) curry and crab curry, to enjoy leisurely at home. The service was brisk and business-like, with a steady stream of customers walking in to order their Sunday meals.\nStill warm when we tucked into it, the\n(Rs. 200 for a large portion) came close to the version we had tried in Jaffna. Thick but not gloopy, it contained a curious assortment of crustacean shells and other flotsam, but that didn't get in the way of us enjoying it. Each mouthful had the heat of black pepper, which sneaks up on you when you aren't noticing, and the gentle bitterness of\nleaves. Rustic and nourishing, it made us wonder why more restaurants in Colombo don't offer it on their menus. At just Rs. 200 for a big bowl that could easily satisfy two to three people, it was also great value for money.\nA rich, warm brown in colour, the cuttlefish curry (Rs. 200 for one portion) was the sleeper hit of our seafood binge. Generously laden with juicy pieces of cuttlefish that had just the right amount of chew, the curry was perfectly balanced. Like the rest of the dishes, this one was also a substantial portion that more than satisfied our group.\nIf you don't mind the indifference to hygiene and the utter lack of atmospherics, New Hotel Mayuri offers a smattering of seafood that mostly hits the spot. It's also one of the handful of places in town that have\non the menu, which we can't recommend enough as a Sunday staple.\nIf you don't mind the utter lack of ambience, New Hotel Mayuri offers a smattering of seafood that mostly hits the spot. We especially recommend the Jaffna kool.\nOne of Wellwatte’s non-vegetarian heavyweights Mayuri is a well established venue for Tamil meat curry classics- which actually means sea food and goat meat curries.\n\nමයුරි කියන්නේ වැල්ලවත්තේ පිහිටි නිර්මාංශ නොවන ආහාර ඇති ප්‍රධාන ස්ථානයක්. එය සම්භාව්‍ය දෙමළ කරි වර්ගවලට, ඒ කියන්නේ මුහුදු ආහාර හා එළුමස් කරිවලට සුවිශේෂයි.\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/new-hotel-mayuri/review-52987",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_emDoCG-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_uYk3Bs-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_wnBKNe-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_cRacGF-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_NjhWI8-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_Xsap2V-150x100.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/11/20121101-165508-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/11/20121101-165648-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/11/20121101-165723-150x105.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_cRacGF-640x590.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_Xsap2V-640x538.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_NjhWI8-640x516.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_uYk3Bs-640x454.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_wnBKNe-640x542.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_yPKV0U-600x250.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/12/IMG_9457-588x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_emDoCG-640x538.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_uYk3Bs-640x454.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_wnBKNe-640x542.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_cRacGF-640x590.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}