{
  "name": "New Majestic Hotel",
  "address": "25 Galle Road, Bambalapitiya",
  "open_until": " Open until 11:00 PM",
  "telephone": "0778996716",
  "description": "The New Majestic Hotel is ironically one of the oldest hotels in Colpetty. How have they been doing since our last visit? Not bad, actually. Not good, but not bad.",
  "reviews": "A few nights ago, my friends and I had the itch to go out and eat something, but we had to keep in mind that we were more broke than a 20 year old's wallet. Tragic.\nSo we ambled about aimlessly like untended cattle and stumbled onto the zoo that is MC. We decided to keep our dignity intact and avoid that particular hellhole so pushing onwards across the road, we were spoilt for choice when we came across a range of\n.\nAfter much discussion we decided to pop in to the nearest 'restaurant' and lo we wound up at New Majestic Hotel.\nIronically there is nothing new, nor majestic about this platitudinous establishment, but we didn't go looking for a 5 star ambience. Neither did they promise a 5 star ambience.\n\nI'd describe this place as a hole in the wall, but I've been to much, much worse so I won't call it that. Instead it's simply the go-to after a hard day's work, with about 150 rupees left to spend and an empty stomach to fill. The food is cheap, there's room to sit down and eat, there are flies keeping you company, so all good on that front.\nService is so-so. The old gent who took our orders seemed attentive and gave us a few recommendations as well, but somewhere amidst the hullabaloo he completely forgot about us so we had to scan the crowd and flag him down a couple of times to keep reminding him. Not entirely his fault though, the place is\nand he's pretty much on his own.\nNow for the good bits. The food should serve as your only reason to go to this place. They've got an upstairs smoking area with a bold\nsign plastered onto the wall but nobody cares. This isn't a reason to go there either. The kotthu, however, is.\nThe Cheesy Chicken Kotthu (Rs. 450) is every bit as worth the price as the friend you're sharing it with. Because there's no way one person can finish this. I mean you can, but think of the cholestrol.\nIt comes with finely chopped\nroti and is fairly mild in terms of taste on account of all the cheese. It's served with a bit of chilli paste, so the spice factor is easily fixed there. It's a fairly basic cheese kotthu and is topped with onions, leeks and the usual ingredients. Would I absolutely recommend this? Not really, but if you DO get this it isn't a bad decision on your part.\nThe Beef Kotthu (Rs. 250) is another story, however. Piled with huge chunks of well-cooked beef, scrambled eggs and a whole lot of onion and other generic kotthu veggies, this one's a winner. I'd say ditch the chicken and opt for the beef instead.\n\nI love my milk tea. If somebody messes it up, I get angry because you can't mess up what is essentially the lifeblood of most if not all Sri Lankans. They messed it up.\nIt looks pretty in the picture and all, but it tasted like they'd added fresh milk (blasphemy) to it and then the milk has gone and curdled because of the hot tea. Not good. But at 50 rupees for a full mug, it's not so bad.\nWould I go here again? No, because there are about 50 other doppelganger 'Hotel's down that street alone, so next time I'll try something else.\nI highly suggest exploring the area though as it makes for some interesting night-time photo ops.\nThe New Majestic Hotel isn't anything special, but they've stood the test of time and remained stagnant with their okay service, good kotthus and whatnot.\nAlthough the restaurant itself was clean, the food was cheap and staff were friendly; sadly my vegetarian biryani was disappointing. Maybe it was because it had been hyped up beforehand, but I was expecting something outstanding and what I got was a fairly average dish.\n\nඇත්තම කියනව නම් බඩජාරියො දෙන්න වගේ කොත්තු ගිල්ලට මොකද මයිලෝ 2ක ඉස්සරහ දෙන්න අම්බානක පදිරි. වීදුරුවෙන් බාගයක් බීගන්න බෑ, ඉස්මුරුත්තාව වගේ.\n\nඅවන්හල පිරිසිදුයි. කෑම ලාභයි. කාර්යමණ්ඩලය මිත්‍රශීලීයි. ඒත් මගේ එළවළු බුරියානිය නම් හොඳ නැහැ. හැමෝම හොඳයි කියූ නිසා මම බලාපොරොත්තු වු‍ණ තරමේ එකක් නොවුණ එය සාමාන්‍ය බුරියානියක්.\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/new-majestic-hotel/review-196164",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_MNhnUN-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_gmqs6D-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_T6YcLY-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_GrTU5f-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_BO6UW6-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/05/yimg_wCq5GB-150x100.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/09/IMG_4159-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/09/IMG_4163-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/09/IMG_4164-150x105.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/05/yimg_KPQ2qw-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/05/yimg_zqhduN-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/05/yimg_PkW0TR-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/05/yimg_AQMXNp-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/05/yimg_geh4MP-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2017/01/sFOlV64o5GU2djDVqy.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_gmqs6D-640x452.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_T6YcLY-640x440.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_MNhnUN-640x469.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_GrTU5f-640x438.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_BO6UW6-394x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_mmMlXX-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_mOENRl-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_MNhnUN-640x469.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_gmqs6D-640x452.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_T6YcLY-640x440.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_GrTU5f-640x438.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}