{
  "name": "Nihonbashi (ODEL)",
  "address": "ODEL, 5 Alexandra Place, Colombo 7",
  "open_until": " Open 12.00PM to 9.00 PM ",
  "telephone": "0114718758",
  "description": "Nihonbashi is one of our most famous restaurants - they serve the best sushi in the city, fact. This is the place for Japanese fine cuisine. ",
  "reviews": "Nihonbashi is one of our favourite restaurants in the city. I'm literally making excuses to meet people there every week, just for the high quality Japanese cuisine. While the main restaurant at Galle Face Terrace can end up giving you a heart-attack of a bill (much like Darshana Munidasa's other great restaurant, Ministry of Crab), the little ODEL outlet is incredibly affordable.\nNihonbashi is in a little inconspicuous nook in the main shopping space at Town Hall's\n, right opposite Delifrance. It is the one truly awesome thing at this expat friendly shopping mall. Once you walk in you'll find it's just a small longish room, made to feel more spacious with mirrors, with a long sushi bar. You can sit at one of the few tables too but being served over the bar feels nicer if you're by yourself or with just a friend or two. The place feels more suitable for a quick meal on the go than for lounging around.\nService is very good - great presentation, efficient and quick. The chef in front of us was quite friendly and didn't seem to judge us for swiveling around on the swively bar stools and singing along to the great 90s music that was playing.\nIf you're new to Japanese food - you really, really need to give it a shot, even if you're not particularly into seafood. It tastes amazing, is ingeniously prepared compared to the oily bulky meals we usually have in Sri Lanka, not remotely like our own preparations of seafood, and most importantly it feels incredibly healthy. We got the salmon sashimi, my new favourite, Rs. 925 for five pieces, probably the freshest you'll have anywhere. They're gone in moments though which is sad. Alternatively you can try out\n, their sashimi isn't as delectable as this but still quite good, and 13 whole pieces for just Rs. 990.\nWe also got a sushi platter, the sushi fuji, which was very filling. It included nigiri sushi, and tuna, white fish, salmon and cucumber. Again, the fish was very finely sliced, incredibly cooling and fresh, and the rice perfectly sticky and just the right amount. This is a good dish for two to share, for Rs. 1520. There's already a strong wasabi hit wrapped up in the sushi so you can skip the wasabi dip.\nThe best we left for last: the okonomiyaki, although honestly after sashimi and sushi we were kind of full by now. This is an amazing, warm pancakey grilled mix up of things - we tasted egg, juicy shrimp, cheese maybe, cabbage and some other veggies, topped with soy sauce and very light, crisp shavings that slowly waved to and fro because of the heat from the dish. We got it in small size but this was actually one of the richer Japanese dishes on the menu, so it's big enough for two people to snack on, for just Rs. 680.\nWhat we had during our visit felt like it was enough for two of us plus one more, but the bill only added up to about Rs. 3000. Considering the high quality ingredients used and the attention to detail, this was an absolute steal.\nWe're really grateful that Nihonbashi is around - the food is great on all counts, the ambience is good if you're there with just a couple of people, and it's affordable.\nNihonbashi is Colombo's best sushi place, and our personal favourite for Japanese cuisine. The branch at ODEL is pretty affordable too.\nNihonbashi is one of our most famous restaurants - they serve the best sushi in the city, fact. This is the place for Japanese fine cuisine. Their flagship restaurant, Honten, is on Galle Face Terrace, and the menu here is both extensive and expensive.\n\nනිහොන්බාෂි කොළඹ තියෙන අවල්හල් අතරින් ජනප්‍රියම තැන්වලින් එකක්. ඒකට හේතුව ඔවුන් නගරයේ තියෙන හොඳම සුෂි පිළිගන්වන නිසයි. මෙය ජපන් අහාර සඳාහා කදිම අවන්හලක්. එයාලගේ හොඳම හෝටලේ, හොන්තෙන් තියෙන්නේ ගෝල්ෆේස් ටෙරස් එකේ. මෙතන මෙනූ එකනම් මිල අධික වගේම දීර්ඝයි. ජපන් ක්‍රමයට ලස්සනට පිළියෙල කළ වාඩිවෙන අසුන් සහිත මෙහි තියෙන්නේ සෙන් ආකාරයේ වටපිටාවක්.\n",
  "yamu_rating": "We love this!",
  "url": "https://www.yamu.lk/place/nihonbashi/review-44947",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_pUvcdD-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_QcQ1R1-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_2asCcq-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_fxkhM2-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_c4110y-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_wPHS7R-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_5V1pB1-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_3Y9M5n-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_63qItl-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_VVrV4n-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_DMNeTK-150x100.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/10/untitled-shoot-007-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/10/untitled-shoot-008-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/10/untitled-shoot-009-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/10/untitled-shoot-013-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/10/untitled-shoot-0151-150x105.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/Be7FWdmIZXRAmC8tEt.jpg",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_c4110y-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_DMNeTK-640x353.jpg",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_2asCcq-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_QcQ1R1-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_pUvcdD-640x494.jpg",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_wPHS7R-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://www.yamu.lk/wp-content/uploads/2013/02/DSCF2287-588x250.jpg",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_sG0SqX-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2015/09/5vFFZ6RUdzLydfkol8.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_pUvcdD-640x494.jpg",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_QcQ1R1-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_2asCcq-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_fxkhM2-320x480.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}