{
  "name": "Off The Hook",
  "address": "180, Park Road, Colombo 5",
  "open_until": " Open 12–3 PM, 6.30–11 PM",
  "telephone": "0112505818",
  "description": "Off The Hook is a fresh seafood restaurant and bar  located on Park Road run by the same management as The Bavarian German Restaurant.",
  "reviews": "So, it’s been almost a year since Off The Hook opened – premiers have changed (RW vs MR : Ultimate Showdown), premieres have aired (Game of Thrones Season 5, holla!), and Colombo has sleepily ambled on.\nSome things haven’t changed though, like Off The Hook’s lack of liquor licence. However, they compensate for this by encouraging you to bring your own alcohol in and not charging corkage. Which should be common practice if you don’t serve booze but it’s not (I’m looking at you, Tintagel).\nWe headed back there a couple of times this month to give it a second and then a third review. Less out of necessity and more out of greed. Their menu is extensive, ranging from Chinese to continental and everything in between. Their sushi and continental is pretty straight forward too, well presented and featuring fresh ingredients. I didn’t try any, choosing to focus on their super Sri Lankan fare, but everyone I’ve spoken to seems pleased by the quality and value of money.\nTheir opening bread basket is great – in-house varieties of bread with a sort of gooey deconstructed\ndip. However, their piece de resistance is their Jaffna crab curry. In my humble and absolutely biased opinion, I think the place would do superbly well with tossing their menus and making the entire operation one large Ode to Crab. They get their seafood fresh from Negombo every morning, and it shows.\nIn case you’re not convinced as to the freshness of the seafood, there’s an entire tank filled with live crabs and (sometimes lobster) lurking about basking in the little waterfall. It looks like a GQ photo shoot for sea creatures. I slunk closer to peek at the crabs, which was a BAD idea, as one of them (I named her Feisty Felicia) jumped out at me. Luckily her claws were taped together or I would’ve ended up with a pince-nez *audience laughs wearily*.\nThe waiter will generally give you the option to choose from crabs they’ve already got in store or choose the live crab of your choice for assassination. It’s a bit unnerving to condemn something to death, especially after you’ve looked at it in the beady eye, so I just told the waiter to choose for me. (UPDATE: I checked back later, Felicia was still alive).\nThe Jaffna crab curry was just stunning. You will have one taste and promptly fling your arms in the air and wave them about in glee (yes, exactly like a crab would). The default pairing they serve up is\nand roast\n, which goes superbly well with the curry. The roast\nis somehow simultaneously crispy and soft (witchcraft!), and is infused with a light smattering of karapincha leaves.\nThe crab itself is perfectly cooked in a rich Jaffna curry with all the right smatterings of spice, flavor, and\nleaves. Despite being freshly made, the flavour really sinks right into the crab meat, making for superbly succulent and well-spiced morsels. So the dessert options aren’t spectacular, just about 4-5 choices, but that’s really alright for a place totally focused on seafood. They had a fun tamarind purée and treacle cheese cake on the menu, neither of which I tried due to clothing restrictions (i.e: I ate too much).\nFor dessert I would have liked some crab cakes but settled for a standard chocolate mousse with  raspberry compote. It wasn’t spectacular, but wasn’t bad either. Good standard stuff. Well presented, but kind of tiny.\nThey also have something called a “dessert experience for two” at around Rs. 1,050. It features four different desserts and could probably feed a small army (of ants).\nThey have your standard selection of soft drinks and aerated beverages, but as we said earlier, no cocktails and whatnot.\nWe won’t go on about the ambience since Shru covered it pretty solidly in the original\n, and it hasn’t quite changed since then. Nice cosy floor plan, open brick walls, slight Mediterranean feel, lots of quirky posters and photos. You won’t be claustrophobic (dare I say…clawstrophobic?)\nThe service level is over 9000, with a fleet of waiters in sleek black aprons who are polite, helpful, and anticipate your needs. We never had to flag anyone down for a refill, finger bowl, or utensils. They also have a cute little summoning gadget with buttons which I sadly didn’t get to meddle with since the service was so attentive. I’ve been lucky enough to land a waiter called Hiran every time I visited, who is a total delight and always gives great suggestions for the meal, and happily answers all my curious questions about flavouring and sourcing. He was also exceptionally kind and told me that collateral damage during crab meals is to be expected after I apologized for getting curry everywhere. He then discreetly slipped me an extra finger bowl and a heap of napkins to help wipe curry off the table, the glasses, my hands, the bib, the floor, and my hair before my fellow luncheoner noticed. Class act!\nAt around Rs. 2,500 – Rs. 3,000 a head for the whole meal (including the opening bread tray, water, mains, sides, and dessert), Off The Hook is not exactly cheap, even in comparison to most of Colombo’s other seafood spots. It’s got simple, tasteful décor and stellar service. They also do a nice lunch crab meal deal for two which comes to around Rs. 4,500.Their menu is admittedly a little too vast for those who tend to dither or are intimidated by options, but the waiters can guide you in the right direction. If in doubt, choose the Jaffna crab. It will be the one time no one complains about getting crabs.\nOff The Hook is a fresh seafood restaurant and bar  located on Park Road run by the same management as The Bavarian German Restaurant.\nOff The Hook is a new seafood restaurant and bar (pending liquor license) located on Park Road run by the same management as The Bavarian German Restaurant.\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/off-the-hook/review-54573",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/10/DSCF03421-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/10/DSCF0338-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/10/DSCF03641-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/10/DSCF0335-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/10/DSCF0357-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/10/DSCF03291-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/10/DSCF03621-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/10/DSCF03471-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/10/DSCF03261-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/10/DSCF0334-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/10/DSCF0341-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/10/DSCF0355-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/10/DSCF0358-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/10/DSCF0359-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/10/DSCF03481-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/10/DSCF0351-150x105.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_as4t99-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_9dgfMn-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_kbDiP2-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_DOVWnw-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_uQ2KNl-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2017/04/KE2F77hW9uoRt7RHja.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/10/DSCF03291-600x411.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_uQ2KNl-640x360.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_as4t99-640x360.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_kbDiP2-640x360.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_9dgfMn-270x480.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/10/DSCF03621-600x412.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_EqPx33-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_mOENRl-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/10/DSCF03421-600x366.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/10/DSCF0338-437x600.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/10/DSCF03641-600x388.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/10/DSCF0335-600x430.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}