{
  "name": "Oshella",
  "address": "Delivery",
  "open_until": " Open Pre-order (call anytime during the day)",
  "telephone": "0778969687",
  "description": "Oshella is a home cook who specializes in chocolatey desserts. Literally everything we tried was excellent, but her eclairs in particular were the best we've had in Colombo.",
  "reviews": "Oshella is a home cook who specializes in chocolatey desserts, but also has a range of savories. Literally everything we tried was excellent, and her eclairs were the best we've had in Colombo.\nOshella is a relatively new home cook who started popping up on our news feed a few months back. After finally trying out her stuff, we think she does some of the best chocolate-based desserts in Colombo. Being a home cook, she works on a pre-order basis, so she may need a couple of days depending on how large the order is. Her prices are also reasonable, though most of the items do have minimum order quantities. Her menu has some really interesting stuff including Nutella bread pudding and nasi lemak along with classic desserts like brownies and eclairs.\nAs far as we know, Oshella is one of the only people who offers nasi lemak (Rs. 375, min of two). It's considered Malaysia's national dish and Oshella's take on it is delicious. It comes with basmati rice cooked in coconut milk,  Malay chicken curry and a type of peanut and sprat\n(known commonly as\nin Malay), crowned with a fried egg. The standout elements of the dish were the chicken curry, which was lightly spiced with a hint of sweetness, and the peanut and sprat\nwhich had an almost\n-like flavour with a salty undertone and crunchy texture.\nHer eclairs (Rs. 110) come in batches of eight. That may seem a bit pricey for an eclair, but these are about double the size of what you'd get at a bakery and they blow the competition out of the water. Unlike most other eclairs, these come with a pastry cream filling as opposed to the generic chocolate cream filling, and it works brilliantly with the soft choux pastry and chocolate coating.\nWe also tried out her chocolate caramel crunch (Rs. 375, min of three). This is a layered chocolate dessert with candied cashew crumble on top, a creamy chocolate mousse center, and a chocolate cake base. Not overly sweet but plenty chocolatey, as expected. Whether you're a chocolate biscuit pudding fan or the chocolate mousse type, this one will make you very happy. The only tiny issue we had here was that the caramel was understated but we still loved it nonetheless.\nAs far as chocolate desserts go, Oshella does some of the best we've had. She even managed to dethrone Tasty Caterers as our favourite place for eclairs, and topped it off with an excellent nasi lemak to boot.\nOshella is a home-cook that specializes in chocolatey desserts. Literally everything we tried was excellent, but her eclairs in particular were the best we've had in Colombo.\n\nයම්ම්… මරු ආ! හැබැයි මට මතකයි ගිය අවුරුද්දෙ ඔෂෙල්ලා ගෙනාපු ඉක්ලෙයාර්ස් මීට වැඩිය රසට තිබුණ.\n",
  "yamu_rating": "We love this!",
  "url": "https://www.yamu.lk/place/oshella-homemade-goodness/review-53533",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/02/yimg_zBnADC-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_t8ZCAl-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_F5IZin-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_508YXw-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_WIGllb-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_B3MYit-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_FxZzEK-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/02/yimg_5m5DmD-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_WIGllb-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_F5IZin-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_t8ZCAl-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_B3MYit-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_FxZzEK-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_508YXw-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_ehSNoe-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/02/yimg_GAysTn-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/02/yimg_zBnADC-640x347.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_t8ZCAl-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_F5IZin-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_508YXw-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}