{
  "name": "Paan Paan",
  "address": "84 Lorensz Road, Colombo 4",
  "open_until": " Open 7 am to 7 pm, Monday thru Saturday",
  "telephone": "114388488",
  "description": "Paan Paan is an excellent bread shop off Duplication Road. They've got superb takes on European loaves and pastries.",
  "reviews": "In YAMU’s very own Big Match,\n, Paan Paan, like a certain school from Reid Avenue dropped the catch and came second runners up. This isn’t to say Paan Paan is a bad bakery- the heck\n. It, like that certain school down Reid Avenue will always be the third best bakery in Sri Lanka.\nSnug at the bottom of Lorenz Road, Paan Paan almost resembles a scene from a children’s book. Its small, otherwise, crammed bakery is stuffed with trays full of European loaves, muffins, and croissants. It’s got a single tiny table for quick bites and a rack full of drinks and others goods. I actually prefer the crammed, and packed atmosphere – it allows for service that feels personal- and service wise these guys aim to please.\nThe staff, ever polite, informative and efficient add an element hardly seen in most Colombo franchises. They run a bit of a tight ship occasionally with about three to four customers in a small air-conditioned room. So far though they’ve never disappointed.\nFor an additional Rs.100 they deliver fresh bread within Colombo limits which is an instant bonus.\nI’ve often enjoyed loaves from Paan Paan. Their multi-seed bread is always a tastier option than mass-produced brown loaves elsewhere. With a blend of nutty flavours and textures you should consider this one if you’re looking for more complex stuff to chew on than your usual artificially sweet processed paan.\nI couldn’t eat at Paan Paan because its only hobbit-sized table was already taken by a father and his daughter which should give you an idea of the range of customers who love their stuff. I ended up buying the stuff to go. I got myself a warm ciabatta cheese melt with smoked chicken (Rs.300), a chocolate muffin the size of a small fist (Rs.100), and a miniature mini olive pizza for Rs.60.\nThe olive pizza which I started off with, though tasty, was probably the least enjoyable of the lot. There was an excellent hit of flavour from the olives, and the dough was not your usual rock-hard school canteen mini pizza dough. It was soft and came with a decent hit of cheese too. However that size is a massive let down. They really mean it when they say mini pizza. It’s a great bite- except there’s barely anything to bite. For Rs. 60 you might be able to grab a bigger, although slightly less tastier chicken mini pizza at the\n.\nIf you’ve ever had a chocolate muffin from Marks and Spencer’s you’ll know nuffin in the world is better than that massive, thick, dollop of chocolatey goodness. While I wouldn’t say Paan Paan hit the exact spot on taste and texture, they did leave me reminiscing a bit. Bite into this large, soft muffin and you’ll be thrilled to find a number of little pockets of chocolate wrapped beneath the dough resulting in a delightful experience. It isn’t as heavy as an M&S Muffin, which isn’t all that bad. I reckon it might be nicer if you have it straight from the oven – so if you can, have it warm.\nThe Smoked Chicken Melt was my favourite of the lot. The ciabatta, which is warmed and crisped, resounds with a solid crunch when you sink your teeth in. There is a pleasantly chewy texture where the melted cheese meets the warm bread resulting in an experience packed with a tonne of flavour. The flavourful strips of smoked chicken, tender and plentiful complement the crunchy ciabatta well. By itself, the ciabatta is an absolute pleasure and you can’t go wrong grabbing a few loaves to take home.\nPaan Paan is in the big leagues of Colombo's bakeries for good reason. They do great bread which you're bound to love.\nPaan Paan is a new bread shop off Duplication Road. They make good bread.\n\nஅண்மையில் டூப்ளிகேஷன் வீதியில் ஆரம்பிக்கப்பட்டுள்ள பாண் கடையின் பெயர் \"பாண் பாண்\". பாணா என்று நீங்கள் குறைத்து எடைபோடவேண்டாம். நல்ல பாண் கடையை கொழும்பில் கண்டுபிடிப்பதே கஷ்டமல்லவா?\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/paan-paan/review-48968",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_pWah64-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_EalfKW-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_AOJ1B6-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_wY5ChL-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_jDgds9-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_H1Ne0a-150x100.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/08/untitled-shoot-076-150x105.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_2OizvL-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_xBIJlw-150x100.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/08/untitled-shoot-068-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/08/untitled-shoot-069-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/08/untitled-shoot-074-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/08/untitled-shoot-078-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/08/untitled-shoot-0051-150x105.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_unZwiv-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2017/05/yimg_xftduK-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_c0mCr0-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/07/r7ukSszy258MtvRTun.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_unZwiv-640x640.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_EalfKW-640x480.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_jDgds9-640x541.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_H1Ne0a-640x638.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_wY5ChL-640x546.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_pWah64-640x448.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/12/yimg_xpd4iq-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_vPnIsi-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2017/01/sFOlV64o5GU2djDVqy.jpg",
    "https://www.yamu.lk/uploads/dp/2017/01/sFOlV64o5GU2djDVqy.jpg",
    "https://www.yamu.lk/uploads/dp/2015/07/uzI50We9CRr1yYpFEF.jpg",
    "https://www.yamu.lk/uploads/dp/2015/07/uzI50We9CRr1yYpFEF.jpg",
    "https://www.yamu.lk/uploads/dp/2017/01/sFOlV64o5GU2djDVqy.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_pWah64-640x448.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_EalfKW-640x480.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_AOJ1B6-360x480.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_wY5ChL-640x546.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}