{
  "name": "Park Street Trattoria",
  "address": "48, Park Street, Colombo 02",
  "open_until": " Open 11.30 AM - 10.30 PM",
  "telephone": "0112327111",
  "description": "Park Street Trattoria is the newest addition to Park Street's fancy repertoire of restaurants. They've got a beautiful space, but the food has definite room for improvement.",
  "reviews": "We've been eyeing the shiny new Trattoria eagerly for a while now. With an enviable location on the Park Street strip, the restaurant boasts Colombo stalwarts like Park Street Mews, Curve, and now Café Français as neighbours.\nIt fits the mews vibe perfectly, with its open plan structure and chic decor. They tout themselves as the P.S.T, which is linguistically convenient if not uncomfortably close to P.T.S.D. Let's break this review down into the good, the bad, and the upsetting.\nThe ambience is superb. The open plan New York loft structure could easily nestle into the meatpacking district, and lends itself equally well to the laidback strip vibe of the Mews. The P.S.T also features a cosy coffee and gelato area downstairs and a dining area on the mezzanine floor. The gelato is supplied by Il Gelato, and the coffee is illy, an Italian staple.\nThe interior decor is on point too, with chic exposed-filament bulbs giving everything a lovely warm glow. Sure, they also require as much energy as a toddler on a sugar rush, but perhaps it's worth it. The emphasis on natural materials and warm tones is great, with open brick, wood, and rope accents. We also adored the smooth jazz covers they have lilting in the background. It's absolutely conducive to a chat with good friends, or some cutesy gazing with special friends.\nI've been there twice, and each time a nice server named Damien took charge, earnestly whipping out his spectacles while scribbling down my order. The staff appears to know its way around the menu, with the ease and knowledge to recommend or explain dishes.\nThey do take their time to get to you, with just two waiters upstairs handling everything upstairs, but they are quite efficient nevertheless. The staff has also been very courteous in handling reservations, special requests, and chilling champagne.\nHere's where things start to disintegrate. Given the ambience, service, and location, we were exceedingly enthused about trying the food. To say that the hype didn't live up to the reality would be a deluded understatement. The menu was promising - simple, straightforward Italian fare, printed on simple, straightforward bits of paper. We liked the ease and simplicity of it, interpreting the relatively short menu as confidence in what they had to offer.\nWe even waited a couple of weeks to ensure the restaurant had gotten into the swing of things and had time to settle down. The palpability of our disappointment was inversely proportional to the palatability of the food.\nWe ordered two trattoria staples, a carbonara at Rs 1050 and a chicken salad at Rs 780. Both fell under the \"small plates\" category, which I think is a mistranslation of the Italian primi piatti, as it doesn't mean the portions are smaller here. In Italy, the first course is usually a lighter vegetarian dish, but since the prices were alright, we didn't get too pedantic.\nTo cut a long and painful story short, both dishes were abysmal. The chicken was tough and stringy, and appeared to have been pan fried rather than grilled. It was tossed in balsamic more acerbic than Willam Belli's wit, which didn't help. The carbonara looked lovely, the sauce showing a great creamy consistency. However, upon closer inspection, we realised that the meat used wasn't pancetta or guanciale but little strips of supermarket bacon, which were really soft and fatty. The most heartbreaking part though, was the taste. It was so intensely salty that I had to try and clear my palate with numerous bits of bread, prosecco, and water.\nI was unfortunately compelled to ask the manager if it was a mistake, and whether the chef accidentally resalted my dish twice. She was incredibly sweet, and helpful, and insisted on replacing the dish immediately. However, she told me that the intense salty flavours are caused by pancetta, which seemed to be a non sequitur since there was clearly no actual pancetta in the dish. The replacement scraped by. It was less salty, but the fatty bacon strips remained, and this time around the eggs in the sauce had scrambled - sigh.\nFeeling blue and betrayed, we ordered a tiramisu to take the edge off, which worked. It was well done, not too sweet, albeit a little too viscous for me.\nA week later, I returned to P.S.T just in case the first visit was on a very off day. The restaurant is pretty enough to deserve a second chance, so this time around we went for dinner and ordered a soup of the day for two at Rs 550, a carbonara again in order for comparison's sake, and a \"big plate\" of spaghetti marinara.\nThe soup, a creamy pumpkin concoction, was great. A well flavoured offering with a slightly thick feel, it was perfect, steaming refuge from the monsoon storm outside. 10 points! Again, expectations rose for the main course. I quickly learnt why they say expectations are the root of unhappiness.\nThe carbonara did actually feature some sort of pancetta this time (huzzah!) but the sauce  was scrambled again (boo!) and just too bland. The spaghetti marinara did consist of some choice bits of seafood, fresh calamari, clams, and tuna, but the sauce was devastatingly underwhelming. The flavour was absolutely one-dimensional, without even a smidgen of basil or oregano to perk up the tomato passata. After nibbling the best bits of seafood, I abandoned it and wearily returned to my prosecco. We left, considerably upset and wondering whether the P.T.S.D similarity was well-deserved.\nWe saw a few people ordering pizzas there, and the restaurant has a lovely little woodbrick oven below, so perhaps a pizza next time would justify the visit. If you've already tried some, do let us know. Please also let us know if our experiences were absolute flukes, because it's unfathomable that a restaurant that shows such attention to detail otherwise could neglect its culinary offerings so badly.\nA firm disclaimer needs to be put out there too, that their pretty hand-written chalkboard signs outside that offer aperitivo cocktails like spritz and campari are premature exclamations since they don't have a liquor licence yet. So bring along a bottle of wine, enjoy the ambience, and order warily.\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/park-street-tratorria/review-65423",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_ihvVKe-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_35gaVU-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_DQk9yg-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_nhLxXH-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_X4B4w8-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_j944Si-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_1CnZdk-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_6H3nGW-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_ggjnEX-150x100.gif",
    "https://www.yamu.lk/uploads/dp/2017/04/KE2F77hW9uoRt7RHja.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_1CnZdk-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_DQk9yg-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_nhLxXH-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_35gaVU-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_ihvVKe-640x330.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_X4B4w8-479x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_j944Si-322x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_ggjnEX.gif",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_6H3nGW-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/04/yimg_0vqyGy-600x250.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oKIYgP-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_ihvVKe-640x330.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_35gaVU-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_DQk9yg-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_nhLxXH-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}