{
  "name": "Perera & Sons",
  "address": "2, Dharmapala Mawatha, Colombo 3",
  "open_until": null,
  "telephone": "0112565742",
  "description": "It must be said that somewhere on the journey from family bakers to mega-chain standards fell. The cream buns nowadays just arent the same ",
  "reviews": "We've mentioned short-eats before. These waist-expanding pastry encrusted, squares, circles and triangles of tastiness are this island's answer to Spanish Tapas. Finger food for cocktail parties, handy snacks for in between meals and, eaten in sufficient quantities, a meal in themselves. They are also Colombo's signature food. Kottu is from Batti, exotic stuffed rotis from Hikka, string hoppers you find island-wide but short eats are a Colombo special. The various combinations of European pastry -puff, shortcrust, filled or topped with local /localized fillings - seeni sambol, curry sauce, spicy fish paste are a testament to this city's creole culture. Today short eats are deeply embedded into Colombar life appearing at birthday parties, weddings, funerals and every other social occasion.\n\nThe Perera and Sons bakery has probably done more than anyone or anywhere else to promote and popularize these calorific snacks. They've been around over a hundred years and their fish buns, seeni sambol rolls and vegetable patties- as a treat after school, have inducted generations into the fraternity of the short-eat. Over several decades and multiple generations they've expanded from a single bakery to a chain with almost a hundred outlets - one of the most recognizable and best loved brands in the country...\n\nHowever, it must be said that somewhere on the journey from family bakers to national chain standards fell. The cream buns nowadays just aren't the same as the ones I used to salivate over after Montessori school almost 30 years ago. The bacon and egg pastries, these days, contain virtually no bacon and I've had more than a few utterly stale patties and rolls from various P and S outlets.\n\nSome of the out of Colombo branches are definitely not up to the mark. To give the venerable old chain a fair chance for their YAMU review we went to their original Colombo outlet at Colpetty junction. While the original colonial shopfront is gone, replaced by hideous cladding, this is still their main city outlet and I believe the stock here is the freshest and the best.\n\nWe picked up a chicken cornish - with its spicy filling it's really an improvement on the English original, a cheese cake (actually an almond tartlet but these are called cheese cakes in Colombo short eat speak), crumbly and light and an eclair -OK, pastry a little dry and not to chocolaty.\n\nWe were charged less than RS 200- one advantage of their mega chain size is that economies of scale allow them to keep prices low. Our snacks on the day were fine but not up to the standard of short eat champions like\nand Sponge but for a century old chain store no bad. I still miss the Montessori cream buns from the days before they got really big though...\nWe conducted a lamprais taste-off that featured P&S lamprais. Click\nto see how they fared.\nIt must be said that somewhere on the journey from family bakers to mega-chain standards fell. The cream buns nowadays just arent the same\n\nඅපි මීට පෙරත් ෂෝර්ට් ඊට්ස් ගැන කතා කරලා තියෙනවා. මේ පේස්ට්‍රි ගල්වපු රසබර චතුරශ්‍ර, වෘත, ත්‍රිකෝණ තමයි ස්පැනිෂ් ටැපාස් වලට ලංකාවේ පිළිතුර. කොක්ටේල් පාර්ටි වලට කටගැස්ම, කෑම වෙලාවල් අතර අමතර කෑම, ගොඩක් කෑවොත් සම්පුර්ණ කෑම වේලක්ම වෙන දෙයක් තමයි ෂෝර්ට් ඊට්ස්. ඒවා තමයි කොළඹ කෑමවල මුද්‍රාව. කොත්තු ආවේ මඩකලපුවෙන්. රොටි ආවේ හික්කඩුවෙන්, ඉන්දි ආප්ප දිවයින පුරාවටම. ඒත් ෂෝර්ට් ඊට්ස් නම් කොළඹින්. යුරෝපියන් පේස්ට්‍රි වගේම සීනි සම්බෝල, කරි සෝස්, සැර මාළු දාපු දේශීය ෂෝර්ට් ඊට්ස් වුණත් තියෙනවා. කොළඹ වැසියන්ගේ උපන්දින සාද, මංගල උත්සව, මල ගෙවල් වගේ මේ හැම තැනකම ෂෝර්ට් ඊට්ස් ප්‍රධාන තැනක් ගන්නවා.B H\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/perera-and-sons/review-9535",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/01/perera-cakes-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/01/perera-outside-150x105.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/05/yimg_Xmi335-150x100.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/05/yimg_Xmi335-640x400.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_sf6hSl-600x250.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/10/untitled-shoot-0211-588x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/01/perera-cakes-600x337.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/01/perera-outside-600x328.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/05/yimg_Xmi335-640x400.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}