{
  "name": "Pizza Hut (Attidiya)",
  "address": "Attidiya Road, Dehiwela-Mount Lavinia",
  "open_until": " Open until 11:00 PM",
  "telephone": "0112729729",
  "description": "We all like the occasional slice of unorthodox pizza. But is Pizza Hut really worth the buck you're paying for it? Somewhat.",
  "reviews": "The rebel in us can't help but sneak in an occasional slice of\nnot-so-traditional pizza. Pizza Hut, with its chunky base and stringy cheese was\nonce one of the few places in town to grab pizza before more authentic options like\nand\ncame along. Turns out, this unorthodox Protestant empire\nhas now expanded even to the swampy marshes of Attidiya. Can pizza, the rice-and-curry\nof Rome, be any good so far from civilisation?\nAttidiya was once a far cry from Colombo. It had a variety of birds dotting\nits sky, snakes were a common pest, and there was even a crocodile in its canals a few\ndecades ago. Barbarians. So it came as a surprise that development schemes led to the sacrifice of diversity in favour of a concrete jungle. Pizza Hut was one of the many companies that took\nrefuge in a concrete box to dish out\nThe place isn't all that bad. It's clean and well-lit, so it's no surprise that many Attidians stop by for an evening\nmeal. Beware though, there are just enough seats for about 15- 20 people, so on a busy evening, you might need to get take-away.\nBeing a remote outpost, the staff here seem to be fresh recruits drawn into\nservice as cheesy Legionnaires of the chain. We found them helpful, friendly,\nand pretty efficient. Our order of three pizzas was out in 10 minutes, which is\npretty quick by all standards.\nPizzas at the Pizza Hut chain are actually quite pricey. A Devilled Chicken medium came to a rather substantial Rs. 800, while a small Ultimate Cheese Treat came to wallet-whipping Rs. 500. The strange\n    thing is that a large meatball crown crust cost us just shy of Rs. 500. However, for each additional topping that came as a part of the Meat Lovers flavour, there was an additional charge of Rs. 300. Zoinks.\nThe medium Devilled Chicken was a bit of a disappointment. With thick, pan-fried, oily dough the pizza was heavy and stole the heat from the devilled\n    chicken topping. On the bright (unhealthy) side, this allows for a crunchy\n    bite. Kids might enjoy this one. The topping, which is usually good, was dominated by the overpowering dough in this case, leaving texture, but little taste.\nI quite liked the small pan Cheese Treat. With a slather of various types\n    of (undoubtedly) cheap cheese, the pizza makes the ideal surprise for that\n    hipster vegetarian kid you know. There's a nice pickle to add a bit of heat\n    and an occasional blob of processed cheese that melts nicely in the\n    mouth. But once again, the thick pan crust kicks in to rob the pizza of its\n    flavour. My fault for ordering a pan pizza, I guess. If you're someone who\n    holds taste over sheer heft, get a thin crust. Vice versa for those of you who\n    prefer quantity.\nThe meatball crown crust Meat Lovers pizza was quite the surprise. Though\n    you'll be paying lots for the toppings, the flavour of this pizza almost\n    makes up for the terrible Ninja Turtles movie release last year.\nMegan Fox. The pizza, which I\n    customised to include beef pepperoni (heresy!), sausage, bbq chicken\n    and devilled chicken, was an absolute blast of smoky flavours. This was good stuff. The crust wasn't that bad either. With the thin dough allowing\n    the topping adequate space along with the added meatballs, this pizza is highly recommended if you're a carnivorous crackerjack like\n.\nFor drinks, we tried the double chocolate shake. Don't. It's essentially a\n    normal milkshake with a bit of chocolate sauce thrown in to double your\n    expenses.\nWe also tried Pizza Hut's new range of ice cream. The Creamizza. Seriously, Pizza\n    Hut? Creamizza? How much are you allocating to R & D? -_- By the time\n    one finishes saying Creamizza, the ice cream's already melted. In my experience, you're\n    better off buying a premium Elephant House tub on the way\n    home. There were nice chocolate\n    sprinkles, but they were far too sparse to make a difference. The Creamizza was hard, heavy and had too little\n    flavour to be considered a premium range. This Creamizza is so hard that if one were to go by Arthurian legend, he who pulls the spoon out from the ice cream will be the next\n    king of England. Sorry, Charles.\nPizza Hut is okay if you know what exactly you want. Avoid the drinks and the\n    desserts and you should be fine.\nIs it worth your dough? *snicker* Well, that depends on what you order.\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/pizza-hut-attidiya/review-52159",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_2edX5I-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_F6AEbG-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_rQxhb5-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_dKgUxk-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_fYroME-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_35xz7L-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/07/r7ukSszy258MtvRTun.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_rQxhb5-409x480.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_dKgUxk-640x502.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_F6AEbG-640x478.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_2edX5I-640x480.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_35xz7L-316x480.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_fYroME-451x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_k1dz3w-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/01/yimg_yxSeCJ-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_2edX5I-640x480.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_F6AEbG-640x478.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_rQxhb5-409x480.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_dKgUxk-640x502.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}