{
  "name": "Pizza Hut",
  "address": "No.101 Galle Road,\nDehiwela.",
  "open_until": " Open 11.00 AM - 11.00 PM",
  "telephone": "0112729729",
  "description": "Pizza Hut's stuff isn't half bad, and their desserts are actually quite great, but the portions don't justify the prices.",
  "reviews": "After nearly 3 years, we finally got around to reviewing Pizza Hut. Their pizzas aren't terrible, but you're hardly getting any value for money.\n\nPizza Hut was the pioneer in bringing pizzas to the Sri Lankan masses, and a decade ago they were also arguably the best. Times have changed now with modern contenders like\nand new new ones like\n,\nand\n.\nOne area that Pizza Hut still dominates is delivery, which they're extremely efficient at. That being said, people are starting to realize these smaller places offer more value for money.\nThey've got a good selection of pizzas with most of the seafood and meats, apart from pork based products. Ah yes, remember the glory days when the bacon lovers pizza existed? Now I just feel like flipping a table every time I see the word 'chicken bacon'.\nPricing is where Pizza Hut has lost their edge with small pizzas at around Rs. 500, mediums at Rs. 850 and large pizzas usually costing around Rs. 1500+.  The issue here is that a medium pizza is just barely enough for one, but not so much if you're really hungry. Whereas the new places like Domenico's offer massive 13' pizzas starting at Rs. 950.\n\nOne of their newest additions is the Moghul chicken tandoori (Rs. 870 for M), which is basically a tandoori chicken pizza with coriander leaves and raita. The topping is actually decent with the smidgen of raita on each slice adding a needed creaminess. The problem with this, along with all their pan pizzas is that it's 70% dough and only 30% topping, so you're paying for whole lot of flour.\n\nTheir cheese lovers pizza (Rs. 870 for M), compared to the likes of a quatro formaggi, just wasn't cheesy enough. This one is basically a regular pizza with an extra layer of cheese. You ever see their adverts where they remove a slice from the pizza, and the mozzarella strings and oozes from the sides? Non of that here. Again had this been a couple of hundred bucks cheaper we wouldn't have minded but we just can't justify this pricing.\n\nThe hot garlic prawns mayo (Rs. 1060 for M) was probably the best of the three. While it wasn't really 'hot' per say, the prawns had a good flavour and worked well with the mayo drizzled on top. I feel like we liked this one in particular because the addition of mayo added that richness that was lacking from their usual cheese topping.\nSurprisingly enough the desserts were the highlight of everything we ate. We tried their ever popular molten lava cake (Rs. 210) as well as the new chocolate cream crumble (Rs. 490), both of which were pretty great.\n\nThe molten lava cake is a tried and tested favourite, and rightfully so since it's warm and soft on the inside, with a rich molten center that oozes out gloriously as soon as you take the first bite.\n\nThe chocolate cream crumble was also solid, with a thin crispy base (finally!), a good amount of chocolate, topped with cookie crumble. While the cream was nearly non existent, we're willing to let that slide since the rest worked well together. Combine both these desserts for a mega-evolution of sorts (I salute those who get the reference).\nPizza Hut's stuff isn't half bad, and their desserts are actually quite great. Unfortunately, with their current size to prize ratio, we can't really recommend Pizza Hut over the newer, more authentic competition.\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/pizza-hut/review-37736",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2014/12/yimg_rQp2YI-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2014/12/yimg_8BcoFv-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2014/12/yimg_S3U18s-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2014/12/yimg_RlAbY2-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2014/12/yimg_YrryPA-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2017/05/yimg_D9zid6-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://www.yamu.lk/uploads/files/2014/12/yimg_S3U18s-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2014/12/yimg_YrryPA-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2014/12/yimg_rQp2YI-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2014/12/yimg_8BcoFv-640x489.jpg",
    "https://www.yamu.lk/uploads/files/2014/12/yimg_RlAbY2-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/12/yimg_MgvBQL-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_GGYNaT-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2014/12/yimg_rQp2YI-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2014/12/yimg_8BcoFv-640x489.jpg",
    "https://www.yamu.lk/uploads/files/2014/12/yimg_S3U18s-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2014/12/yimg_RlAbY2-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}