{
  "name": "Poonie's Kitchen",
  "address": "63, Pedlars Street, Fort, Galle",
  "open_until": " Open 10.00AM to 6.00PM",
  "telephone": "0912226349",
  "description": "Poonie's Kitchen is a wonderful hidden oasis in the Galle Fort. They serve high quality desserts and deliciously prepared dishes at surprisingly good prices. ",
  "reviews": "Poonie's Kitchen is a new and unexpected find in the Galle Fort - much like the time we discovered\nduring its glory days. They do some great food at reasonable prices, and get a full 5/5 for ambience. They really stick out among the tourist-friendly, mediocre-but-pricey trend of restaurants and cafes in the Fort.\nJust a few feet from the popular Fort haunt\n, Poonie's is a hidden oasis of sorts. Once you walk through the first set of doors, you'll pass through Mimimango, a little shop of quality trinkets, clothes and art, but not unlike other good stores in the fort (like\nfar down the same road). Walk out the back of this shop and you enter Poonie's Kitchen, a huge courtyard featuring very soothing, happy colours, Araliya leaves overhead, quirky decor, and comforting little things like the fish swimming in the pond and the swing to enjoy the view from.\nIf you don't want to sit on the long cushiony bench outside, there are tables and chairs for regular dining, flanked by shelves full of books and homely odds and ends.\nThe space is small, charming and quiet, and we were told they only spread the news of the restaurant by word of mouth to try and keep it that way. They also run a spa upstairs.\nThe bathroom is particularly lovely, you don't hear us saying that a lot about places, so make sure you take a bathroom break!\nThey've got a somewhat limited menu at the moment, which includes sandwiches, quiches and the interesting sounding 'salad thali' among other things, in the Rs. 1000 range, the average price for a big meal at the fort. We went for the two meaty options on the list: the chicken sandwich and the noodles with prawns. The noodles came fried and tossed with vegetables and loads of juicy, well seasoned prawns - this is a spicy, flavoursome, hefty dish and one of the best seafood ones I've personally had in the fort.\nOur sandwiches were very well put together too: they'd used brown bread, rocket leaves, and an interesting sweet-and-spicy mix of chicken with mango and avocado. Really quite tasty, would go back to try this again.\nThey've also got a tea menu - we got the spiced chai and the lemongrass. The tea comes fresh with the leaves, a strainer and a timer to time your brewing. While the spiced chai was exactly what you'd expect, the lemongrass was a surprising refreshing hit - you could smell that wonderful, morning-fresh fragrance of lemongrass a mile away, and you get a nice cool pop of mint when you take your first sip.\nWe tasted some of their desserts finally, though we were late for the bus back to Colombo - no regrets - we tried a bit of passionfruit-butter cake, some carrot cake and their chocolate brownie. The desserts are of great home-baker quality: the passionfruit is wonderfully creamy sweet with a tiny sour twist, and the brownie especially is thick, gooey and kind of perfect. Service was friendly, especially since we bumped into the place's very busy but warm owner, but the place is new and small-staffed so it can look challenging for the two or three kitchen staff to also be attentive at your table.\nPoonie's Kitchen unlike most eateries in the Galle Fort does not seem to be too concerned about the location's visiting swarm of tourists. Instead it's very understated, cosy and we think it exchanges good value for money (about Rs. 3000 for two of us, meals and drinks included). We're definitely going back here next time we're in Galle.\n",
  "yamu_rating": "We love this!",
  "url": "https://www.yamu.lk/place/poonies-kitchen/review-47215",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_QwhPNe-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_oY49XS-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_VlU1if-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_z5FlKq-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_9IrDCG-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_U9stKr-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_uabjCu-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_r8dJef-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_CFMzLS-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_E2isCS-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_ZHVkkV-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_oyCozs-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_ldlmQN-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_s5lVBI-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_sx2q33-150x100.JPG",
    "https://www.yamu.lk/uploads/dp/2015/06/Be7FWdmIZXRAmC8tEt.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_U9stKr-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_s5lVBI-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_r8dJef-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_ldlmQN-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_oY49XS-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_QwhPNe-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_z5FlKq-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_oyCozs-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oKIYgP-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_mOENRl-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/Be7FWdmIZXRAmC8tEt.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_QwhPNe-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_oY49XS-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_VlU1if-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_z5FlKq-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}