{
  "name": "Poppy Hana (Urban Kitchen)",
  "address": "Urban Kitchen, \nHyde Park Corner,\nColombo 2",
  "open_until": " Open 11.30 AM - 10.30 PM",
  "telephone": "112678015",
  "description": "Mid range conveyor belt sushi at Arpico's Urban Kitchen.",
  "reviews": "At risk to its own already overlooked sushi bar, Urban Kitchen has let Poppy Hana set up shop to provide conveyor-belt novelty based Japanese samplings to its primarily office lunch and Arpico shopping customer base. Put aside your Nihonbashi sized expectations if you have them, and you may be happily surprised by some hero dishes we uncovered. That said, as with our review of Poppy's Liberty Arcade branch, we do think there is room for improvement - particularly on the quality of their lower-end options and the number/variety of their conveyor options.\nSo just for a refresher, Poppy Hana sets itself apart in the local Japanese circuit through its\nor conveyor belt service option. The colours of plates on the conveyor reflect their price point. It also offers a la carte ordering. Here are the need to knows:\nFrom the conveyor we started big with a Rs. 420 black plate featuring a middle of the road Salmon Mayo Uramaki Roll.\nGiven its standing as an imported fish black plate serving this was in fact just\n(so-so). The salmon was reassuringly fresh but overpowered by the mayonnaise. A bit more\n(flying fish roe) wouldn't have gone amiss. Still, all would have been well if it hadn't been for the third piece of sushi being a poorly selected slicing of skin and tendon that was basically inedible.\nNext up - a satisfactory Chicken Tempura and Prawn Tempura. These were well executed. The chicken was not too dry and the prawn not overdone, the batter crunchy but not oily. A decent effort all in all.\nWe also tried a solid Crab Mayo Avocado Uramaki Roll.\nI’m not usually a fan of crabsticks but these were finely julienned and mixed generously with sushi mayonnaise for a creamy texture. With the rice,\n(seaweed), and avocado, the dish hit the spot flavour wise.\nSkip the uninspired Tempura Prawn (Chicken?) Futomaki Roll. Firstly, we were told that this was a prawn dish but upon closer inspection it turned out to be chicken. Even if we forgive this blunder, the roll was nothing note-worthu. The rolls were irregular in size and lacked texture or distinct flavour.\nFinally, the disappointing Tuna Tempura.\nGiven its wish to be a part of a more accessible offering of Japanese food to the local market, it would be appreciated and also wise for Poppy Hana to pay more attention to the bottom end of their conveyor offerings. Additionally, we noticed that there was a lack vegetarian options on the belt (The menu has a few options though).\nMenu Offerings:\nHere were found the hero sushi (and one villain) via\na) An Accomplished Ebi Fry and Mayo Temaki Hand Roll:\nI’m a big fan of the hand roll when having sushi, mainly because they’re usually huge and actually filling (I’m a growing lad). This was no exception. The fried prawn was crisp, fresh and hot. Instead of a tempura batter, this used panko breadcrumbs which were a world of difference to the mediocre tempura we had off the belt.  A bit more prawn and a bit less rice and I would have been a happy customer on this one.\nb) An Inspired Spicy Tuna Tempura Roll:\nWe then ordered a spicy tuna tempura roll on the recommendation of the waitress. The roll was hot with a light crispy tempura batter surrounding the rice. Points to Poppy Hana for their creativity, I hadn’t seen sushi like this in other sushi joints in Colombo. The tuna was flavourful, with a little bit of chilli kick and a sweet aftertaste that worked well with the silkiness of the avocado. This was clearly the best dish of the day and we would definitely recommend it.\nTo finish off, we tried the tuna sashimi. First impressions weren’t great; the knife skill was poor, with jagged edges and uneven slices. The tuna was stringy, and difficult to chew through, not that smooth texture that you get with a premium cut. Then the flavour, it just wasn’t…right, the aftertaste tasted almost artificial. And for 450 for 3 pieces we expected a lot more. This was the last dish of the meal and (literally) left a bad taste in our mouths.\nService was mostly good, the staff quickly brought over the menus. Food off the menu was brought out fast and staff generally attentive. The only fault we found was that some of the plates were dirty with a layer of grease, which let down a reasonably pleasant dining experience.\nAll in all Poppy Hana is a standard sushi joint, nothing special. It has some interesting dishes, but most are standard sushi fare. We would recommend ordering items fresh from the menu though. In terms of value for money, we think it’s slightly on the expensive side, considering its location and atmosphere, but not completely out of line with other sushi restaurants in town.\n\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/poppy-hana-urban-kitchen/review-77570",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_XxYotp-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_ihFaGX-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_K44lx9-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_yjlXe8-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_oeb2SM-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_TdjUeP-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_XLDmzy-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_JYOOCU-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_7dNQyf-150x100.JPG",
    "https://www.yamu.lk/uploads/dp/2016/05/uqi8BASRyQ9lCH2tmd.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_7dNQyf-640x464.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_XxYotp-640x480.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_JYOOCU-640x480.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_K44lx9-640x480.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_XLDmzy-640x480.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_ihFaGX-640x480.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_oeb2SM-640x480.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://www.yamu.lk/wp-content/uploads/2012/09/photo-588x250.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/06/Burger-King-Colpetty-Spicy-Chicken-8-588x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_XxYotp-640x480.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_ihFaGX-640x480.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_K44lx9-640x480.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_yjlXe8-640x480.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}