{
  "name": "Queen's Cafe",
  "address": "17, Duplication Road, Colombo 3",
  "open_until": " Open 11 AM–11 PM",
  "telephone": "0112508345",
  "description": "Queen's Cafe is a very popular fast food stop down Duplication Road that's been around for ages. It was closed for a while awaiting a face lift, but it's now open for business again.",
  "reviews": "Queen's Cafe has been around for ages, so much so that it serves as a landmark on Duplication Road. People passing by now might do a double-take, though, because after being renovated and refurbished for the last couple of months, it reopened for business just last week. We headed over there on Monday to check it out.\nLet's talk about the service first. Although I haven't been there for about five years, I remember Queen's being pretty slow, with indifferent stewards. But that has changed for the better now. The waitstaff are courteous and attentive, and also efficient with orders. They don't bother you by hovering around too much, and give you all the time you need to make up your mind about what you want to eat for lunch.\nWe eventually chose their Peri Peri Chicken (Rs. 420), BBQ Chicken (Rs. 735), the Mixed Grill (Rs. 2,900) the Queen's Enchilada (Rs. 790) and a couple of chocolate milkshakes (Rs. 275).\nThe Chicken Enchilada and Mixed Grill arrived first. Let's start off with the enchilada, shall we?\nThis came with a side of steamed greens, a side of curd and chilli sauce. The enchilada was bathed in warm, melty cheese which coated what we think was a tortilla (was it a tortilla or just a roti wrap? Do we get legit tortillas here? I'm not entirely sure). The tortilla was in turn generously stuffed with chunky pieces of chicken. Nothing was skimped upon in this dish, and the portion was quite large and generous. Given its size, it could easily have been an unwieldy dish, but it was not bad.\nWe didn't have any major complaints, other than the fact that the ribbons of tomato sauce on top of the dish added an undesirable tinge of sweetness to the dish. It didn't really go well with the cheese and spiced chicken inside. The dish would have been much better either without this element, or with a mouthwatering chilli sauce instead. If you're concerned about ingesting such a large amount of cholesterol, the beans, carrots, cauliflower and lettuce could put your heart at ease. At nearly 800 bucks, however, the dish didn't do enough to wow us. We recommend you try some of the other options on the menu instead.\nThe Mixed Grill was a substantial dish that could satisfy two to three people. It came with fish, beef, and chicken, along with assorted greens, French fries, a couple of eggs and several slices of garlic bread.\nAlthough it had the potential to be amazing, this dish was sadly disappointing. That's because most everything (except the garlic bread and chicken teriyaki) tasted strongly of fish.(Sorry about not having pictures of the meats as (a) they didn't really look that great once we dug into the dish, and (b) disappeared pretty fast once we started). There were a couple of large fish steaks in there, which were succulent and soft. The fish was prepared well and crumbled as you bit into it. It also smelled very strongly of... well, fish, and I'm not a huge fan of that. The chicken teriyaki was well-seasoned, well-flavoured, and had just the right texture. This bit of the dish was a win. Although it was perfectly cooked with just the right amount of chew, the beef was too fishy to be beefy. The overpowering smell and taste of fish just killed it.\nThe Peri Peri Chicken sandwich, on the other hand, won all-round appreciation.\nThe bread was soft and quite fresh, generously filled with a spicy chicken stuffing and an ample amount of cheese as well.The accompanying French fries were crisp, nicely salted and not too oily, so they got a thumbs up as well.\nThe undisputed winner of all the dishes, though, was the BBQ Chicken.\nConsisting of half a chicken accompanied with a few potato wedges and a couple of slices of bread, just recalling this dish makes my mouth water. The wedges were unexpectedly good, having been coated in seasoning and fried to a light crisp. We would have loved more of this starchy goodness on our plate, but it would have detracted from the main attraction: the chicken. Seasoned to perfection and with just the right amount of char, it was soft, succulent and flavoursome on the inside. The blackened and slightly grainy skin contrasted nicely with the soft flesh inside. The meat wasn't dry or tough, and I don't know how to elaborate more on a good bit of chicken without romanticizing it, so I'll leave it at this. One more thing, this is a way way way better deal than you'll ever get at KFC (why am I even bringing KFC into the scene?). If you're a fork-and-spoon person, this can get a bit tough to dig into, so I suggest just using your hands (especially given that it's not sliced up for convenience).\nQueen's interior is kind of funky now. It still has the whole cubicle-like set up it did earlier, but they've redone the walls and the ceiling and given it the ambience of something between a coffee shop and a restaurant.\nWe went for lunch on a weekday, which meant that the place was full of office-goers. It is a calm and quiet place during the week, but we can see it getting a lot busier during weekends. On the flip side, it's a bit dark and gloomy, and could use a bit of light. All they need to do is flip a switch to fix that, but we have no idea why they didn't. Overall, the ambience isn't unpleasant. It's a nice and clean place, and we love the exposed brick walls.\nQueen's serves a mix of good and\nfood — the dishes featuring chicken fare better than others. The service is good, the prices hover somewhere between expensive and dirt-cheap, and the inside looks pretty great. (Athough, the outside is really kind of tacky. Sorry. But, don't judge a restaurant by its exterior).\nSomething of a Duplication Road landmark, Queen's Cafe has undergone a makeover. Among other things, you'll find an unexpectedly good BBQ chicken here.\nQueen's Cafe is a very popular fast-food stop down Duplication Road that's been around for ages (I remember going there as a kid for their famed submarine). The quality of the burgers and subs are still quite good, it's affordable, and you can play pool upstairs for 400 bucks an hour.\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/queens-cafe/review-55615",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_kBMgUg-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_LB8bn4-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_dojHH1-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_biI9ZW-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_jvOsaS-150x100.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/08/IMG_4571-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/08/IMG_4572-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/08/IMG_4561-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/08/IMG_4581-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/08/IMG_4582-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/08/IMG_4566-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/08/IMG_4578-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/08/IMG_4558-150x105.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_4d4Shb-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_NVsgZ6-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_khi2Wu-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_UbgmP3-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/08/bf9TdKPSlnqFHMaZrC.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_LB8bn4-640x473.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_kBMgUg-640x426.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_dojHH1-640x426.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_NVsgZ6-640x426.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_khi2Wu-640x426.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_jvOsaS-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_wrSXom-600x250.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/11/IMG_9184-588x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_kBMgUg-640x426.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_LB8bn4-640x473.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_dojHH1-640x426.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_biI9ZW-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}