{
  "name": "Ramen Misoya Colombo",
  "address": "Colombo Racecourse, Colombo 07",
  "open_until": " Open until 10:30 PM",
  "telephone": "0772206652",
  "description": "Ramen Misoya is Colombo's only Japanese restaurant that specializes in miso-based ramen. They've got a small menu that they nail quite well along with a surprisingly brilliant fried rice.",
  "reviews": "Ramen Misoya was a surprise addition to Colombo’s Japanese scene a few months ago. We’ve actually been there a whole bunch of times already so this review will breakdown what to expect from their ramen and other offerings.\nJapanese cuisine in Colombo is the most diverse it’s ever been, but we've never had a ramen specialist. This is not to say that others don’t offer it, in fact Kuuraku does a fine take on it and Nihonbashi is also be a strong bet. However, Ramen Misoya is the first place to dedicate themselves to Nippon’s beloved noodle soup.\nThey offer a super simple menu with three types of ramen, served with either chicken, pork or veggies. The three types are slight variations of their miso based broth; Hokkaido (salty), Ise (malty) and Kara (spicy).\nWhichever meat/veggie option you choose you can go for either basic version (Rs. 1200) or the cha shu version (Rs. 1750). The main difference between the two being that the basic version will come with only minced meat, while the cha shu will have slices of meat added. Besides the meat, the ramen is served with udon noodles, fried onions, potato wedges and sautéed vegetables.\nSri Lankans will probably have a predisposition to go for the spicy broth and it’s not a bad choice at all, but what I’d recommend is either the Ise or Hokkaido broth, since you can actually add the chilli paste to it separately to bring that heat. We tried out the Hokkaido and while it is salty, it wasn’t overwhelming, balancing out well with the miso flavour and the chilli paste we added. The texture was also on point with a smooth texture which binds well to both the noodles and the meat.\nYou may think that a noodle soup won’t be too filling, but Ramen Misoya’s portions are substantial. In the case of the RM, it's because of the thick ramen noodle they use which are actually quite similar to udon in texture. It gives the dish a lot of body without making it overly starchy.\nDuring our visits to RM we’ve tried the both the basic and the cha shu versions of their ramen with pork and chicken. While the basic version still comes with the minced meat, we found that it generally finishes mid-way through. The cha shu on the other hand comes with tender cuts of meat which makes it feel like more of a meal. On our first visit the pork belly was cooked perfectly with light sear marks, literally melting in the mouth after braising in the warm broth. The second time we had it the texture was slightly off but the flavour was still on point.\nDespite being a ramen specialist, Ramen Misoya actually does serve up a few other (non-ramen) starters, mains and desserts. This may seem a bit odd, but I’d go so far as to say that these are actually their best offerings.\nThe chicken karaage (Rs. 700) is honestly some of the best fried chicken we’ve had in the city. The batter is not too thick, with a brilliant savouriness that really brings out of the flavour of the soy and garlic marinate. The meat has also been perfectly cooked on each occasion that we’ve tried it, so it’s a great way to prep for the mains.\nWith a name like Ramen Misoya you wouldn’t really expect them to serve up some of the best fried rice in Colombo, but that’s exactly what they’ve got. Their double pork cachan (Rs. 950) is hands down one of my favourite rice dishes in Colombo right now. Unlike other fried rice you’d get around the city, this one is not too heavy on the veggies with a just a bit of chopped carrots and chives thrown in. Instead you’re getting more egg and a real focus on the seasoning of the rice which has been consistent on each occasion. The best part, however, has to be the pork, which you’re getting plenty of. It’s a perfect ratio of lean and fatty cuts with a great balance of flavours.\nThe service at RM has been great each time we’ve been there. Never have we found ourselves unattended to or looking for a waiter to place an order. Since the menu is small the waiters are also well versed with the dishes and they make an effort to make repeat customers feel welcome.\nThe space itself was the former Beehive by RnR. The new layout is quite simple with two floors of seating that can handle a decent capacity. Nothing there really screams Japanese but we’re not too fussed. One thing we were happy to see was their massive, clean open kitchen. They seem to have a good process going since the food is generally read in under 15 minutes.\nRamen Misoya does good ramen and a surprisingly brilliant fried rice. For anyone with soupy cravings we’d recommend going for their cha shu ramen, but if you just want a really good rice dish we’d say their double pork/chicken fried rice is a must-try.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/ramen-misoya-2/review-218459",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/04/yimg_3DTbSs-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/04/yimg_OUxTiw-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/04/yimg_VigYB9-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/04/yimg_SiONVx-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/04/yimg_1GRAn3-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/04/yimg_9lJGsV-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/04/yimg_BojX0W-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/04/yimg_TYyooT-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/04/yimg_3DTbSs-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/04/yimg_OUxTiw-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/04/yimg_SiONVx-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/04/yimg_1GRAn3-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/04/yimg_BojX0W-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/04/yimg_VigYB9-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/04/yimg_TYyooT-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/04/yimg_9lJGsV-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/02/yimg_wZHxyG-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_S0qBQF-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2018/06/8vWkh5taQ5CVDJgqpQ.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/user/2018/04/yimg_gOGHlwER3swQtJJi8r-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2018/06/8vWkh5taQ5CVDJgqpQ.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/user/2018/04/yimg_gOGHlwER3swQtJJi8r-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/04/yimg_3DTbSs-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/04/yimg_OUxTiw-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/04/yimg_VigYB9-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/04/yimg_SiONVx-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}