{
  "name": "rare at Residence (Uga Residence)",
  "address": "20 Park Street, Colombo 3",
  "open_until": null,
  "telephone": "115673000",
  "description": "Expensive, but probably the most modernist Sri Lankan cuisine you can get.",
  "reviews": "rare at Residence got a strong 5 star rating from us when they first opened up, and quickly cemented its position as our go-to fine dining restaurant. It's been around a year since they've opened up, and while their food is still very good, it isn't as mind-blowingly inventive as it was before. rare is now just well done.\nrare's lunchtime bento boxes used to be unsurpassable at Rs. 1500++, but the preparation and presentation aren't as enthusiastic as they were a year ago. Keep in mind that this is just in comparison to its former glory.\nThe new menu is predominantly the previous menu, plus a couple of new additions. The way it's laid out is as difficult to maneouvre as Pettah on a Saturday morning (soups are called \"liquid indulgences\", \"grain range\" features anything with either rice or pasta in it, even if it's a stew). We ended up asking the maitre d' for recommendations instead.\nHowever, most of their evening tapas is still spectacular (special shout out to the Chicken Strips in Aioli for keeping Wednesday martini nights civilized and delicious at just Rs. 600 a pop).\nWe're also fans of the Meats n Malts sliders (Rs. 2900). Sure, it's pricey but it features everything from umami, pulled pork, and lamb, to camembert, chicken, and fat fries. Add a couple of discounted Balvenie 12 year olds to that, and you've got yourself a great evening.\nWe're rare regulars, so we were well versed with the previous menu and standard. This time, we decided to plan our review over lunch, and ordered one lunch set menu (Rs. 1500++) , and one mains burger.\nThe opening bread platter was lovely, fresh, and warm as always, but we did miss their sun dried tomato bread. They're happy to refill as you go along, so don't be shy.\nBhagya ordered a Pulled Pork Burger (Rs. 1390), which was great. It featured deliciously marinated pork, teamed with ruby red beetroot, oodles of melted cheese, with rustic potatoes and organic salad. One of our favourite features of the burger was the use of edible flowers for garnish. The flavours weren't immediately discernable, but they definitely wowed us visually. Overall, this was a strong main, and we were impressed.\nAs for my option, the lunch box starter was a zesty cold salad, featuring a a few fresh prawns, tossed salad and fruit, and a smattering of dressing and balsamic. In terms of flavour, the salad was great, but the prawns still had their dirt sacs in. Not cool.\nFor my main, I opted for a black pork curry with okra and herry tomatoes on a bed of garlic rice. It was sloppy, and for lack of a better word,\n. The pork was very soft and chewy, and the lovely deep goraka flavour didn't really shine here at all. The garlic rice was very wet and sopping, and added to the squashy texture of the pork. We also didn't really detect any flavour from the rice, and the okra and tomatoes didn't add anything much beyond chromatic variation.\nMy dessert was just a little serving of cheesecake, but it was delicious. With a crumby base of ginger biscuit, well baked cheesecake and a lovely topping of berry coulis, I was left wishing for more.\nBhagya's dessert was also great. He opted for a home-made Salted Peanut Ice Cream (Rs. 650), which hosted a lot of strong flavours, plenty of crunch, and as always chic presentation with a stemless martini glass nestled in ice.\nWe've usually opted for a bottle of chilled white (starting from a surprisingly cheap Rs. 3900) when dining at rare, but this time we decided to delve into the cocktails. Homemade, carefully curated, and employing a lot of local flavours, the drinks were a highlight of the meal.\nWe tried a Gotukola (Rs. 1290++) and a Raw Mango (Rs.990) . The Gotukola is a vodka-based concoction awash with cucumber, apple and a sprinkling of sugar. There has never been a better and tastier bastardization of a health food much reviled by Lankan children.\nThe Raw Mango was a little bit more simplistic, showcasing gin, ambarella, and a few spritzes of lemon juice. It was also delicious, not too sweet, and quite light - a perfect boozy summer drink.\nThe ambience is unchanged since its inception, with comfortable burgundy chairs, lots of natural light, and generic black and white photos on the wall. The outer poolside section is cosy and beautiful at night, but just too hot during the day.\nThe service hasn't changed much either, we've noticed the same maitre d' for the past year, enthusiastic and friendly as always, and well-versed with the menu. In general the staff is efficient and quick (unless it's a Wednesday night and they're fending off a gaggle of ladies ordering free martinis, when the service mysteriously slows down).\nWe haven't featured our previous meals here, but we can attest to the fact that rare's mains and cocktails are still of a very high quality. It's just a pity that they've lost interest in their once-famous lunchtime bento boxes, and consistency has been all over the place in the last few months. That enthusiasm appears to have been channelled into their daily bar offers, which we absolutely enjoy.\nSo we'd recommend stopping by for dinner or a drink, but perhaps avoid their executive lunches until they're executed better.\nOne of Colombo's top contemporary fusion restaurants.\nResidence By Uga tries to push Sri Lankan ingredients further than they've ever gone before. For the most part, it works.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/uga-residences/review-109014",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/07/yimg_X5AI4H-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/07/yimg_0Hi5HQ-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/07/yimg_2xvgXZ-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/07/yimg_rKVZK3-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/07/yimg_AgOgCO-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_O2fCIu-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_5k4Ug6-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_FBeOGV-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_pu4Vnf-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_YJh3Fe-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_ExuLmp-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_mG3wid-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_94vbko-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_6vbSQR-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_bRZiIP-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_0flfir-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_wq6a9A-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_blSL2o-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_mWBoUg-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_8hUBEm-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_PyBIFi-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_v8jXho-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/07/yimg_GXljuI-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/07/yimg_WreINe-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/07/yimg_ZNWoHL-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/07/yimg_4QoVdC-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/07/yimg_UijJR3-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/07/yimg_wH7YBR-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/07/yimg_pFC8IS-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/07/yimg_Rs8R8c-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2017/04/KE2F77hW9uoRt7RHja.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/07/yimg_Rs8R8c-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/07/yimg_GXljuI-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/07/yimg_X5AI4H-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/07/yimg_WreINe-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/07/yimg_rKVZK3-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/07/yimg_AgOgCO-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/07/yimg_UijJR3-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/07/yimg_2xvgXZ-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/07/yimg_0Hi5HQ-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/07/yimg_wH7YBR-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/06/yimg_QQpjsV-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_XEh2m9-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2015/07/uzI50We9CRr1yYpFEF.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/07/yimg_X5AI4H-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/07/yimg_0Hi5HQ-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/07/yimg_2xvgXZ-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/07/yimg_rKVZK3-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}