{
  "name": "Rasa Sayang Indian Food",
  "address": "93, Hill Street, Dehiwala",
  "open_until": " Open until 11:00 PM",
  "telephone": "0117424424",
  "description": "Rasa Sayang is a new Indian take-out restaurant on Hill St, run by the same management as The Malay Restaurant.",
  "reviews": "Rasa Sayang is yet another addition to Hill Street's ever growing list of eateries. Run by the same management as The Malay Restaurant, Rasa Sayang is their take on Indian cuisine. This is more a less a take-out spot, but we found their biriyani to be decent and came away pleasantly surprised by all of their chicken preparations.\nSo if you look up the meaning Rasa Sayang it's actually a Malaysian term that roughly translates to \"loving feeling\", which is odd since this is supposed to be an Indian restaurant. It did, however, make a bit more sense when I found out that it's managed by The Malay Restaurant. While our experience at their restaurant was positive, Malay's take-out stall didn't really impress us in the past, so we didn't really know what to expect from Rasa Sayang.\nWe wouldn't really call their's a specialized Indian menu though, since they also serve up fried rice and a few other generally popular local dishes like hot butter cuttlefish. The prices were a bit higher than the usual take-out restaurants, so expect to pay between Rs. 300 - Rs. 1000 per head, since the curries and additions go for standard restaurant rates.\nThe Hydrabadi Chicken Biriyani (Rs. 420) came away with mixed reviews. On one hand, we appreciated the long grain basmati rice and the moist, well cooked chicken which was as good as any we've had in Colombo. On the flipside, the rice, with no real gravy to go with it, was just far too dry and mild in flavour, lacking the seasoning we were looking for.\nOne thing that caught us by surprise was how flavoursome all their chicken dishes were. Both the Tandoori Chicken (Rs. 330 per piece) and the Malai Kebab (Rs. 350) were succulent and true to the flavours of the preparations. The Malai Kebab had a pleasant creamy flavour from it's marinade as well as just the right seasoning to bring out the flavour of the meat. We were also happy to see that the meat was perfectly cooked which is such a rarity especially when it comes to any grilled meat served at most places. The Tandoori Chicken had all the flavours we were looking for as well with a light charred taste as well as a nice hit of spices along with that vibrant red colour that makes you really want to try it. At Rs. 330 it's not cheap but you're getting a pretty hefty portion so no complaints there either.\nOut of pure curiousity we got the Hot Butter Cuttlefish (Rs. 750) as well, though there wasn't anything remotely Indian about it. We weren't really expecting much at all but it wasn't all that bad. In fact, we'd say this had a pretty unique taste with with a good amount of seasoning and a subtle sweetness to go with it. Judging from the light char marks it seemed like this had been fried and then lightly grilled. The only real gripe we had with this one was the fact that this had been prepared a while back so it wasn't warm and the batter wasn't crunchy at all.\nOur last dish was the Hot Garlic Prawns (Rs. 850) which was sadly a let-down. The prawns were over cooked and rubbery, so we found ourselves chewing on it for what seemed to be a good ten minutes. The curry didn't really hero the garlic either with pepper being the predominant flavour along with a what tasted like way too much five spice. At Rs. 850 this is pretty much their most expensive item, and likely the least worthy.\nRasa Sayang is pretty much a take-out joint, but they do have a few seats set up in case you want to eat a quick biriyani and bounce. Service was also a lot more impressive than what we experienced at their Malaysian counterpart. The waiters knew how each dish was prepared, so they were knowledgeable enough to recommend that Malai kebab-tandoori chicken combo.\nRasa Sayang finds itself in a weird place in our books. It's not quite Indian enough to be considered an authentic Indian restaurant but it's also got a decent mix in there. While we may not be going back for the biriyani, we'll almost surely be heading back for some of that chicken.\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/rasa-sayang-indian-food/review-63609",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_1ZjJu4-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_G2AU4u-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_j0gYkq-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_MY5OWx-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_S8D3bl-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_VkPPJt-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_WhT7Xk-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_utd9di-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_utd9di-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_MY5OWx-640x436.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_1ZjJu4-640x366.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_G2AU4u-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_S8D3bl-640x424.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_j0gYkq-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_mOKcMu-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_L4QWMb-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_1ZjJu4-640x366.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_G2AU4u-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_j0gYkq-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_MY5OWx-640x436.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}