{
  "name": "Red Snapper",
  "address": "64/4, Chatham Street, Colombo 1",
  "open_until": " Open 11.00AM - 2.00PM and 5.00PM - 11.00PM (Closed on Poyas)",
  "telephone": "0711115555",
  "description": "Red Snapper is a seafood restaurant at the Dutch Hospital that does a range of crab and lobster preparations. It's a formal dining place that plays a lot of '90s saxophone music and serves OK food.  ",
  "reviews": "Red Snapper is a seafood restaurant that's taken up the space formerly occupied by the short-lived Mexican restaurant\n. The food didn't impress us a whole lot, but it opened just about a month ago along with the Irish bar Shamrock next door, so we're going to hope they prove us wrong once the soft opening phase is over.\nRed Snapper is as formal as it gets, with chandeliers, giant wine glasses, dark wood floors and saxophone music from the '90s. It doesn't feel like the type of place you'd casually drop by with a bunch of friends if you're young, but more suited maybe for office outings, an anniversary dinner if you were born in the '50s, and slightly awkward meetups with your parents. The place was comfy enough but one little criticism would be the chilled air conditioning and how it immediately affects the hot dishes brought to the table.\nAn inner door at Red Snapper will take you to the Shamrock bar, which is a totally different vibe - relaxed lighting, comfy sofas and contemporary music. We'll need to drop a review on it soon but it looked like a fun place to be.\nLike we said it's sort of a soft opening time for Red Snapper so the full menu isn't ready yet. There's a small range of seafood mains and some pastas available now, in the Rs. 1000 range.\nI saw 'Jaffna crab curry' and jumped for it. After having some of this magic at\n,\nand most memorably at\nin Pasikuda, I've decided to just try it now whenever I see it on a menu. For Rs. 980 here though, it was a little underwhelming: it was a small crab in three pieces, enough for just one in terms of the meat, and that thick, spicy punch that makes Jaffna crab curry a dream to eat with kade paan, was sadly missing. The recipe was actually rather mild, with a thin ordinary gravy that lacked the spices, and an indistinct toss of onions and veggies, served at least with plenty of kade paan and well cooked rice.\nThe cajun seafood jambalaya was recommended to us and sounded exciting: a platter of chicken sausages, crab meat, cuttlefish, prawns and lightly cooked fish over a bed of rice and tomato puree. This was an assortment of random average flavours, none of the meats really stood out, there was only one rubbery cuttlefish, some barely seasoned fish, Keells style sausages and the crab meat balls weren't worth the recollection. The prawns at least were jumbo sized, juicy and spicy, and the rice tasted good with the tomato paste mixed in it. Was the jumble worth Rs. 1250 though? Not so much.\nWe weren't offended by any of the dishes so far - they weren't bad, they tasted okay. But the lobster ravioli, for Rs. 880, made us sad. Firstly, lobster ravioli sounds amazing, because ravioli on its own is a delectable Italian preparation worth drooling over, and then you add lobster meat to the deal - what's not to like? The first sin was that for Rs. 880, this included just two pieces of ravioli, sunken in a soupy concoction. The meat was barely distinguishable, and the piece was most parts thick, pasty dough, not cooked fine and clean for cutting as it should have been.\nService basically seemed to be run by one man, and he was very friendly and helpful and made sure we were comfortable throughout our visit. So it's pretty unfortunate that the quality of the food didn't level up with the good intentions of the place.\nWe do hope Red Snapper maybe improves once their menu grows out, but for now the food is not worth dialing up for a reservation, considering you're spending about Rs. 1500 per head. We suppose if you're around the neighborhood with an office crowd and you're looking for seafood and you're not too fussy, it'll do, and perhaps you can drop in for a drink and chill at Shamrock next door.\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/red-snapper/review-51246",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_2Yf6Lu-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_ttNGJF-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_hXAuqn-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_fOZgmO-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_XUuaUm-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_rSwf4t-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_NfySHB-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_Pd5Khy-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_jIGiby-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_IkudLb-150x100.JPG",
    "https://www.yamu.lk/uploads/dp/2015/06/Be7FWdmIZXRAmC8tEt.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_NfySHB-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_IkudLb-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_2Yf6Lu-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_hXAuqn-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_rSwf4t-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_fOZgmO-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_Q4GIOX-600x250.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_zFF92D-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_2Yf6Lu-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_ttNGJF-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_hXAuqn-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_fOZgmO-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}