{
  "name": "Rice Box",
  "address": "14, Narahenpita Road, Nawala.",
  "open_until": " Open until 11:00 PM",
  "telephone": "0112806806",
  "description": "A new Thai place adjoining Steam Boat and Naniyori in Nawala.",
  "reviews": "Rice Box is in the same building as Steam Boat and Naniyori in Nawala, on the second floor. There's an elevator you can use, but I took the two flights of stairs instead, because #fitness, #legday, #beatsmode, etc. The restaurant offers dine-in, delivery and take-out, although I highly recommend the latter two because the lighting situation is not great.\nPapaya salad is a staple of Thai food, and, done right, is fresh, light and crunchy. Rice Box's Papaya Salad (Rs. 400) is so-so - it tastes decent, and I liked how tangy it was. The ingredients definitely weren't fresh, however, and this was very evident in how soggy and rubbery the texture of the salad was. There was also far too much liquid involved, which may have contributed to the sogginess. Also, I got papaya juice on my white shirt and I'm still bitter about it (but this isn't really the restaurant's fault).\nThe Mixed Vegetables in Green Curry (Rs. 500) also had bits of tofu in, as a little bonus, along with carrots, beans and eggplant. The range of ingredients was great, as was the size of the portion, but the curry tasted very watered down. Like your personality when you meet someone for the first time and don't feel comfortable enough to let loose in front of them, this was green curry that respects your personal space, avoids nudity and has a PG sense of humour. It has potential though - just thicken it up and you've got a winner.\nThe Bean Curd with Cashew Nut (Rs. 500) was really good - it's got mushrooms, carrots and spring onions, and a generous scattering of chilli flakes. The extra ingredients weren't used to mask a shortage of bean curd, though, like they usually are, and the dish as a whole is really great value for money. I would like to see a little more cashew involved, but this with some steamed rice is A+.\nNeither of the two desserts Rice Box serves were available on the day we visited, which was disappointing. According to our waiter, the chef who'd previously worked there had left and her/his replacement didn't know how to make either dessert. They did offer us the Steam Boat dessert menu though, but it consisted of various flavours of ice cream paired with fruit, none of which could fill the mango-and-sticky-rice shaped hole in my stomach.\nThe service was 50/50. It took them 10 minutes after we ordered to come back and tell us one of our dishes weren't available, and it took a good 25 minutes for all our food to be served. On the other hand, our waiter was very friendly and even offered to take the bean curd back and put more cashew in it when he overheard me mention that I didn't taste any. They were also quick to pack our food to take away after we misjudged the portion sizes, and seemed to know the menu quite well.\nThe entrance to the restaurant is through some very large, very heavy, very impressive wooden doors. Pros: very large, very heavy, very impressive. Cons: sets you up for disappointment - the rest of the restaurant is something of a let down.\nRice Box loses so many points when it comes to ambience. First off, the lighting is terrible. I hate not being able to see what I'm eating clearly, and we needed two flashlights from two different angles to take all these mediocre photos. There's also no music playing in the background, so the only sound you hear is cutlery clattering and bits of other peoples' conversations. The Lazy Susans make it easy to move dishes around, but I highly recommend you either order in or take away because the ambience of the restaurant kind of kills the experience.\nRice Box is an affordable option if you're looking for some decent Thai food, and its massive portions ensure good value for money. The food is good, but could be better with just a few little tweaks and adjustments. The restaurant itself compromises the whole experience, so delivery and/or take-away is the way to go.\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/rice-box/review-189682",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_FZa5oE-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_JWVrsb-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_GgZOfh-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_Z2GTrY-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_WURkxg-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2017/07/N0pl6fYyXeLoJKhMds.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_JWVrsb-360x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_GgZOfh-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_WURkxg-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_FZa5oE-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_Z2GTrY-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_MGXyaY-600x250.JPG",
    "https://www.yamu.lk/uploads/files/2014/11/yimg_M8eneN-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_FZa5oE-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_JWVrsb-360x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_GgZOfh-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_Z2GTrY-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}