{
  "name": "Robata Grill & Lounge (Mövenpick Hotel Colombo)",
  "address": "24, Srimath Anagarika Dharmapala Mawatha, Colombo 03",
  "open_until": null,
  "telephone": "94117450470",
  "description": "Robata is Mövenpick's Japanese restaurant serving a range of contemporary Japanese cuisine, along with some excellent yakitori and grills.",
  "reviews": "Robata at Mövenpick is the most recent addition to CMB’s Japanese ensemble. While it was launched without much noise, Robata does a pretty respectable take on contemporary Japanese cuisine with some excellent cocktails to boot.\nSomewhere around late 2015 Japanese food was all the rage here in Colombo, with a whole\ncropping up all over the city. Since then, however, things have slowed down quite a bit with a few good ones like\nentering the fray. We’ve only really had the Colombo branch of\nopening up early this year, so Robata is a welcome addition.\nWhat’s interesting is the fact that Colombo's Japanese restaurants haven’t really suffered many casualties, which can’t be said for most other cuisines.\nRobata does a great job of covering its bases, offering both contemporary and classic Japanese dishes with a comprehensive selection of sushi and sashimi along with yakitori, teppanyaki and a few signature dishes from the Robata Grill.\nBeing a hotel restaurant, the prices are on the higher end, so much so that I’d call it exorbitant. Either way expect to dish out around Rs. 2,500 - Rs. 3,000 per head (without alcohol).\nWe started off with the quintessential Tuna Nigiri (2 for Rs. 550). They specifically mention that they’re using tuna akami, which is the leanest part of the fish. The tuna itself was very fresh, so no complaints on that front.\n\nThey serve it with very little wasabi, which is the safer option with most diners, but you can always add that yourself. It would have been really cool if they also offered variants with chutoro and otoro (fattier cuts) tuna, but it’s just akami for the time being.\nThe Salmon Sashimi (Rs. 1,250) was also on the leaner end of the spectrum. While it ticked the box for freshness, we would have preferred a slightly fattier cut for that melt in the mouth texture.\nTo round things off with the seafood we tried out the Philadelphia Maki (8 for Rs. 1,350). They really hit the mark in terms of texture with the tobiko flakes and black sesame seeds adding a nice crunch. Flavourwise it’s a bit of mixed bag and personal preference will play a part. You’re getting that same fresh salmon, but we felt the cream cheese was just a tad overpowering.\nYakitori is a treat when it’s done right, and Robata really does it justice. We ordered an assorted platter of yakitori: Shrimp & Bacon (Rs. 380), Pork Belly (Rs. 320) and Mixed Chicken Yakitori (Rs. 690) which came with wings, thigh and meatball.\nBesides the wings being a bit challenging to eat on the skewer, all of it was excellent and probably the best value for money items on their menu. Each of the items was cooked just right with a nice balance of seasoning.\nComing into Robata we weren’t really expecting to get cocktails, but props to Mövenpick for coming up with a really enticing menu, from the unique cocktails to the presentation.\nWe obviously went ahead and grabbed the Achcharu Cocktail (Rs. 990), which is a mix of tequila, salt infused mango, pineapple, ambarella, black pepper and chili flakes. Kinita had already tried this during her visit to\n, but that didn’t stop us from giving it another go. Long story short, if you like the flavour of\n, you’ll probably love this. It’s got more than a hint of tequila, which is almost amplified by the heat of the chili.\nThe Kiwi Granate (Rs. 990) was also a really interesting take on a fruity cocktail. The alcohol here is spiced rum, which actually works brilliantly with the kiwi and pomegranate combo. It’s not the strongest of the cocktails so we would have preferred a little less ice, but the flavour was on point.\nThe vibe at Robata doesn’t really scream Japanese, opting for the time tested red and black theme. While it’s mostly unremarkable, they do have a few fun elements like the orange ceiling-ribbon-thingamajig and the white Dahlia wall lights that add a bit of much needed character.\nWhen it comes to a brand like Mövenpick you expect a high quality of service and Robata didn’t disappoint in that aspect. The staff was attentive and fast, with a good pacing of dishes throughout our meal.\nRobata doesn’t try to reinvent the wheel, instead offering a broad spectrum of tried and true Japanese dishes. However, where they really shine is with their yakitori and grill. I’d say grab a bunch of different yakitori, some nigiri for freshness and a couple of cocktails to round things off.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/robata-grill-lounge-moevenpick/review-200141",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_iKbtaW-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_z0j49S-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_HpLoIA-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_OwCjoX-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_g38hzj-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_IgOiWv-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_0NI28E-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_GbOV04-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_kj1OOw-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_9XUhyP-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_HpLoIA-640x375.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_9XUhyP-640x379.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_OwCjoX-640x412.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_z0j49S-640x349.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_IgOiWv-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_0NI28E-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_kj1OOw-319x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_iKbtaW-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/05/yimg_qKlg07-600x250.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_sdbGWc-600x250.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_iKbtaW-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_z0j49S-640x349.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_HpLoIA-640x375.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_OwCjoX-640x412.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}