{
  "name": "Rocco's",
  "address": "615A Nawala Road, Rajagiriya",
  "open_until": " Open until 10:00 PM",
  "telephone": "0722012121",
  "description": "Rocco's has a good dine-in restaurant in Rajagiriya serving wood-fired pizza with a wide range of toppings.",
  "reviews": "Rocco's has a lovely dine-in restaurant on Nawala Road, around the Rajagiriya side, that serves up really good wood-fired pizza, ravioli, lamb chops and tiramisu. They've got quite an expansive menu, with over 30 pizza toppings to choose from, and their staff is fast and attentive, making for a smooth experience overall. They're only open after 5 PM, so we dropped in for dinner.\nYou can really go to town with the toppings available at Rocco's, what with an abundance of pork products from bacon to pepperoni to parma ham, marinated lamb to smoked salmon, duck and, yes chicken. Our main gripe, though, was the pricing. A 9\" pizza costs Rs 850 for Margherita and Rs 1300 for Salmone Affumicato (smoked salmon). So, we decided to go half-half and try out at least four toppings.\nBehold, one half five cheese, one half parma ham. The Pizza Amore - Five Cheese (Rs. 600 for half of 9\") was really creamy, with the ricotta coming through nicely. It's a combination of ricotta, blue cheese, parmesan, mozzarella, and, in addition to the usual four, emmental. If you're tired of the same old mozarella, the tangy, creamy (and not oily!) flavours on this are a treat.\nThe Prosciutto Crudo con Rucola (Rs. 750 for half of 9\") was quite generous, with the piece of parma ham covering the whole slice, and a rocket leaf to each. I really love when a pizza has got fresh ingredients to it, and this one really works because of the rocket leaf. While priced at a hefty Rs. 1850, the 14\" could be compared to the pizzas from Oro 1889. They may not use 00 flour here, but the dough is good enough to hold up the toppings and not take away from those flavours.\nThe star of the show, though, was the Salmone Affumicato (Rs. 650 for half). With some capers, onions and a lovely dill sauce, this one blew us away. The salmon shines bright, with just the right amount of acidity. There aren't too many onions, so those don't get in the way. We highly recommend it.\nThe other half on our second pizza was the Gorgonzola e Funghi (Rs. 575 for half) and it was quite disappointing. We couldn't taste the blue cheese, much, which made it out to be just mozzarella and mushroom. Too subtle to make an impression, we wouldn't order this again.\nThey've got a few options for drinks, hot and cold, so you can grab a cappuccino or a cafe latte for around Rs 350. We tried the Strawberry Iced Tea (Rs. 250) and it was actually quite good. Served just chilled, the flavour isn't synthetic, it actually tastes like there's strawberry juice in there. You can actually smell it.\nI had the lime juice (Rs. 200), because I really like lime juice, and it was good. Not too sweet, but also not particularly tangy. Inoffensive lime juice and inoffensive price.\nWe tried the lemon meringue pie (Rs. 400) and it was good. The pastry itself is a bit hard, but the flavours are there. The meringue is nice and fluffy and you get enough of lemon to sate your craving. You can check out the desserts in the fridge by the entrance, and pick what looks best. We had a not so smooth experience with the cheesecake, so maybe skip that and try a tiramisu (Rs. 450).\nSince we weren't in our usual neck of the woods, we called in a local, a resident of Rajagiriya, and decided to try the lamb chops (Rs. 1500) that were recommended to us by a friend. This one reminded me of the lamb chop we were served at Grande Gourmet, and it wasn't exceptional, either. They serve it well-done, and you can see that they've put some herbs into the preparation, which adds a bit to the flavour. The mash is alright, just creamy enough, and the sauce that comes with has a smokey flavour to it. It's quite pricey, though, and they have other meat dishes on their menu, but this was the only one we tried. Still not sure whether that's the way to go at Rocco's, if you're a regular diner, please do advise in the comments.\nWe also tried the Ravioli & Spinach (Rs. 1,100) which gives you the choice of mushroom or beef. We tried with mushroom and it was pretty good. The pasta itself was al dente, and the alfredo sauce was creamy, as it should be. I personally found the sauce to be a little sweet, and reminiscent of milk powder, but the others disagreed. Three people can share this one, and you get about 6 or 8 pieces.\nRocco's is a pleasant place to be. There's two ladies at the front office who welcome you if you make eye contact, and their staff seems well-trained and are quite attentive. They've got some space upstairs, too, but we'd recommend making a reservation if you're going with a group. It seems to do well with families, as we saw one happily going at their meal while we were there. The lighting is not very bright but very warm and yellow, with black and white photos of people eating pasta on the walls.\nWe liked that you see the cooks as soon as you walk in, working on the dough and firing up the pizza. They smile at you when you leave.\nWhile it seems to be best suited for those who live around the area, Rocco's does really good pizza at a steep price. Honestly, the pricing is closer to Oro than any other pizzeria, and we're not sure if we could afford to dine here often. Still, if we do go back, the smoked salmon and the parma ham are the way to go. If you live in Nawala or Rajagiriya and haven't dined here, you definitely should. The 9\" pizza is quite small, with only six slices, so you may want want to go with the 14\" half-half. They also do delivery, which we've written about before, but they're better at their dine-in location.\nBest suited for those living around Nawala/Rajagiriya. Really good toppings on wood-fired pizza.\nRocco's in Nugegoda is yet another one of the many pizzerias that has gained popularity for it's delivery. Their wood fire pizzas, while not terrible in any way, just aren't as good as some of our top spots.\nThe real problem with local pizzas is the bacon; bacon being something of a loose term in Sri Lanka, used to denote anything ranging from chicken ham to the actual thing. And this was the problem we had with Rocco's - the bacon\n\nරස තින් ක්‍රස්ට් පීසා හොයනවනම්, රොක්කෝස් පීසා එකට නියම තැනක්.\n\nදේශීය පීසාවල මූලික ගැටලුව තමයි, බේකන්. ලංකාවේ බේකන් කියන වචනයේ අරුත ලිහිල්. එයින් චිකන් හැම්වල සිට සැබෑ බේකන් දක්වා මස් අදහස් කෙරෙනවා. රොකෝස් පීසාවල අප දුටු ගැටලුව එයයි.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/roccos/review-70163",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_XiS41a-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_nW68eZ-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_Kk32La-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_zHuPLh-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_Q51CGV-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_8NFTu1-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_iMXs2q-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_3W3eD9-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_bXZDAI-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_lFOiGJ-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_VQfESI-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_QOXCvQ-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_pjz4R1-150x100.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/03/DSCF0104-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/03/DSCF0089-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/03/DSCF0105-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/03/DSCF0096-150x105.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_sHdACY-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_O5urV2-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_lj3w4N-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/12/0F34X3pTfLr7btifJN.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_nW68eZ-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_zHuPLh-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_3W3eD9-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_8NFTu1-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_QOXCvQ-320x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_VQfESI-320x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_Q51CGV-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_bXZDAI-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_lFOiGJ-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_pjz4R1-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_Kk32La-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_iMXs2q-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_20W2GD-600x250.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/06/yimg_0J2JqE-600x250.JPG",
    "https://www.yamu.lk/uploads/dp/2018/05/sIJAcEVxrFdIsRfn2v.jpg",
    "https://www.yamu.lk/uploads/dp/2018/05/sIJAcEVxrFdIsRfn2v.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_XiS41a-640x456.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_nW68eZ-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_Kk32La-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_zHuPLh-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}