{
  "name": "Saffron Persian Delights (Good Market) ",
  "address": "Nuga Tree Car Park, Colombo Racecourse, Colombo 07",
  "open_until": null,
  "telephone": "0778895009",
  "description": "Saffron is a popular Iranian stall at Thursday's Good Market in Battaramulla. They serve some great Persian favourites, both sweet and savoury. ",
  "reviews": "Saffron Persian Delights is a favourite among\n. It's run by a couple of Iranian women and friends and they serve some authentic Iranian snacks. We didn't get to try their Saffron rice which we've heard good things about, but we liked their shawarmas and sweets.\nis in a lovely location, usually up and running by 1PM and winding up by 9. If you're new to it, it's basically a series of food and craft stalls that are only open on Thursdays near Waters Edge. Few stalls have a place to sit though, so you'll have to mosy around and find a good spot somewhere else. Saffron, like many other stalls here, cooks up your order fresh right in front of you. Service is usually quite good and they're willing to explain if you have questions about Persian recipes.\nI love Saffron's coconut cookies. At Rs. 50, they're really light and fluffy and make for great snacks, and aren't packed heavy like cookies usually tend to be. Indi says they taste almost Christmassy.\nThese guys make a very good mutton shawarma - it's very spicy and generously spruced with minced meat, veggies and fresh lettuce. It costs Rs. 450 and I'd have this for lunch any day. The chicken kebab wrap (Rs. 350) was alright - basically lean chicken with tomato and onion, personally I thought this could have used some spice to really bring out the flavour. We're bummed out we couldn't try the Saffron rice - apparently you need to make your order early if you want to have it here, or else you'll find it on the menu at their Good Market stall at Colombo Racecourse on Saturdays.\nBamiyeh is something like a Persian doughnut of sorts: soft doughy pillows that have been deep fried in a syrup - saffron and honey play a part in the recipe. It's not too sweet and drippy like a lot of fried sweets (India's gulab jamun), it's got a mild, kind of floral flavour to it, and is pretty perfect if you're a fan of sweets. We just had a few samples on the house, but you can get a box of about 12 for just 200 bucks.\nThe other stuff on their menu are shorteats like falafels and pirashkis, hummus, cottage cheese wraps and lemonade.\nSaffron makes tasty Persian food, so if you're in the mood for some and you're wandering around Good Market, their mutton shawarmas and sweets are a good bet. If you want to try out their rice, make sure you call and place your order ahead of time.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/saffron-persian-delights/review-42552",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_GD12Lp-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_cuFFkY-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_LPxwHo-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_AS7Mjg-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_7dPi01-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_0hoKFy-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_QmGd1N-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_LCLIzM-150x100.JPG",
    "https://www.yamu.lk/uploads/dp/2015/06/Be7FWdmIZXRAmC8tEt.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_0hoKFy-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_cuFFkY-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_GD12Lp-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_LPxwHo-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_LCLIzM-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_SQSwa7-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_2IReda-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_GD12Lp-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_cuFFkY-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_LPxwHo-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_AS7Mjg-640x437.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}