{
  "name": "Saffron and Vanilla ",
  "address": "91/16B, Midland Mawatha, Wattarappala Road, Mount Lavinia",
  "open_until": " Open 8.00AM to 8.00PM",
  "telephone": "0775772679",
  "description": "Saffron and Vanilla is a home baker with international experience - she makes some amazing date cookies, and runs cookery classes.",
  "reviews": "Saffron and Vanilla is a home baker that makes superb desserts - she also teaches you how to make them yourself, if you're interested. This cookery guru has experience giving classes in India, Belgium, UK and France.\nHer menu includes a range of interesting, not-your-typical desserts: Banoffee pie (typically bananas, cream and toffee), passion fruit & mango cheesecake, blueberry cheesecake, tiramisu, mocha chip torte, wood apple parfait, kheer, coconut mousse, Shahi Tukra (Indian bread pudding) and Rasmalai (a rich Indian cheesecake of sorts).\nShe also makes some cookies and ice cream: date cookies, pineapple cookies, coconut ice cream, and cookies & cream ice cream (while there's one conventional inclusion on the menu of a chocolate cake with fudge frosting). Pudding or cake type stuff will cost you about Rs. 2000 for an order enough for 12 people.\nI'm not even a fan of dates but these date cookies were delicious. They're small crumbly sugary pieces like gnanakathas, simply stuffed with sweet shreds of date, but they were the kind of cookies you'd keep going back to for more. 20 of these for just Rs. 800 was great value for money.\nWe also tried out this coconut mousse with jaggery nut brittle - brilliant. First off, the flavours make a very interesting mix - the creamy coconut mousse alone is a treat if you're a fan of pol with the flavour coming through nicely, and the jaggery bits were complemented by kithul honey as opposed to just sugar.\nOur blueberry cheesecake looked promising, and we were told vanilla bean was used for flavour. It tasted alright, though the blueberry was a little too watery and the cheesecake bit felt rather yoghurty, probably in need of more refrigeration.\nSaleema who runs Saffron and Vanilla is a cook with international experience, and who obviously has an eye for the special nuances of quality cooking. She charges Rs. 5000 to teach you to make five dishes in 1 day, while 2 days would cost Rs. 8500, and this includes desserts and pastries. In March she'll conduct 2-day classes which will include lessons in making waffles, croissants and French breakfast pastries.\nSaffron and Vanilla is a really good dessert maker. We love her date cookies and appreciate her use of quality ingredients, and her prices which are on par with other Colombo bakers exchange good value for money.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/saffron-and-vanilla/review-42538",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_RHdbgS-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_NkEuZj-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_tWDLxn-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_Es5xJA-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_U3PVOX-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_QoV0Sx-150x100.JPG",
    "https://www.yamu.lk/uploads/dp/2015/06/Be7FWdmIZXRAmC8tEt.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_NkEuZj-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_RHdbgS-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_U3PVOX-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_Es5xJA-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://www.yamu.lk/uploads/files/2014/12/yimg_0vPQXM-600x250.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/04/IMG_1655-588x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_RHdbgS-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_NkEuZj-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_tWDLxn-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_Es5xJA-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}