{
  "name": "Sawadee (Mount Breeze Hotel)",
  "address": "22/5A, Mount Breeze Hotel, Off De Saram Road, Mount Lavinia, Colombo",
  "open_until": null,
  "telephone": "0112725043",
  "description": "The Sawadee , a part of Mount Breeze Hotel offers reliable food and service at reasonable prices.",
  "reviews": "Sawadee, the beachfront restaurant at the Mount Breeze was more like Mount Thunderstorm when I visited. Since Thor was busy swinging Mjolnir about, I was forced to dine inside to avoid the erratic weather. Their menu features a variety of mostly creative and interesting Sri Lankan Chinese dishes with a few Sri Lankan bites tossed into the mix as well. Pricing is reasonable with good quantity  (save the HBC) and their dishes are all in all pretty good.\nWe mostly ordered orthodox Sri Lankan Chinese dishes. At Rs.605 we got a fairly large portion of seafood fried rice and for Rs.660 we got the less familiar sea food crispy fried noodles. These were the flagships of the fleet.  While they don’t outgun top Lavinian contenders like\nthe admirals of the Sawadee kitchen surely dish up a decent quantity for that price. I wouldn’t elaborate too much on the fried rice. All in all it was a good deal of tasty fried rice. There really isn’t anything magical about it, but it’s filling nevertheless.\nOn the contrary the fried noodles are a pretty interesting dish. I was pleasantly surprised to see heaps of prawns and other bits of seafood specialties tossed into the dish. It’s an experience for the mouth with the crispy noodles coinciding well with the wet seafood mix.\nCovering the flanks were tasty portions of fried chicken with thai chilli sauce(Rs.650), hot buttered cuttlefish(Rs.770), and fried beans with baby corn (Rs.429). The hero of the accompaniments was the chicken- hands down. While it isn’t an absolutely authentic thai sauce it does have pleasant sweet, sour and hot flavours that supplement the hot, tender chicken well.\nThe HBC was disappointing given that it was a scanty portion. It was hot, flavourful and buttery, but it wasn’t as crispy as I would have liked it. The beans and bean corn was good, buttery and added a pleasant wetness to the fried rice.\nThis is a bit of a ying-yang situation. While the ambiance might not be your cup of tea service wise this place surprised me with attentive staff (including one who got mildly shocked trying to plug the fan for us). The staff were friendly, frequented the floor often and brought steaming hot plates from the kitchen in under fifteen minutes.\nAmbiance-wise Sawadee doesn’t have the sort of open-air sophistication Loon Tao has. It’s a little run down in some areas- but fairly clean. They’ve got a bar downstairs, but you can dine upstairs in a wide, airy floor with your family if you’d rather avoid the office crowds. The office crowds at the bar made only a mild racket 'putting a small' baila session ultimately adding to the atmosphere.\nThe experience at Sawadee was quite enjoyable. While it isn’t excellent it’s reliable and has reasonably priced dishes that are tasty, and filling. I’d go far enough to say it’s almost a 3.5.\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/sawadee-mount-breeze-hotel/review-48414",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_uIwy4x-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_1f12qQ-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_gIUDw9-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_PmIgXO-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_cgOXEu-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/07/r7ukSszy258MtvRTun.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_gIUDw9-640x523.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_1f12qQ-640x463.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_cgOXEu-640x479.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_PmIgXO-640x546.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_uIwy4x-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oKIYgP-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_YBjNF1-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_uIwy4x-640x426.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_1f12qQ-640x463.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_gIUDw9-640x523.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_PmIgXO-640x546.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}