{
  "name": "Scarlet Room (Colombo Courtyard)",
  "address": "32 Alfred House Avenue, Colombo 03.",
  "open_until": null,
  "telephone": "0114645333",
  "description": "The Scarlet room is Colombo Courtyard's Italian restaurant. Their all red theme may not appeal to some, but we found the food to be surprisingly affordable. Execution was a mixed bag, with a few dishes missing the mark and others doing quite well.",
  "reviews": "The Scarlet Room is Colombo Courtyard's Italian restaurant. Their all-red theme may not appeal to some, but we found the food to be surprisingly affordable. Execution was a mixed bag, with a few dishes missing the mark and others doing quite well.\nThe Scarlet Room has been around since Colombo Courtyard's inception, but it never quite sparked the public's interest, perhaps because it's only open for dinner. Their menu is predominantly Italian with a few fusion dishes as well. With Colombo Courtyard being a boutique hotel, no one would blame you for expecting the prices to be steep. The thing is, most of their dishes with the exception of a few mains are quite reasonably priced between Rs. 800 and Rs. 1500.\nWe started out by splitting a Seafood Salad (Rs. 750) which was actually quite a hefty portion. This was a mix of lettuce, cucumber, green apple, calamari, shrimp and scallops (which are quite a rarity here in Colombo). Both the veggies and the seafood  were very fresh, with the apple adding a bit of acidity, but most impressive of all was the fact that the scallops were cooked perfectly. All in all, considering the portion size and all the seafood that was in it, this is a pretty good deal. Buuut, it did need quite a bit of salt to really bring out the flavor of the seafood.\nThe first of our mains was the Risotto Paella (Rs. 950), which sounded quite interesting on paper. Scarlet Room being an Italian restaurant, we were looking for a risotto with the flavour of a Spanish paella. The preparation and texture of the rice is the most important factor of a risotto and this one came across as a tad bit undercooked, just shy of that perfect al dente texture. The flavour, however, was mostly on point with the flavour of the seafood coming through well, along with the  light crunch from the peas. They had opted to go with chicken bockwurst with this one, which was fine, though we would have much preferred chorizo - or at least a pork sausage.\nFor an Italian restaurant, the Scarlet Room offers surprisingly few pork options, so we ended up going choosing the grilled pork chop with green apple and balsamic sauce (Rs. 1200). This one is actually not really an Italian preparation at all, but for what it's worth the pork chop was cooked perfectly with the sauce adding both sweetness and acidity. The presentation, however, could definitely use work, and restaurants really need to stop cutting veggies with zigzag cutters (or whatever the tool is called). Using this just makes the veggies look incredibly unappealing, and shows a lack of attention to detail.\nThe Tiramisu (Rs. 650), while not the most authentic, was still pretty satisfying. This was more of a cross between tiramisu and cake with multiple layers. While classic tiramisu is made using ladyfingers (the biscuit, not okra) and mascarpone, this one had what tasted like sponge and cream cheese (though we aren't too sure about the latter). In any case, the flavour of the coffee was quite distinct and the substitutes got the job done in terms of texture.\nAs the name implies, the Scarlet Room has a red theme running across the restaurant. But besides the walls, the rest is pretty standard with white table cloths, comfy cane chairs, and some artsy black-framed photos. The restaurant itself quite dimly lit, which works well with the red walls, but if you're not a fan of the red theme in general, this probably isn't the place for you. The one thing that tends to ruin the dining experience is the fact that customers from both Cloud Cafe and Loft come down to SR to use the washroom, which can get pretty annoying if you came for a private meal.\nWe didn't run into any issues as far as service was concerned, though only two other tables were occupied on the night we dropped in. All of our dishes were prepared in under fifteen minutes and the waiters were friendly, attentive and just pleasant to interact with.\nThe Scarlet Room isn't really the most authentic Italian restaurant in the city, but it makes for a hassle free, semi-fine dining experience. Considering that the total tab for a salad, two mains and two desserts came in at under Rs. 4500, we think it's a pretty good deal.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/scarlet-room-colombo-courtyard/review-81889",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_pXBTFi-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_pXBTFi-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_Zi9m41-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_FA7tHq-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_vaetzq-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_WFpzP7-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_sNmNAG-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_FA7tHq-640x435.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_Zi9m41-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_WFpzP7-640x460.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_vaetzq-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_pXBTFi-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_mOENRl-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_zFF92D-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_pXBTFi-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_Zi9m41-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_FA7tHq-640x435.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_vaetzq-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}