{
  "name": "Sea Fish Restaurant & Bar",
  "address": "15, Sir Chittampalam A. Gardiner Mawatha, Colombo 2",
  "open_until": " Open until 11:00 PM",
  "telephone": "0112326915",
  "description": "Sea Fish is a restaurant that's been around since the '70s, and its dining space still features music and lights from that era. Their seafood is however good, and they also do seafood BBQs in their backyard on request. ",
  "reviews": "Sea Fish is one of those parts of Colombo that's been around since the\n1970's. It's in a neglected little corner between Slave Island and Pettah next\nto ye old Regal cinema, and unexpectedly serves up some fresh, well prepared\nseafood. They seem to have improved under new management.\nSea Fish declares itself discreetly on a faded blue signboard down a little\nlane of plants and housey roofs, a little dodgy from the\noutside.\nIt's not really dodgy at all once you walk inside though. It's a long, neat,\nA/Ced formal dining space with a bar at one end, but with the strangest choice\nof blue lighting across the ceiling. With the lights and the\nvariety of music playing from the radio while you eat, it's very '70s disco\ndining (yes that's a thing now), and I imagine my dad would enjoy having dinner\nhere and putting an uncle-dance. There's also a pleasant outdoor space out back\nfor more casual dining, where they can set up a seafood BBQ party on\nrequest.\nThe menu at Sea Fish is pretty extensive - check out\n. They've got everything from sandwiches to pastas, but their forte is\nobviously seafood. So we went for two seafood mains - the Dello Borata and the\ngrilled seer fish. It cost us roughly Rs. 3000 for two, which is on level with\nmost formal dining restaurants. They do crab and lobster too though, which we\nhaven't tried yet, and this'll add a little more weight to your bill (about Rs.\n3000 for a kg of medium crab).\nThe grilled seer fish for Rs. 1350 tasted alright - well cooked, mildly\nseasoned seer fish, coupled with boiled vegetables and french fries. Not a\nmemorable dish, but tasty, and filling for one person.\nIt was the Dello Borata that impressed us though - this is an aromatic,\nspicy curry of cuttlefish, the kind of dish that makes my mouth water just\nthinking about it. It typically comes with a side of four slices of kade paan\nand pol sambol. For Rs. 1400, this is a hefty bowl that comes hot in the\ncooking pot, easily enough for two, featuring plenty of soft, delicious\ncuttlefish in a very thick, flavoursome gravy, the Sri Lankan home-made curry\npowder kind - any spice lover's dream come true. With the kade paan, it's an\naddictive dish.\nOur waiter recommended the chocolate biscuit pudding, so we got that too.\nFor Rs. 350 this is actually pretty good. The biscuit isn't as crisp as I\nusually enjoy it, but this is one of the better CBPs as far as restaurant\ndesserts go - served very cool, with a great creamy chocolate texture, topped\nwith fresh strawberry.\nWe went at a not so busy time, so our waiter was extremely attentive. They\nwere a little bit forgetful - forgot my pol sambol and forgot my takeaway till\nI reminded them, but overall they were very friendly and helpful.\nSea Fish does some decent seafood and if you order wisely it's not too\ncostly either. If you're in the Fort neighbourhood and you're a\nseafood person like me, it's one of the few places there to sit down indoors\nfor a comfortable meal.\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/sea-fish-restaurant/review-50464",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_Q4GIOX-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_Cg4i50-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_OQPR0d-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_0DA8YK-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_DlnPxK-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_mT19lB-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_lDZ67f-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_y1lMiO-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_IyyWCA-150x100.JPG",
    "https://www.yamu.lk/uploads/dp/2015/06/Be7FWdmIZXRAmC8tEt.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_lDZ67f-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_Cg4i50-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_DlnPxK-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_Q4GIOX-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_OQPR0d-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_0DA8YK-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_mOENRl-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/11/yimg_tabxl7-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://www.yamu.lk/uploads/dp/2015/11/28f96f8KfwbA6EGIOo.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_Q4GIOX-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_Cg4i50-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_OQPR0d-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_0DA8YK-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}