{
  "name": "Seafood Cove (Mt. Lavinia Hotel)",
  "address": "No 100, Hotel Road, Mount Lavinia, Sri Lanka.",
  "open_until": " Open 9.00 AM - 11.00 PM (Dinner menu from 7.00 PM onwards)",
  "telephone": "0112711711",
  "description": "Seafood Cove is Mt. Lavinia Hotel's seafood restaurant. It has a great location on their private beach front, fast service and reasonably priced, fresh seafood.",
  "reviews": "Seafood Cove is Mt. Lavinia Hotel's specialist seafood restaurant. It has a great location on their private beach front, fast service and reasonably priced, fresh seafood.\nMount Lavinia Hotel, from our experience, has pretty much always delivered when it comes to food, and Seafood Cove is no exception. We'd say they're on par with heavyweights like\nand\n. Seafood Cove is open right throughout the day, but it's important to note that their full range of seafood is only available after 7 PM. Throughout the day they offer a snack menu, which is relatively small so you should ideally drop in after dark.\nPrices are on the mid to higher end, with each type of seafood listed with their price per 100g. They give you the nett price so you'll know exactly how much you're spending.\nThe fish was cooked perfectly tender with the batter adding the crunch. What we liked about the batter was that they added in a bit of chili powder which really did enhance the flavour by adding a bit of heat. At Rs. 600 this one is one of the better fish & chips we've had.\nWe started off our dinner visit with the chef's special crab bisque (Rs. 500). I've had crab bisque before but this one was darker than the usual, and the flavour reflected that with a distinct spice hit which was a nice change-up from the usual. What impressed us was that despite the heavy spice, it didn't overpower the flavour of the crab which came through well with the smooth texture of the soup.\nIf you drop in for dinner, the ordering process is a bit different. They have the seafood selection on display with the price per 100g for each, so you select which of seafood you want and tell them how you want it cooked. We got a platter of sorts with hot butter cuttlefish (Rs. 450 per 100g), garlic butter prawns (Rs. 550 per 100g), grilled tuna (Rs. 500 per 100g) and a steamed garupa (Rs. 300 per 100g) separately.\nThis was actually our first time trying out the HBC at Seafood Cove and it was excellent, easily comparable to some of the\nwe've had with great balance of seasoning, texture and heat. While picking it out, we had a close look at the tuna which was super fresh. So we decided to have it very lightly grilled, kind of like tuna tataki with the center still rare, served with soy/sesame sauce. The prawns were pan fried and cooked in garlic butter, which gave it a welcome richness with the flavour of the garlic working well with the light crunch of the prawns.\nThe garupa was the only thing we weren't happy with, and we had a similar situation at The Lagoon as well. At Rs. 300 per 100g it's tempting since it's quite cheap, but the thing is you have to buy the entire fish and a lot of that weight is bone. In this case, it was overcooked with the mild sauce not really doing much to help the cause. Our recommendation would be to go with seer or tuna instead.\nWe had mixed experiences in terms of service on our two visits. When we came in for lunch they were under-staffed, and the waiters lacked the professionalism we usually associate with Mount Lavinia Hotel. Our dinner visit was far more pleasant, and it seems like they take the dinner service pretty seriously, as it should be the case. The waiters were friendly, very attentive and the food was prepared in under fifteen minutes during a relatively crowded time which is impressive for any restaurant.\nSeafood Cove impressed us with both their menus, and fresh seafood. The service on the first occasion was iffy, but it was impeccable on our most recent visit. All in all we'd definitely recommend it for anyone looking to try out some good seafood.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/seafood-cove/review-44064",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_hvNma8-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_Sh41A0-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_Uvcw9i-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_Hw7NE4-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_Gcx1Qr-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_fHIpXW-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_ddNLTG-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_BcaH2Q-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_pkUYkF-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_dNVdRn-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_pKHA0V-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_J4IGTH-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_3kVIYE-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_Uvcw9i-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_Sh41A0-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_3kVIYE-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_fHIpXW-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_hvNma8-640x411.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_Gcx1Qr-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_pkUYkF-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_pKHA0V-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_Hw7NE4-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_mOENRl-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oKIYgP-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_hvNma8-640x411.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_Sh41A0-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_Uvcw9i-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_Hw7NE4-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}