{
  "name": "Sentosa Cafe",
  "address": "39A, Horton Place, Colombo 07",
  "open_until": null,
  "telephone": "0777636352",
  "description": "Sentosa is a Singaporean restaurant which seems to focus more on Malaysian fare, but also serves In",
  "reviews": "Set atop Grand Gourmet, Sentosa Cafe is perched right next to Stamford Bar and completes this trilogy that combines weird bar scenes, French fine dining, and Singaporean cuisine. We know this sounds strange, but that's just what it is; three different restaurants/ a bar under the same compact building, run by the same management.\nDespite this, the food at Sentosa is unexpectedly good, they even have a Malaysian chef. (Yes, for a Singaporean restaurant, half the dishes were Indonesian and Malaysian. As Imaad pointed out, they're more Pan-Asian than purely Singaporean).\nFor starters, we went for an Nyonya Mango Salad (Rs. 450) which was hands down one of the best salads we've had.\nA bit like\nif I'm to compare it to anything we're familiar with, this had thinly sliced raw mangoes mixed with other thinly sliced and commonly found greens, including\n. Throw in a bit of dried and fried sprats, plenty of lime squeezed in, mix it up nicely and you're done. We were both surprised at how well this was executed given that most salads we've come across here are boring affairs. Add to that, everything was super fresh, so that was pretty amazing as well.\nFor mains, we went for the Laksa Noodles (Rs. 760) and the Malaysian Beef Rendang (Rs. 880), both which were generous portions large enough to bring the left overs back to office. With rice noodles swimming in a bowl of spiced and fragrant coconut milk, I was surprised at how well the chicken, tofu, and shrimps blended well together. The taste of lemon grass could have been stronger, but we still enjoyed the dish. The spices came out nicely, so we recommend this. However, if you're expecting the typical rice noodles which usually accompanies a Laksa, you won't get that because the noodle here is a bit denser.\nTheir beef rendang comes with a bowl of steaming rice, and enough beef to feed about three hungry adults.\nWhilst this definitely packed in flavour and punch which we don't get in most of our local beef dishes, the meat itself didn't fall apart too easily and was of a much chewier texture than what slow-cooked beef should ideally be. The best rendang we've had to date is at\nat the Good Market.\nMoving onto dessert, we tried their Mango Mousse with Coconut Honey (Rs. 490), which was fabulous. They've somehow managed to get an authentic\nflavour going on, and the tartness of the mango flavour went really well with the sweetened cream.\nService is super friendly, and the steward we got went beyond his duty to find out how the mousse was made (because I was curious), and to introduce their new chef to us.\nAmbience-wise, the dining area is a splash of reds and oranges, and fin-like motifs on the walls. There's also some purple going on; the colour scheme is rather confusing and garish.\nIt's spacious (or it seemed so because we were literally the only diners there), and could perhaps seat about 25 people comfortably. One really weird factor is that this is a family restaurant, but it opens up into the\nAs in, when one of our friends visited the bar earlier in the month they heard kids running around and having fun at Sentosa, and had a random kid (or two) wander into the bar as well. So we're not sure how the ambience is at night.\nSentosa's got some really decent food, and their chef seems to be doing a good job. When speaking to us, he mentioned that the restaurant had a few complaints regarding the food when they started up, but that was when they had local chefs making a mess of the food. So he's come down from Indonesia and is currently revamping the menu and training the local chefs on how to make authentic Singaporean/ Indonesian/ Malaysian cuisine.\nFrom what we sampled, they've got their food game going strong.\n\nPan-Asian cuisine, good food, friendly service.\n\nමේක සිංගප්පූරු කීවට ඇත්තට ම මෙනු එකෙන් බාගයක් විතර ඉන්දුනීසියන්, මැලේසියන් කෑම. සිංගප්පූරු කෑම කඩයකට වඩා ඒෂියන් කෑම කඩයක් කිව්වොත් හරි\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/sentosa-cafe/review-82112",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_guCOTl-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_b2DB8x-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_M7yHF6-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_rYOS7r-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_DPHmR9-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_WrySKo-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_V8UlRd-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_5eC6To-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_hZO99X-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/08/bf9TdKPSlnqFHMaZrC.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_rYOS7r-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_DPHmR9-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_b2DB8x-640x437.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_M7yHF6-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_V8UlRd-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_VnAeWj-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_a697G4-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_guCOTl-640x436.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_b2DB8x-640x437.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_M7yHF6-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_rYOS7r-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}