{
  "name": "Seoul",
  "address": "No 28/1, Horton Place, Colombo 7",
  "open_until": " Open until 10:00 PM",
  "telephone": "0112697216",
  "description": "Seoul is a bright, sunlit, spanking new addition to the (mostly cheerless) Korean restaurants in the city. ",
  "reviews": "Korean restaurants in Colombo, for the most part, are a little lacking in the charm department. Don't get me wrong — there's nothing wrong with the food at\n, but the stale smell of cabbage and smoking diners in private rooms pervades the place. I haven't tried\n, yet but it doesn't help that Hotel Juliana's dodgy reputation precedes it.\nThus it gives us great pleasure to be the harbinger of good news. At long last, there is a spanking new Korean restaurant in Colombo that doesn't offend any of our senses. Over the weekend, Seoul did its darndest to charm us instead.\nSeoul is so new that the Korean owners seemed as surprised by our visit as we were by the fact that the restaurant was already up and running. Having noticed the signboard only a couple days prior, we were half expecting it to be shut. Only a week old at the time of this review, the restaurant is understandably still being put through its paces. More than a few items on the menu are not yet available, and the tableside barbecue grills will take a little longer to be installed. But we gladly overlooked these teething troubles, because the warm service (despite an obvious language barrier) and authentic nosh more than made up for it.\nIt's clear that Seoul has been designed by someone with an eye for the quirky and colourful. A couple of\ntraditional Korean outfits, for the uninitiated—hanging at the end of a long driveway welcome us into a small courtyard dotted with plenty of other knick-knacks. (Popular opinion seems to be that the symbol in the signboard below looks vaguely phallic, but imma just ignore that.)\nInside, the delightfully eccentric theme continues — no two tables are alike and a brightly coloured shelf with a selection of trinkets occupies centre space. Underneath a glass top, the table that we chose showcased an array of ceramic crockery (pictured below), which we later found out was handmade by one of the co-owners. The serving platters and bowls used to serve the food in have also been made by hand, which makes for such a refreshing change from the identikit serveware at most restaurants.\nOur favourite part of going to a Korean restaurant is the unbridled glee at the thought of the\n(or teensy portions of appetisers) that are served\neven before the meal begins. Let's just say Seoul didn't disappoint in this aspect.\nNo sooner were we seated than an array of\nbegan to appear on our table. We were delighted to find unusual additions to the standard issue repertoire, including pickled kang kung, fresh gotukola leaves by way of salad, pickled capsicum and brinjal, and my personal favourite—karawila kimchi. Sour and crisp with just a hint of a bitter undertone from the bitter gourd, this was a revelation. The selection of kimchi, all made in-house by the co-owners, was a wonderful testament to local produce and how it can be adapted to a foreign cuisine. Each time one of these ran out, the staff hurried to replenish it — until we had to ask them to stop.\nThoughtfully, the staff also helped us decide how much to order. This is a crucial detail because the portions are fairly whopping, especially if you're a modest eater. We ordered the pork bulgogi (Rs. 1,500), the beef bibimpap (Rs. 1,200) and a green onion pancake (Rs. 1,500). Those prices might seem a tad on the higher side, but considering that we couldn't finish any of the dishes, despite our valiant efforts, I think the damage was justified.\nI must admit I'm not a big pork eater, but Seoul's bulgogi tempted me to reconsider my opinion. The thin, moist strips of pork, zucchini and spring onions came doused in a pitch perfect barbecue sauce, that expertly straddled sweetness with spice. Served in a hearty bowl, the beef bibimpap had nearly a dozen ingredients. We counted stubby, short-grained rice, strips of nori (or seaweed), an assortment of bell peppers, minced beef and a fried egg at first glance. But these individual elements were elevated to a harmonious whole by the\nor fermented chilli paste that we added a generous heaping of to our bowl. Sweet with a sneaky chilli hit, the\n(also homemade and fermented for one year before using) is worth taking swipes of on its own.\nIf there was one disappointing part of the meal, it was the\nor seafood scallion pancake (pictured below). Enough to fuel a small army, the omelette studded with green onion stalks and pieces of cuttlefish was greasy and a tad heavy-handed compared to the rest of the meal. The next time, we may save our appetites for one of the other items on the menu instead.\nGiven the cheery decor, the earnestness of the staff who are keen to encourage you to try the cuisine and the substantial portions that hit the mark for the most part, there's little to dislike about Seoul. These are still early days, so be patient if your order isn't available for some reason. And while you're at it, ask them if they'd sell that\n-that-tastes-like-crack, would ya?\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/seoul/review-52373",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_P4Ndq0-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_xKeYrr-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_5Y4Fv8-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_BDRAtx-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_0oFfXw-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_CipbRj-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_cJuiXe-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_iWHsJf-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_iWHsJf-326x480.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_xKeYrr-640x395.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_cJuiXe-640x619.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_0oFfXw-640x455.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_5Y4Fv8-640x486.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_CipbRj-640x418.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/04/yimg_ANEokG-600x250.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_mH58pA-600x250.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_P4Ndq0-640x428.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_xKeYrr-640x395.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_5Y4Fv8-640x486.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_BDRAtx-478x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}