{
  "name": "Serendipity Arts Cafe",
  "address": "65, Leyn Baan Street, Galle Fort.",
  "open_until": " Open until 09:00 PM",
  "telephone": "942246815",
  "description": "This is a somewhat eccentric cafe with great music, interesting decor, and somewhat mediocre food.",
  "reviews": "This cafe catches your eye as you walk down Leyn Baan Street because of the funky, chilled out exterior and eccentric decor inside — with paintings and books laid out all over the place. You'd be left to wonder whether the place serves food or not, given that it looks more like a gallery of sorts, but nope, they do. They've a selection of\n, sandwiches, and some seafood dishes.\nWhether the service here is good or bad is debatable, with the waitstaff leaving you alone for most of the time and then being somewhat confused as to what's available or not in the menu at night. After the initial confusion was over, things rolled by pretty smoothly. One of the stewards were really friendly as well, checking to see if everything was ok whenever he passed by.\nThe food sadly, is a different story. More on that soon.\nThey don't serve coffees, so I got a passion fruit juice (Rs. 280). It wasn't bad, as in it wasn't cordial as you sometimes get in most places, so it was good to have it fresh.\nIt was a rather large portion and enough to fill you up. Nothing remarkable about it, but it wasn't offensive either.\nTheir cheese hopper is a bit of an eye-brow raiser, with one normal sized hopper (we're not talking of\nones here) priced at 200 bucks. True it comes with a bit of onions, bell peppers and a slice of cheese, but stillll...\nThe hopper in itself was just alright, nothing out of the ordinary. A bit soggy at the bottom from the tomato I reckon, but if you're expecting this to taste great, don't. It's literally just chunks of what you see up there heaped on an\nThis clearly wasn't enough for dinner, so I asked for a Roast Beef Sandwich (Rs. 550) next. Figured it would be a bit more filling and spicy, but I couldn't have been more wrong.\nThe sandwich, accompanied by a side of fries (which weren't too bad - the fries, I mean), was made of regular sliced bread, Astra, lettuce, and a few meagre pieces of boiled and absolutely tasteless beef; and that also gristle, most of them.\nI'm not exaggerating for dramatic effect even.\nYou'd need to stretch your imagination to hitherto unknown bounds to be able to pass this off as 'roast beef'. Especially when you ended chewing up and then delicately spitting out bits of rubber because some of the cuts (cuts? CUTS?) were that inedible.\nNeedless to say, the meal didn't satisfy. The bread was just plain bread and butter after that, and not too fresh to the taste either, so I just had the fries instead.\nThe ambience is what made me walk in. They've got books (yes, I'm a sucker for books), and some pretty neat graffiti on one wall inside. The music is good, with the playlist when I was there mostly being from bands from the 90s or early 2000s. It's rather a bit run down if you look closesly, but the scattered way in which the place is arranged disguises that. Try not to look into the kitchen area through the window, it might put you off your meals.\nI really do love the graffiti though. Pretty cool.\nIf you want to walk around and check out the quirky decor and old-school music, hit this place up for a fruit juice and a good read. The food disappoints, there are plenty other places in and around the Fort which offers better meals.\n",
  "yamu_rating": "We don’t like it",
  "url": "https://www.yamu.lk/place/serendipity-arts-cafe/review-71593",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_FbsRR7-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_DfJeej-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_g0EM9w-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_aS6qB2-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_3BSMQC-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_iQ8QFu-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_CVkcKy-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_2bnf6I-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/08/bf9TdKPSlnqFHMaZrC.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_CVkcKy-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_g0EM9w-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_3BSMQC-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_iQ8QFu-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_FbsRR7-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_DfJeej-320x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/02/yimg_fhNoOr-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/12/yimg_m5n55O-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2016/08/XeyiyT47QP0lwSxe3a.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_FbsRR7-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_DfJeej-320x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_g0EM9w-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_aS6qB2-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}