{
  "name": "Shahla's Baked Bliss ",
  "address": "Sagara Road, Colombo 4",
  "open_until": " Open 9.00AM to 6.00PM ",
  "telephone": "0772488880",
  "description": "Shahla's Baked Bliss is a home baker who specializes in jars full of toothsome goodies. It's not too pricey and her jars and brownies are top notch.  ",
  "reviews": "This whole cake-in-a-jar thing is a relatively new thing on Colombo's baking scene, and while it began with the likes of\n,\nand\n- a lot of bakers are taking up the trend. Shahla's is another jar maker, and she does a fantastic job.\nThe menu here is actually pretty impressive - there's a range of ordinary jars that use Oreos, brownies and cream, strawberries and biscuit pudding, a series of cheesecake jars, cake jars, and brownies as well.\nFrom the jars, we got small jars of biscuit pudding, and two different strawberry cheesecake jars. These are small and in the Rs. 400 range (the large ones are for Rs. 650), which is great considering quality and how expensive high quality jars tend to be lately.\nThe strawberries in these dessert jars are delicious, freshly cut up and juicy. Strawberries are the perfect additive to sweet desserts. This cheesecake jar was basically plenty of these fresh strawberries, cake, and delectable cream cheese between (hard to go wrong with this combo). My favourite was however the strawberry float - brownies, strawberries, cream cheese - the cream cheese especially was delectable, and went well with the chocolatey texture of the brownies.\nThey also do a good jar of biscuit pudding for Rs. 400 - very creamy, with plenty of thick choc ganache and roasted cashews to set it apart from your average CBP.\nThe minimum order for brownies is 6 squares, for just Rs. 550. But conveniently, you get to pick two different flavours for them if you like. We asked for the strawberry pizza and the chocolate ganache. While the strawberry pizza was basically chocolate brownies with a smattering of strawberry on top, the ganache brownies were amazing - very soft, thickly layered with ganache, with a thin crumbly biscuity layer to break up the taste.\nWe contacted Shahla by phone but got her menu and continued to correspond through Whatsapp. She seems very busy, but very friendly and enthusiastic about what she does. She offered a 10% discount and neat, customized 'Happy Father's Day' cards on her jars, since we ordered our goods on Father's Day, so customization is something she can do if you're looking to turn your dessert into a tasty gift. Call a day or two in advance, and they'll deliver your order to your doorstep.\nWe're always looking for home-bakers that stand out from the rest, and Shahla's gooey brownies and high quality jars certainly fit the bill. If you're looking for great comfort food or a cute way to gift somebody, this place is worth considering.\n",
  "yamu_rating": "We love this!",
  "url": "https://www.yamu.lk/place/shahlas/review-48336",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_9XgJzQ-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_TBKzMv-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_BmEclz-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_OevHyt-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_fym28Y-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_il76UN-150x100.JPG",
    "https://www.yamu.lk/uploads/dp/2015/06/Be7FWdmIZXRAmC8tEt.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_TBKzMv-390x480.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_OevHyt-320x480.JPG",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_BmEclz-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_il76UN-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_fym28Y-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/02/yimg_GAysTn-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_ib5ceG-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_9XgJzQ-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_TBKzMv-390x480.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_BmEclz-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_OevHyt-320x480.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}