{
  "name": "Shanmugas",
  "address": "53/3 Ramakrishna Road, Colombo 6",
  "open_until": " Open 10 AM to 10 PM (weekdays), 7AM to 10.30PM (weekends)",
  "telephone": "0112361384",
  "description": "Shanmugas is one of the older and more reputed vegetarian Indian restaurants. They're definitely pricier than most places but the food is very good and the service is excellent.",
  "reviews": "Shanmugas is one of the oldest and most reputed vegetarian Indian restaurants in the city. They're comparatively pricier, but the food is very good and the service is excellent.\nShanmugas is right up there among the top South Indian restaurants in Colombo. They offer a varied and extensive vegetarian menu with pretty much all the classics. However, while you can stuff your face for under Rs. 500 at more casual spots, Shanmugas will set you back somewhere between Rs. 600 - Rs. 1000 depending on how much you order.\nWe started off with the ulundu vadai (Rs. 75 each) which was golden brown, warm and tasty. This is served with a cocnut chutney and sambar, both of which were quite nice. The vadai itself was slightly crispy on the outside and soft on the inside with a good mix of spices.\nThe ghee masala dosai (Rs. 420) was one of the best I've had in a while. Ghee dosai in general tastes pretty good but this one had a great balance of flavour, texture and creaminess. What made this that much better was the masala which unlike most places was not spicy. I actually prefer this since you can really enjoy the flavour of the potato masala. Besides the masala you also get the sambar and two chutneys, so when you combine all three it just makes for a great combination.\nThe chili parota (Rs. 380) is a dish that certain South Indian restaurants offer. It's basically like a spicy parota kottu with a mix of onions and chickpeas, served with a raita. This portion was easily enough for two and very spicy, so the raita really does help to balance out the heat. Although it's spicy it's also flavoursome which makes you keep going back for more.\nThe onion kulcha (Rs. 200) actually had a lot more than just onion going for it, with a good amount green chilli in there as well. In terms of spiciness, this was probably the hottest because we found ourselves biting down on chillies quite often. This did make this one slightly less enjoyable than the others, but chilli buffs will likely enjoy this one.\nTo go with all the above we also got a Gobi mushroom fry (Rs. 550) and a paneer tikka masala (Rs. 550) both of which turned out be pretty similar in terms of preparation with the latter being creamier with more gravy. The paneer was milder in terms of spiciness whereas the mushroom was extremely spicy, but still very flavoursome.\nShanmugas is actually just a big house that's been converted to a restaurant. They've got a good amount of seating, but we still highly suggest you reserve ahead because this place is packed to capacity by 7.30 PM, after which you need to sit around till a table opens up.\nOne thing that really impressed us was the service which was adequately fast, very courteous and professionally managed. The waiters were friendly, very well spoken and quite helpful when ordering, while the managers overlooked and delegated the juniors very well.\nShanmugas is one of the best South Indian restaurants in Colombo. The food is generally very good, if a bit on the spicy side and the service is professional and well managed.\nShanmugas is one of the older and more reputed vegetarian Indian restaurants. They're definitely pricier than most places but the food is very good and the service is excellent.\nShanmugas is probably the best place for South Indian food in Colombo (they serve North Indian as well, but this isn't their strength). It isn't too cheap, but the food is authentic and quite tasty - if you like South Indian cuisine, that is. While South Indian food is hugely popular in, well, South India, it doesn't seem to have quite caught on down here on the island.\n\nෂන්මුගාස් දකුණු ඉන්දියානු බොජුන් සඳහා කොළඹ හොඳම තැනයි. ඔවුන් උතුරු ඉන්දියානු කෑමත් පිරිනමනමුත් ඔවුන්ගේ ශක්තිය එය නොවේ. අහර මිළ අඩු නැත. එහෙත් කෑම අව්‍යාජය. රසවත්ය. දකුණු ඉන්දියානු කෑම දකුණු ඉන්දියාවේ තරම් ඊට පොඩ්ඩක් දකුණින් ඇති ලංකාවේ ජනප්‍රිය නැහැ.  ඒ ඉන්දි කියන හැටියට නම් ලාංකිකයෝ මස් කන්න කැමති නිසා. මාංශ රහිත කෑම වේලක් කන්න කැමතිනම් මෙතන හොඳ තැනක්.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/shanmugas/review-44007",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_0ZrWyP-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_kfPlKs-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_es5hE0-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_C2PBqu-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_r8Pllp-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_DbsfTR-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_RkOF41-150x100.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/10/DSC01467-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/10/DSC01469-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/10/DSC01470-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/10/DSC01473-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/10/shanmuga-thali-150x105.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_0ZrWyP-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_r8Pllp-318x480.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_es5hE0-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_DbsfTR-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_kfPlKs-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_RkOF41-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_C2PBqu-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://www.yamu.lk/uploads/files/2014/11/yimg_VloI8Y-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_0nakvg-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_0ZrWyP-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_kfPlKs-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_es5hE0-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_C2PBqu-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}