{
  "name": "Sheherazade Arabic Restaurant (Galadari)",
  "address": "Galadari Hotel, Ground Level, Fort, Colombo 01",
  "open_until": null,
  "telephone": "0112544544",
  "description": "They have okay-ish food, and have an Arabian-Nights-esque deco going on, but have room for vast improvement.",
  "reviews": "Sheherazade boasts of Middle Eastern cuisine, and has a dinner buffet from seven to eleven everyday. We've been on the lookout for places which serves up good Arab food, so we decided to check this place out. They have some pros, but 'good Arab/ Mid-Eastern food' doesn't really cover it. The buffet's Rs. 2,200 per person. Compared to the\nbuffet, this doesn't seem to cut it.\nLet's check out the pros and cons of this place.\nPros:\nThey've got a good selection of salads, about 15 to 20 varieties, which included a pretty flavoursome Tabbouleh. The Tabbouleh barely had any bulgur or couscous though (or didn't have any to be seen eitherway), and was predominantly minty. I liked it, but I don't think it qualifies in terms of authenticity as I didn't taste any of the other flavours that ought to come with it; namely, the wheat or couscous, or the subtle dash of olive-oil. There were regular chick-pea / kidney bean/ veggie-based salads, as well as ones with seafood, marinaded chicken, and marinaded chunks of beef. All of these were quite flavoursome and were my favourite part of the spread. Their meat based salads had plenty of meat in it as opposed to a smattering, and you could have made a meal of these alone. Quite yum.\nThere was a cream corn soup which was like cornflour. Smooth, really thick, quite tasteless but with a hint of the flavour of corn. Pass me the salt and pepper, please. Lots of it.\nCons:\nNext up were the mains, and the meal went steadily downhill from there. We're sorry, Sheherazade. But this could be done better. So so much better. Especially since I found two short strands of hair in two different courses. Why.\nThe rice was Oozi (ideally spelled\n) and is supposed to be flavoursome, soft, yellow rice served alongside soft and equally well-flavoured meats. It's somewhat similar to a\nrice — really long basmati rice, infused with raisins, perhaps nuts, and served with garlic paste, broasted chicken or mutton, and pickled vegetables.\nThis one was just really bland.\nThe chunks of meat you see are Moroccon styled chicken and beef which were okay (well-cooked and tender, but nothing remarkable) and the potatoes are supposed to be roast potatoes. Kinda dry. The rice was nothing akin to the flavoursome rice it's supposed to be, but it did have some black olives and juicy raisins mixed in. While the rice wasn't bad, it wasn't\nTheir desserts bordered on being completely meh, and completely overpowering.\nTheir watalappam, gulab jamuns, and caramel custard looked too pale to be real, with the caramel custard (top right) being nearly white. As was the gulab jamuns, which looked anything but deepfried.\nTheir Baklava rolls didn't stand out, and was a sorry excuse for what a Baklava is. The pastry was crispy but really dry, with the honey on top not really making a positive difference. Or making it taste any better. The Arabic Honey Cake was cake soaked in honey. Lots and lots of overpoweringly sweet syrup. I took a bite and felt my blood sugar rise, so I just left it at that. Their Mango Shoot (a shot of yellow liquid in a shot glass) was practically undilited mango cordial. Oh, the sadness.\nService is friendly. The staff seemed a bit surprised and unprepared when we walked in around 7.20, and given how deserted the place was (a few more people came in about an hour later), I guess they were indeed surprised at having guests come in.\nThe staff are nice, and efficient. They didn't really have very much to do though, and left us alone for most of the time except to appear at the table suddenly and take our plates away.\nThey could really work on the ambience. I get that this follows a Middle Eastern theme, but to be honest, it's more like a scene out of the Arabian Nights instead of the real deal. The place is underlit and really dim, and their control over the soundsystem was nonexistent. Music (Arabic) would suddenly blare out (quite loudly) before dying down to a low beat, but the toggling of the volumes happened frequently enough to drown out our conversation and ask the staff to lower it down a little.\nThey also have a rather tacky deco.\nThe food isn't all that authentic, nor is it great. It's in central Colombo though, and it's a good enough place if you want to eat a lot (of whatever there is) and even have a meeting, because it's pretty quiet and empty. With the low lighting and lack of crowds, you get enough and more privacy. Honestly though, the food isn't really on par for the price you pay.\n",
  "yamu_rating": "We don’t like it",
  "url": "https://www.yamu.lk/place/sheherazade/review-65613",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_v5E0EK-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_v5E0EK-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_v5E0EK-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_EuJ26y-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_FdaflE-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_mqyYoA-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_ZyTvDk-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_454ltw-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_swvKrc-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_Sk8tsI-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_PcbKWy-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_Cd1MIH-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_79kLvH-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_Oj8jhL-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/08/bf9TdKPSlnqFHMaZrC.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_v5E0EK-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_454ltw-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_swvKrc-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_PcbKWy-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_Cd1MIH-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_79kLvH-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/04/yimg_zadtZN-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_mO5LNQ-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2016/09/QUGDvpn3blBZKntXcv.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_v5E0EK-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_EuJ26y-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_FdaflE-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_mqyYoA-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}