{
  "name": "Siam House",
  "address": "17 Melbourne Avenue, Colombo 4",
  "open_until": " Open 11:00 am to 23:00",
  "telephone": "112595966",
  "description": "Siam House serves up reliable and tasty Thai-fare, and they're built for volume and deliveries. ",
  "reviews": "Siam House serves up tasty, Sri-Lankanized Thai fare, and they're able to do it in high volumes. Their big restaurant and delivery service have served a generally happy clientele for over 20 years.\nColombo has gone from two Thai places to a lot, but Siam House still has a solid spot in our hearts. It provides the Sri Lankan Chinese restaurant experience (friends and family sharing a sometimes obscene amount of food) with satisfying Thai flavors. We wouldn't say it's authentic Thai, but it is an authentic experience.\nNo matter how we're supposed to eat it, a lot of Sri Lankans eat Thai (or Chinese) food like we would eat rice and curry. We get rice, a few sides and we mix it all together. Siam House works for that sort of dining. You could probably eat course by course but we actually prefer it this way.\nThe classics are the Thai red curry and green curry. Above is a beef red curry (Rs. 720). It was really good. Flavorful, tender and delicious. We can actually still remember it now. It comes with a generous amount of gravy which really savories up the rice.\nAnother stand-out was the papaya salad (Rs. 540). Just the right amount of acidity to make for a happy rice mouthful. They have more adventurous takes like the fish bowel salad, but we weren't ready for that.\nAnother reliable pick is their seafood selection. We tried the prawn with long beans (Rs. 970). A generous portion, and tasty, but we found ourselves going for the Thai red curry more.\nA note on portions, Siam House's portions used to be ridiculously huge. They're not so epic now, but they're still quite big. A small will easily serve three people, otherwise you get leftovers.\nFor service we normally just say  'it's fine', but we actually had a really nice experience here. The waiter was funny, seemed to enjoy his job and helped us decide what to order. He was also quite concerned that we liked it since he felt like it was his responsibility. I have a peanut allergy which is usually difficult for waiters to process (especially at Thai places) but he understood immediately and made sure there was nothing in what we ordered. Really pleasant guy.\nAnother aspect of their service you might encounter is their delivery/take-away, which is quite popular. We've found it reliable, but at certain peak times they can get quite busy.\nSiam House has a really big location on Melbourne Avenue (Bamba, between Galle Road and Marine Drive). You can sit on the verandah, and there's plenty of room for big parties upstairs and down. The ample space (and relatively available parking) makes it a good spot for groups.\nSiam House makes tasty Thai food, and they can serve big groups (or a few people) reliably. It's not the most authentic, but it is catered to a Sri Lankan palette and we usually have a good time there. They also deliver.\nSiam House serves up tasty, Sri-Lankanized Thai fare, and they're able to do it in high volumes.\nSri Lankan Chinese food and Japanese food are already very popular. The final piece to the Sri Lanka-East Asian fusion food puzzle is Siam House, Colombo’s main Thai restaurant.\n\nஇலங்கை பாணியிலான ஜப்பானிய சீன உணவுகளை தொடர்ந்து  இப்போது கிழக்கிந்திய உணவு முறைகளில் தாய் (தாய்லாந்து) உணவும் இலங்கை பாணியில் கிடைக்கின்றது. சியாம் ஹவுஸ் கொழும்பின் முக்கியமான தாய் உணவகமாகும்.  தாய் உணவுக்கும் இலங்கையின் உணவுக்கும் பல ஒற்றுமைகள் இருக்கின்றன. இரண்டிலும் தேங்காய்ப்பால் பயன்படுத்தப்படுகின்றது, காரமானது, மற்றும் கறிகளாக சமைக்கப்படுகின்றது.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/siam-house/review-36851",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2014/11/yimg_M8eneN-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2014/11/yimg_bAfx80-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2014/11/yimg_5qwv0P-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2014/11/yimg_GSJEEv-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2014/11/yimg_kqnhFb-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2014/11/yimg_ghPABy-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2014/11/yimg_mIiDHv-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2014/11/yimg_2F6R43-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2014/11/yimg_wWlEoJ-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2014/11/yimg_GasRKD-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/07/uzI50We9CRr1yYpFEF.jpg",
    "https://www.yamu.lk/uploads/files/2014/11/yimg_ghPABy-640x426.jpg",
    "https://www.yamu.lk/uploads/files/2014/11/yimg_M8eneN-640x426.jpg",
    "https://www.yamu.lk/uploads/files/2014/11/yimg_bAfx80-640x426.jpg",
    "https://www.yamu.lk/uploads/files/2014/11/yimg_GSJEEv-640x426.jpg",
    "https://www.yamu.lk/uploads/files/2014/11/yimg_5qwv0P-640x426.jpg",
    "https://www.yamu.lk/uploads/files/2014/11/yimg_2F6R43-640x426.jpg",
    "https://www.yamu.lk/uploads/files/2014/11/yimg_kqnhFb-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_YBjNF1-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_mOENRl-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2017/03/7SRXKC8evcP1puV5y6.jpg",
    "https://www.yamu.lk/uploads/dp/2017/03/7SRXKC8evcP1puV5y6.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2014/11/yimg_M8eneN-640x426.jpg",
    "https://www.yamu.lk/uploads/files/2014/11/yimg_bAfx80-640x426.jpg",
    "https://www.yamu.lk/uploads/files/2014/11/yimg_5qwv0P-640x426.jpg",
    "https://www.yamu.lk/uploads/files/2014/11/yimg_GSJEEv-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}