{
  "name": "Slightly Chilled",
  "address": "29A, Anagarika Dharmapala Mawatha, Kandy.",
  "open_until": " Open until 11:00 PM",
  "telephone": "0812238267",
  "description": "Quirky name, location with a near-aerial view of the city, and great food, more people need to know about Slightly Chilled.",
  "reviews": "Except for a rare few, Kandy has failed to impress us where the food scene's concerned. It's a popular notion among several Yamurais that food in that city (unless home-made) is rather disappointing. A friend noticed Slightly Chilled somewhere, and intrigued by the name (why isn't it completely chilled?), we popped in not knowing what to expect. What greeted us was a\nof chill, stunning views, friendly and casually comfortable service, and oh-so-good food.\nYou drive up a little hill to reach this, and it's slightly confusing because Slightly Chilled is also known as — or shares the same location as — Bamboo Garden. But then, there's a bright signboard and another sign next to a doorway which promises that you've arrived at the right place and that it's 'owned by British.'\nYou climb up a dark, dimly lit staircase and step over a Boxer (yes, pet friendly place!) and are greeted by a flurry of activity: waiters are all over the place, it's barely 8 PM and already packed.\nThere's a terrace-like balcony seating area overlooking the city lights and another section where it's a bit more calmer — couches and tables spread across, with a projector screening some stuff on the far end of the wall.\nThe Boxers (there are two), occassional waddle in and plonk themselves on the sofas.\nThey are adorable and seemingly want to do nothing but sleep in peace. The owner came and spoke to us a couple of times asking us if we'd like to shift to the balcony area because of the view, if we were comfortable where we were, and so on. We appreciate this gesture and think it's pretty great when the staff are actively and genuinely concerned about their customers/ guests.\nThey've got a decent section for vegetarian options, along with sandwiches, noodles, a variety of fried rice, and pastas. Add to this are their meats (chicken/ beef/ pork/ prawn/ cuttlefish/ fish).\nThe\n, so we picked out cuttle fish (a classic beachside dish and bite) to see how comparable it is to its counterparts around Colombo and the beaches, and their 'Fried Prawns Cooked in our Special Spicy Chinese Sauce'. A small portion comes with six prawns (Rs. 800) and a large portion (Rs. 1000) comes with twelve unshelled prawns. We went for the large.\nWe got a plate full of skewered, succulent prawns, a colourful dish considering the green and red chopped chillies which garnished it generously. We counted about four different types of miris fried and dried, and fresh ones as well. Brilliantly flavourful, this is a must-try and a YAMU Loves recommendation.\nThe secret sauce definitely has nai miris as the base, and this really hits you: not enough to have you crying, but enough to run slightly out of breath. Worth every penny.\nWe got a bowl of steamed rice (Rs. 100) to go with this and our Cuttlefish and Capsicum Fried with Salt and Pepper (Rs. 700). The rice was well prepared, not too dry or anything, but just a bowl of solid, good rice.\nThe cuttlefish was as good a contender as any of our favourite hot butter cuttlefish dishes in Colombo's beachside.\nIt's actually better than most places we've tasted, and has plenty of cuttlefish in the dish — as opposed to being 50% (or more) full of onions, capsicums and other dressings. Crispy, lightly battered, nicely salted and flavoured, this hits the spot. We could've had more.\nWe didn't try any dessert because it was fruits, ice-cream, and curd with honey.\nDrinks-wise, they've got local and international spirits and beers. The bar area is cozy and kind of in the middle of both seating areas, so it's buzzing as people keep walking around. You can\nWe skipped the alcohol and tried one each of their fruit juice, mocktails, and milkshakes.\nOur Chocolate Milkshake (Rs. 330) was creamy and nicely chocolatey, and was also slightly chilled properly. Nothing spectacularly good, but it's a solid milkshake. The Lime Juice (Rs. 220) was just what it should be — acidic without being\nsour, and not doused in ridiculous amounts of sugar. On the far right of the picture is our mocktail, the Kandy Chilled (Rs. 200). This is basically lime and sprite, so it's an aerated version of the lime juice.\nWe really like this place. It's loud (in a good way), it's got great food, and it's very chilled. It's mostly full of tourists though, and we were almost the only locals there. Shoutout to this place for there being no discrimination unlike many other touristy areas we've been to!\nI'd totally recommend this, so head over there next time you're in the area.\n",
  "yamu_rating": "We love this!",
  "url": "https://www.yamu.lk/place/slightly-chilled/review-115324",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_hWU1tl-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_5o3OsR-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_rHc5W1-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_RQSV7M-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_Bbbi09-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_tadCfB-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_KSv2d5-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_lbF69O-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_daXS7I-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_5yfe5t-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_JMkbgy-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_5R5wed-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_M9KX7C-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_ha1zIB-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/08/bf9TdKPSlnqFHMaZrC.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_M9KX7C-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_ha1zIB-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_tadCfB-320x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_lbF69O-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_5o3OsR-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_daXS7I-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_Bbbi09-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_rHc5W1-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oKIYgP-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/05/yimg_vsJCcO-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_hWU1tl-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_5o3OsR-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_rHc5W1-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_RQSV7M-320x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}