{
  "name": "Spice & Ice (Omega Regency Hotel)",
  "address": "324, Galle Road, Wellawatte, Colombo 6",
  "open_until": " Open 6.30 AM to 11 PM",
  "telephone": "0112582277",
  "description": "With promos all week, you can get a good deal on biriyani and nasi goreng.",
  "reviews": "Spice & Ice is a restaurant at the Omega Regency Hotel. They've got promotions on nasi goreng, biriyani and mongolian rice, and even pizza on the weekends. The prices won't make a huge dent in your wallet but the food won't make much of an impression on you, either. Aisha and I stopped by for lunch.\nYou have the option of noodles, rice and pasta, with meat options of chicken, beef and seafood. We decided to see how well they do their hot butter cuttlefish. For the price, we got a good portion and it was fairly seasoned. The batter didn't have quite the same crispy crunch of the HBC we love, and was actually too tough at some points. All the pieces are cut by length, and there are no tentacles.\nTo go with the cuttelfish, we ordered a portion of egg noodles. These were pretty standard fare, Harischandra type noodles seasoned with plenty pepper and speckled with carrots and leeks. It's a good amount to fill one up, or two if you're not super hungry.\nOff the promos, we tried the 1/4 chicken with Mongolian Rice and honestly it was a disappointment. The hind quarter we were served was quite small and came with a tomato sauce. We bit into it to find that it was quite rubbery and dry, possibly because it was reheated. We're not taking any guesses as to when the chicken was prepared. It had a super smokey flavour, though, so it's a shame that it wasn't fresh. The rice was just okay - your typical mongolian fried rice.\nWe were served complimentary dessert. A trifle of jelly, custard and cake. The cake was dry, and the rest was fine. A sweet touch to the service.\nThey offer fresh juices at Spice & Ice, so we tried the orange juice and papaya juice. Both were fairly watered down, but definitely made of real fruit. For the price, you can get better juices elsewhere, but these are refreshing enough if you just want something to wash down your meal.\nSpice & Ice feels more like a little cafe than a restaurant. It's a pretty small space with a glass window as a wall, letting in plenty sunlight off the streets. The service is prompt and lets you be.\nIf you're in Wellawatte and you're looking for lunch, here's a spot that won't break bank but won't make you break a smile, either. They do hoppers in the evenings, which are way more worth it. Otherwise it's a pretty mediocre spot.\nIf you're in Wellawatte and you're looking for lunch, here's a spot that won't break bank but won't make you break a smile, either.\nWhilst driving through Wellawatte struggling to find a decent place to eat, I came across a little sign that read “Spice & Ice,” hanging from an attractive looking building - The Omega Regency Hotel. The inside of the restaurant is a bit run down compared to the lovely look from the outside but it is a convenient little place to grab some short eats and a drink. They also do fried rice and a pretty good rice and curry for lunch.\n\nවැල්ලවත්ත හරහා වාහනය පදවාගෙන යන ගමන් මම කෑම කන්න හොඳ තැනක් හොයාගන්න ගොඩක් මහන්සි වෙන අතරෙදි මම දැක්කා ‘ස්පයිස් ඇන්ඩ් අයිස්’ කියලා ගහලා තිබුණ පුංචි සලකුණක් ආකර්ෂණීය ගොඩනැගිල්ලකින් එල්ලිලා තියෙනවා. - ඔමේගා රීජන්සි හොටෙල්. එළියේ ලස්සනට තිබුණට හෝටලේ ඇතුල් පැත්ත තරමක් පරණ පාටයි. ඒත් ඒක ෂෝර්ට් ඊට්ස් ටිකක් කන්න නැත්නම් බීමක් බොන්න හොඳ සුවපහසු පුංචි තැනක්. එයාලා දවල්ට ෆ්‍රයිඩ් රයිසුයි හොඳ රයිස් ඇන්ඩ් කරියි හදනවා.\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/spice-ice-omega-regency-hotel/review-96763",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_TrPWkm-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_xMkLfP-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_utY4Nk-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_X1hC9k-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_5Mkvsg-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_HkEGXv-150x100.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_ktB9mg-150x100.JPG",
    "https://www.yamu.lk/wp-content/uploads/2013/05/spice-ice-2-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/05/spice-ice-3-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/05/spice-ice-1-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/05/spice-ice-4-150x105.jpg",
    "https://www.yamu.lk/uploads/dp/2015/12/0F34X3pTfLr7btifJN.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_TrPWkm-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_xMkLfP-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_utY4Nk-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_HkEGXv-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_5Mkvsg-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_X1hC9k-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_ht1uSm-600x250.JPG",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_ILNPFo-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_TrPWkm-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_xMkLfP-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_utY4Nk-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_X1hC9k-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}