{
  "name": "Sri Suryas",
  "address": "255, Sea Street, Pettah, Colombo 11.",
  "open_until": " Open 7 AM–10 PM",
  "telephone": "0112424789",
  "description": "Crammed into a congested street in Pettah, Sri Suryas is an unassuming restaurant that serves a mean ghee dosa, among other things.",
  "reviews": "Every now and then, dear reader, I am assailed with the longing for the sort of crisp, paper-thin, ghee-soaked dosa that reminds me of home. At those times, no pale imitation will do. A few months ago, crammed into a congested street in Pettah that heaves with people, vehicles and activity by day, I found a non-descript restaurant that satisfies that specific craving.\nA classy\nif there were one, Sri Suryas is a respectable vegetarian joint on Sea Street that disarms you with its sparkling clean floors and general cleanliness. Having always visited at night, I have only tried the a la carte menu of dosas, v\nand other snacks, apart from a few north Indian dishes. If you visit for lunch, you can try the south Indian\n(and tell us how it is, in the comments section).\nGetting straight down to business, we ordered the ghee roast dosa (Rs. 230), the golden standard by which I evaluate any south Indian joint. Suryas passes the test with flying colours.\nA crisp, butterscotch-coloured cone that you can smell even before you have torn off a piece and popped it in your mouth, Suryas' ghee roast throws down the gauntlet to all the other competition other there. Decadent and fragrant, it renders the accompanying chutneys and\nirrelevant. Having demolished one in record time, our fingers greasy after just a couple bites, we ordered a second one — and it met with the same swift treatment. If we had one gripe, it would be that the dosa\nwas not as hot as we would have liked it. Speedier service would have heightened our enjoyment of it by one crucial notch.\nThe general opinion was a little less unanimous when it came to the sambar\n(Rs. 180) — two\nsoaked in a vat of\n, crowned with a topping of finely chopped onions and coriander. If you prefer to eat your\nfresh off the fryer, you may be disappointed by the soft, crumbly texture they acquire when dunked in\n.  On the flip side, the thick and tangy\nlaced with tamarind is hard to find fault with.\nIf you focus on the fact that the deep-fried\n(Rs. 120) comes with a small smattering of spicy salad on top, you may less guilt about the deep-fried carb fest that is inevitable while eating at Suryas. Essentially a large\nladen with finely chopped cucumber, onions, tomatoes and coriander stems, spiked with chilli powder, the\nis a textural treat. It is usually ordered as a starter to whet your appetite for the courses to follow. But the tardy service at Suryas ensured that we got it midway through our meal. Not like that did anything to dampen our spirits, because it vanished before I could say\n.\n\nAfter scanning through the exhaustive menu that lists well over a dozen north Indian and Chindian (or Indian Chinese) dishes—including peculiarities like\nor crisp-fried cauliflower in a red sauce that my mum would wholly disapprove of—we narrowed down our choice to the\nbutter masala (Rs. 435) and garlic\n(Rs. 185). Although the\ncould have been less rubbery, the tomato-based gravy was rich, tangy and nearly perfect, except for a slight additional sweetness that was unnecessary. It was a respectable rendition of a north Indian classic that many restaurants get wrong, especially when paired with the soft\n.\nI've already waxed eloquent about the\nat Suryas (Rs. 110), but indulge me for a moment while I tell you about the sweet, hot, frothy brew that I was positively overjoyed to discover. In a close race with\nfor the best filter coffee in town, Suryas' version is a wonderful way to wrap up your meal, if you're not enticed by the attractive display of Indian sweets at the entrance.\nExcept for the fact that some of the food wasn't piping hot when it reached our table, we didn't have any major issues with the service. The energy dips by the fag end of the day, but that's totally understandable.\nA clean, air-conditioned space separated into booths by glass partitions, Suryas is fairly utilitarian in design. But the tables are spotless, the floor isn't grimy and everything looks kosher in general. That's more than you can say for most\nin this city.\nWith dosas going up to nearly Rs. 400 and north Indian dishes costing close to Rs. 500, Suryas isn't what you'd call dirt cheap. However, after a couple of visits in the recent past, I can vouch for the fact that the standard—especially of the dosas\nis uniformly high. The location may be a tad inconvenient and parking a nightmare to find, especially during the day, but at least you can be sure that for your toil, you will be rewarded with a ghee roast beyond compare. In our book, that's plenty.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/sri-suryas/review-57355",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_DpeQiB-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_HNWfh8-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_dZIxVD-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_APCb9V-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_OGHv20-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_s1tmYM-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_m4YnwQ-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_EOSfji-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_DpeQiB-640x437.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_APCb9V-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_dZIxVD-640x443.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_HNWfh8-640x447.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_OGHv20-640x500.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_EOSfji-640x409.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_FpRrPv-600x250.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/07/DSCF0793-588x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_DpeQiB-640x437.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_HNWfh8-640x447.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_dZIxVD-640x443.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_APCb9V-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}