{
  "name": "Star Dogs",
  "address": "Majestic City, Food Court, Bambalapitiya, Colombo 04",
  "open_until": " Open until 08:00 PM",
  "telephone": "0717775777",
  "description": "Star Dogs is a hotdog stand that's been lurking at MC for a while now. We dropped by to see how they're doing.",
  "reviews": "Amidst the throng of school children and families at MC's food court, there's a hotdog stand somewhere in the corner. Although nobody knows exactly how/when this stall popped up, it's been around for a while and doesn't seem to be declining. They used to be really good, but our recent visit left us a little disappointed.\nThis is going to be a really short review. Why? We got three different hotdog varieties and all three tasted and looked the same. I also made a stupid mistake and got the regular size when everyone I know recommended the jumbo sized hotdogs. Oy vey.\nThe hotdog purchases made are as follows: Chilli Garlic (Rs. 240), Cheese & BBQ (Rs. 250) and Chilli Cheese (Rs. 280). Note that these are the prices for regular sized hotdogs. You'll have to pay about 50-100 LKR extra if you want the larger portions.\nEach of these hotdogs tasted exactly the same. There was nothing to differentiate one from the other and at one point we lost track of what we were eating.\nThe hotdogs come in a large, fluffy bun. The sausages are boiled so they don't taste like anything. They're generously drizzled with a mildly spicy sauce and onion bits. One of them had cheese on it but we couldn't be sure. That's literally all that was on there. Nothing else. We ate in silence.\nThere's one guy manning the counter and he's quite fast.  The speed isn't impressive when you're being served the same thing in large quantities. I suppose you'll just get used to it over time.\nThe stand is by the exit. It's bathed in red as a result of the glaring neon light they have on display. You can go there after 8 PM and pretend you're walking down NYC but neither the ambience, nor the hotdogs are as interesting.\nHonestly, I have no idea whether to recommend this place or not. For one, their portion sizes are large so the price is fair. On the other hand they lack variety and flavour which is annoying. I suggest this place for a shameful quick drop-by for lunch or whatever, but don't take your friends there.\n",
  "yamu_rating": "We don’t like it",
  "url": "https://www.yamu.lk/place/star-dogs/review-183635",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/06/yimg_6lJWNI-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/06/yimg_MagzRX-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/06/yimg_RyU5T5-150x100.png",
    "https://www.yamu.lk/uploads/dp/2017/01/sFOlV64o5GU2djDVqy.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/06/yimg_6lJWNI-640x445.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/06/yimg_RyU5T5-640x458.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_4jDKkH-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_Qg8Gyt-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/06/yimg_6lJWNI-640x445.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/06/yimg_MagzRX-640x424.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/06/yimg_RyU5T5-640x458.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}