{
  "name": "Sugarcube",
  "address": "No. 15, Duplication Road, Colombo 04",
  "open_until": " Open until 10:00 PM",
  "telephone": "0114330552",
  "description": "Sugarcube is the newest cafe to grace Duplication Road. With its cutesy and warm ambience, it was an instant favourite! ",
  "reviews": "Colombo has its fair share of kopi kadés but it still keeps spawning new ones every other day. This is a good thing for all of us involved because each new bistro is a new experience.\nHow was Sugarcube, you ask?\nWe loved it.\nThey've got an impressive list of teas from Milk Tea to Lemon & Honey and a small list of basic coffees from Cappuccino to Mocha. They've also got different syrups like Irish Cream, Hazelnut and so forth.\nTheir Masala Chai (Rs. 200) is served in a cute teapot accompanied with\nand - get this - an adorable little clay pot to drink from. I don't know what it is about clay pots and why not a single hipster cave here in the city has stolen this marvellous idea, but I was\n.\nAt first sip, the masala tastes like it's been watered down and the tea isn't as thick as I'd have liked, but it got better once we added 2 sugarcubes and stirred the drink vigorously.\n\nWe struck gold by ordering their Cappuccino (Rs. 380). We also asked for Irish Cream syrup (Rs. 100 per pump) to go with it because why not.\nTh coffee was served with two tiny cookies that had an overwhelming taste of almond essence.\n\nThe Cappuccino was deliciously rich and topped off with a thin layer of heavy foam. We asked about what type of coffee they use but the lads there looked a little taken aback and answered with a short 'Arabica,' so we took their word for it because the taste of finely ground Arabica beans did come through.\n\nThe Irish Cream that was used is the synthetic, non-alcoholic counterpart to its heady original, but it made for a pleasant addition.\n\n\nThey serve home-baked cakes and at the time they only had two different varieties which is excusable because the shop is only 2 weeks old.\n\nWe opted for the Red Velvet Cake (Rs. 380) which is a brick of a slice with a lovely deep red colour to it and silky cream cheese icing.\n\nHowever, the cake itself was rather dense and tasted a little like it had been resting on the counter for too long. The saving grace was the icing.\n\nTheir Blueberry Cheesecake (Rs. 380) was amazing - rich and fluffy with a light, biscuit base. It was topped off with, as you can see, a handful of fat, juicy blueberries along with a blueberry sauce topping.\n\nThese were fresh blueberries mind you and they burst with every bite which was a real delight.\n\nVishvi and I kept oohing and aahing to each other with blueberries stuck in our teeth. Not a pretty sight, but it didn't matter. We're already talking about going back tomorrow for lunch.\nSpeaking of lunch, these guys serve up an excellent rice and curry. The food is 100% homemade and is served in recyclable cardboard boxes with recyclable wooden spoons and banana leaf lining. They were nice enough to heat the cartons up for us before we left.\nBoth packets were fresh, warm, presented beautifully, and undoubtedly healthy. A few of my colleagues remarked that it tasted exactly like the works of their respective matriarchs and if that isn't a great compliment I don't know what is.\nThe place is extremely tiny and would be a tight fit if more than 5 people were to visit. It's very cosy with brightly coloured cushions and a light, cinnamon aroma in the air.\nThe guys manning the cafe are friendly and super attentive. After an hour of chatting, we were asked if we wanted the Masala Chai re-heated which was an excellent and thoughtful offer.\nIt's rather uncharacteristic of me to gush over a cafe, but this place really got me hooked. I sincerely hope they keep up their current standards because they're looking at a successful customer base in the long run.\n\nThey serve lunch at around 11:30-12:30 every Monday to Friday, so if you're in the area be sure to try these guys out.\nSugarcube is Duplication Road's newest cafe entrant. We dropped in and discovered that we might possibly have a new favourite cafe.\n\nකොළඹ කොහේ හිටියත් අනිවාර්යෙන් ම ගොඩවෙලා යන්න ඕනේ කැෆේ එකක් තමයි මේ ෂුගර් කියුබ් එක.\n",
  "yamu_rating": "We love this!",
  "url": "https://www.yamu.lk/place/sugarcube/review-191085",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_3torNy-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_o2xCia-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_Ewxyhe-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_atqz56-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_T1QiZk-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_tD8OXl-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_roLNcs-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_JtQo4N-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/02/yimg_q2PM08-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2017/01/sFOlV64o5GU2djDVqy.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_roLNcs-640x510.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_T1QiZk-640x422.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_atqz56-640x452.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_Ewxyhe-640x449.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_3torNy-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_tD8OXl-640x394.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_JtQo4N-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/02/yimg_O1b66I-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/12/yimg_GdoPPK-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2018/05/sIJAcEVxrFdIsRfn2v.jpg",
    "https://www.yamu.lk/uploads/dp/2018/05/sIJAcEVxrFdIsRfn2v.jpg",
    "https://www.yamu.lk/uploads/dp/2018/06/8vWkh5taQ5CVDJgqpQ.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_3torNy-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_o2xCia-640x408.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_Ewxyhe-640x449.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_atqz56-640x452.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}