{
  "name": "Suki's Wok",
  "address": "411/5 Havelock Road, Colombo 6",
  "open_until": " Open 11.30 AM to 2.30 PM, 6 PM to 9.30 PM",
  "telephone": "0114740877",
  "description": "Suki's Wok is one of the oldies when it comes to Chinese eateries in Colombo. Nowadays they're mostly into delivery, so we tried it, and they're okay.",
  "reviews": "Suki's Wok is one of few delivery-only Chinese eateries in Colombo. While they have dropped the ball in a few areas, we still think it's one of the better choices for Sri Lankan Chinese on wheels.\nSuki's has actually been around for quite a some time evolving from a sit-down restaurant to pure delivery.\nTheir menu is quite similar to other Chinese places, besides the fact that they only offer one portion size (enough for three to four). That being said, it feels like the portions (besides the rice and chicken) have gotten smaller since laste year. Price-wise, Suki's Wok is also in the median range, around Rs. 600 - Rs. 1000 per item.\nI'm not going to go into detail about their fried rice (Rs. 600) since it's basically just average. A portion large enough to easily feed four, adequate seasoning and a decent amount meat, but still unremarkable.\nThe hot butter cuttlefish (Rs. 680), while not the best we've had, is still one of the better choices when it comes to delivery. The relatively small cuts make it easier to eat, while also packing more flavour. The cuttlefish itself was okay but still slightly chewy. The batter on the otherhand, was crunchy and well seasoned with a bit heat from the chilli flakes.\nChicken dishes usually tend to be the most boring options when it comes to Chinese restaurants in Colombo, so we were surprised by the Singapore style chicken (Rs. 740), which was pleasantly flavoursome. Now I'm not quite certain what \"Singapore Style\" exactly means here but from what we tasted, they seemed to be going for a similar flavour to that of a Singapore chilli crab and it worked pretty well.\nFirst off, the chicken wasn't over cooked which is always a big plus when it comes to Sri Lankan Chinese. Some may not be too happy about the fact that the chicken isn't boneless, but we didn't really mind since I find meat on the bone more flavoursome than say chicken breast. What really brings this dish together, however, is the gravy. It was thick, lightly spicy and had a nice umami flavour, which in turn binds to the chicken.\nThe barbeque belly pork (Rs. 660) looked promising, but ultimately ended up disappointing. The barbeque sauce was actually tasty, but the pork was completely overcooked; all hard meat and poorly rendered layers of chewy fat. So sad.\nWe also tried two of their prawn dishes, namely the prawn with black bean (Rs. 800) and the sweet and sour prawns (Rs. 800). The former was an interesting preparation with the flavour of the black bean coming through well. The only issue was that the dish didn't really have much prawns in it.\n\nThe sweet and sour prawns, on the other hand, were excellent. At long last we'd finally found a sweet and sour prawn dish that doesn't suck. In most cases the sauce is too sweet, or the batter is soggy with just a tiny piece of prawn hidden in side. Not the case with this one. You get 12 respectably sized, well cooked prawns with a thick yet crunchy and flavoursome batter. The sauce was also on point with an almost glaze like texture and a relatively well balanced sweet and sour sauce.\nSuki's delivery isn't the fastest, so order as soon as possible since it generally takes them around an hour to deliver. One thing we weren't thrilled to find was that some of the sauces had spilt inside the cardboard container. You can call them up on\nAs far as Chinese delivery goes, Suki's fares pretty well. That being said, they've definitely got room for improvement both in terms of food and delivery. If you find yourself randomly craving Sri Lankan Chinese, these guys are a decent bet.\nSuki's Wok is one of Colombo's few delivery only Chinese eateries in Colombo. While they have dropped the ball in a few areas, we still think it's one of the better choices for Sri Lankan Chinese delivery.\nSuki's Wok is one of the oldies when it comes to Chinese eateries in Colombo. Nowadays they're mostly into delivery, so we tried it, and they're okay.\nSuki's Wok is a little Chinese restaurant down Havelock Road. They used to be somewhere on/near Kynsey Road, but apparently the government shut them down for being an 'unauthorised building'. Happily, they managed to open up again not too soon after the incident.\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/sukis-wok/review-59756",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_5ENAFE-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_UCkaY5-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_uh2I3x-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_YsDTTy-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_emCvin-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_cutbQb-150x100.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/10/DSCF0388-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/10/DSCF0372-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/10/DSCF0366-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/10/DSCF0374-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/10/DSCF0363-150x105.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_uh2I3x-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_emCvin-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_YsDTTy-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_cutbQb-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_UCkaY5-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_5ENAFE-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/02/yimg_vkzUwR-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_7itVgH-600x250.JPG",
    "https://www.yamu.lk/uploads/dp/2016/02/IJIBS4jxZQsZJFls0R.jpg",
    "https://www.yamu.lk/uploads/dp/2016/08/XeyiyT47QP0lwSxe3a.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_5ENAFE-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_UCkaY5-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_uh2I3x-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_YsDTTy-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}