{
  "name": "Sushi Kai",
  "address": "143A, Jawatte Road,  Thimbirigasyaya.",
  "open_until": " Open 11 AM - 10.30 PM",
  "telephone": "0771566568",
  "description": "Sushi Kai is the new Japanese restaurant that's taken up the former location of Kami Maki. It may look familiar, but they fall well short when it comes to flavour and quality. ",
  "reviews": "Sushi Kai is the new Japanese restaurant that's taken up the former location of Kami Maki. They've pretty much changed nothing in terms of ambience, and the menu is more a less a clone of the former tenant's. The food, however, was underwhelming at best and the sushi (considering the name) was just plain amateur, with the only positive being the friendly service.\nI actually drove past Sushi Kai a couple of times over the past few months before finally realizing that it wasn't\n. You can't really blame me here since the place looks identical to the latter.\nOther than the logo, nothing has really changed, like they haven't even moved a table. Same little counter on the ground floor, same table set up on the second floor. It's not terrible ambience but let's just say having a private conversation is impossible if another table is occupied.\nJust like the look of the place, the menu at Sushi Kai is unmistakably similar to that of Kami Maki, both in terms of cost and variety. The prices aren't too high but expect to pay between Rs. 1000 - Rs. 1500 to have a filling meal. The menu offers a decent selection of Japanese staples as well as ''fusion'' dishes though none of which we tried impressed us in any way. We ordered a few different dishes and from our experience it seems they haven't fully grasped the meaning of the word ''appetizer\", since the order in which the dishes were served didn't make sense.\nThe first items to be served were the nigiri (Rs. 160 - Rs. 220), which has to be ordered individually. We got the salmon, tuna, shrimp and eel, but as you can see by the photo, the eel came to the table much later. With a name like Sushi Kai, you'd expect the sushi to be of a certain standard but the construction of this nigiri was terrible.\nJust look at this sad tuna nigiri. Uneven shape, poor knifemanship and just way too much wasabi. Don't get me wrong I like wasabi as much as the next guy, but it should supplement the flavour, not completely overpower it. The seafood wasn't too fresh either so this basically had no redeeming qualities. These three cost us Rs. 560 whereas the same combo could be had for Rs. 450 at\n, for nigiri of far superior quality.\nStill no appetizer...\nNext came the shichimi beef (Rs. 600), which is basically pan fried beef in a shichimi sauce. Again, as far as quality of ingredients goes, this is was as bad as it gets with chewy, flavourless beef. This was more or less chewing gum in shichimi sauce. The only good thing was that the sauce itself was flavoursome with a nice kick of spice, but the beef was just overcooked, and it took us just a few bites to set it aside.\nStill no appetizer...\nThe rainbow roll (Rs. 780) sounded great on paper with tuna, salmon, crab meat and avocado. However, the actual dish fell short of our expectations yet again. The biggest problem here was the lack of uniformity (which you can see in the photo), so no two maki tasted the same. The ones with more tuna tasted better, while in the case of the others, all we tasted was avocado. It's a good concept but fails in terms of execution, especially if you're sharing it with someone else. We were just staring awkwardly at the ones with more avocado, politely offering it to the other while secretly not wanting it.\nAnd at long last our appetizer- the tuna tartar (Rs. 740) arrived - after we'd finished the rest of our meal. It's ironic since we likely would have started the meal off happier had we got this first because this was the only dish we didn't have any issues with. This was basically layers of yellow peppers, avocado and tuna, topped with diced scallions and an egg yolk. This was also on the creamier side, but the scallions and peppers added a contrast of textures and a bit of soy sauce brought out the flavour of the tuna and gave it that saltiness that it needed.\nThey only had their tempura fried chocolate brownie (Rs. 420) for dessert, so we went with it. This comes with a ton of tempura batter thrown on the plate as well as a few scoops of vanilla ice cream. We didn't really care much for the brownie, but the combination of the savoury, warm tempura batter and the ice cream actually worked well together. That being said, practicality isn't really their strong suit so eating this on a flat plate can be painstaking since both the ice cream and tempura will almost surely spill over.\nThankfully, the service was more acceptable than the food. Even at that the dishes didn't come to the table particularly fast, considering the fact that only the beef required actual cooking. On a more positive note, the waiters were friendly and actually had a fairly good grasp of the menu.\nConsidering the contemporary\nin Colombo, we really can't recommend Sushi Kai for anything. It may look familiar, but they fall well short when it comes to flavour and quality.\n",
  "yamu_rating": "We don’t like it",
  "url": "https://www.yamu.lk/place/sushi-kai/review-66494",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_dEK1YK-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_on5Hdt-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_HALej5-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_OvakUa-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_HQ0L4I-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_OuM9zc-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_nmVDZq-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_IW4Wtq-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_IW4Wtq-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_HQ0L4I-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_dEK1YK-640x423.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_nmVDZq-640x407.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_OuM9zc-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_on5Hdt-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_OvakUa-640x421.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_HALej5-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_pUvcdD-600x250.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_sdbGWc-600x250.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/user/2018/03/yimg_oHptxxq4G0eGJOmxvG-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/user/2018/03/yimg_dObonFSdInSAMxcIug-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/user/2018/03/yimg_2OSsbQjYSSEkrXPZXT-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/user/2018/03/yimg_oHptxxq4G0eGJOmxvG-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/user/2018/03/yimg_dObonFSdInSAMxcIug-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/user/2018/03/yimg_2OSsbQjYSSEkrXPZXT-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_dEK1YK-640x423.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_on5Hdt-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_HALej5-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_OvakUa-640x421.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}