{
  "name": "TACOCAT",
  "address": "11 Wijerama Mawatha, Colombo 07 00700",
  "open_until": " Open until 10:00 PM",
  "telephone": "0774795505",
  "description": "Wordplay and visuals aren't the only clever things at TACOCAT.",
  "reviews": "Tacocat, tacocaT, see what I did there.\n. Tacocat is a small pop-up operating out of\nin Ward Place. It's seemingly run by one guy, Matt.\nThere's been a lot of Mexican food in Sri Lanka lately, by a lot I mean about two places that sell them excusively in Colombo, and a few others that have included it in the menu. And by Mexican I mean Tex-Mex, a fusion of Mexican and American food, though Tacocat comes a little closer than either of the above to being more purist.\nWe've tried out\nand\n, and prefer the latter to the former by a long shot (very long). But coming in at a price range right in the middle of these two, Tacocat offers what neither of these two places do, Tex-Mex that is specifically designed to be healthy, while also delivering a wholesome punch to your tastebuds.\nHere you won't find destructive abundances of cheese and other flavors that play a seductive game of teasing your tastebuds, covering up a lack of actual substance (*cough* Taco Bell *cough).\nIf your anxiety problems interfere with your decision making processes, then you'll love eating at Tacocat. You can either get Tacos, Burritos or a Nudie Box (basically a burrito without the wrap), and you have a carefully guided, cafeteria style selection process in which you essentially get to build your own tacos and burritos, and don't have to stress out to know what is best to add. All three items are priced at Rs. 999, (you get three tacos for the price), add-ons like Guacamole (Rs. 100) cost extra.\nEverything else is rather stripped down and minimalist. And pink. They only serve soft tacos, and don't make drinks, though you can buy standard, off the shelf soft drinks here and can BYOB no problem. If you need anything more sophisticated there's always Black Cat next door.\nAll produce is locally sourced except for the jalapenos. The tortillas are made of wheat and not corn, yes this is sad. But they're not actually all that bad. Tacocat says it might start making its own corn tortillas though, hey if you want something done right, right?\nBurritos are larger, so you can add more stuff in them. For the tacos, since you get three for Rs. 999, we suggest trying various different combos. Or get a single taco for Rs. 400. Now that you decided the wrapping, it's time to get to the filling. Yum yum.\nAt the first station, I'd strongly suggest picking some brown rice. Not only will this make your mother happy, it will also add some munchiness to your wrap which will blend really nicely with all the other flavors you are going to subsequetly put in. Also hey, why pass up a chance to have rice and curry AND a burrito, all at the same time. What?\nThe Chicken was our favorite, it had some neat flavors working in there and was spicy, but not a full-frontal attack kind of spicy, more like a flank assault in which the chillies are crowding onto your tastebuds along with a host of companion flavors that dilute it, and make their own voices heard (my incompetent military metaphors do not do it justice).\nThe taste of the beef becomes less distinctive once you combine it with everything else, also being minced, it's texture becomes a tad muted also. Not to say it isn't good. The slightly sweet aftertaste it gives is a particularly nice touch.\nVegans and Vegetarians rejoice. The Beans are more than competent to give you a meat-like texture (sorry, is that an offensive thing to say? like, why does anything have to match up to a meat like texture? none of us are meat-supremacists here) while packing its own distinctive spice-backed flavor. If you can't decide what to get, simply get a bit of all three.\nOh, and seafood is not an option. Sorry, pescatarians.\nAt the second station, the pickled cabbage is a star. There's also cabbage of the unpickled variety, both add a nice element of crunch. Not everyone is a fan of jalapenos (I don't know why), but I like to pack a fair bit of these little buggers in. Special note: everything here is finely chopped so that it blends nicely in the gullet. Effort that pays off.\nHere you can also find coriander (a nice little Sri Lankan addition) and pineapple. Let me stop here to just say that the pineapple is awesome. How it reacts with everything else in your mouth as you eat puts my fledgeling food-vocabulary to shame. So trust me on this and just get the boody pineapple.\nAt station 2 there is also nicely balanced salsa and grated cheese. Machang, you can't have Tex-Mex without salsa and cheese.\nNext, the sauce. Like we mentioned, the Guacamole costs Rs. 100 extra, but is worth it. But you can also get alioli and a range of spicy sauces going from mellow to super spicy for free.\nDon't worry too much about being adventurous here though. Even their spiciest sauce, 'Call the Priest', which is made out of the intimidating cobra chili a.k.a\n, has been diluted enough to prevent it from killing customers with instant heart attacks. All very manageable (in the end).\nIf you're familiar with Black Cat, Tacocat basically occupies its garden and outdoor seating area. It opens for business at 5 PM and you have nice quiet, green spaces to enjoy your food and a nice chat with friends in. The place isn't anal about you overstaying your visit, though spare a thought for them if it is getting crowded, so BYOB if you like and relax.\nMatt's one-man service operation combines suave charm with remarkable efficiency. At any given moment he's having involved conversations with customers and making burritos, or taking pictures for his nicely curated Instagram feed. I even spotted him politely evicting a humongous rat that ventured into the garden from the drains and gutters of Colombo, always only a hoots distance away. There's always something exciting going on at Tacocat (also, TacoRats? lol - I stole that joke from Matt).\nHealthy Tex-Mex that won't put a massive dent on the wallet, and won't give you a guilt trip about not going to the gym. The service and ambience is legend. I went back three times in the same week. Tacocat is planning on delivering soon, as well as opening up in time for lunch. Word is that they might also start up a new location. We'll keep you posted.\nHealthy tex-mex that won't put a massive dent on the wallet, and won't give you a guilt trip about not going to the gym.\n\nමෙක්සිකන් කෑමකට ලංකාවේ ට්විස්ට් එකක් ගලපන්න සමත් වෙලා තියෙන තැනක් තමයි මේ ටාකෝකැට් එක.\n",
  "yamu_rating": "We love this!",
  "url": "https://www.yamu.lk/place/tacocat/review-209488",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_EwPIu2-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_7CA1iU-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_EBauTx-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_AuJp6G-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_GLbrzZ-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_yj8AWD-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_a3KdPG-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_MRiXdx-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_gTNTCW-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_zfeCar-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_9DJYFT-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_ywMFzL-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_TZcEtK-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_VKsW6Z-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/05/yimg_WqdlEm-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/05/yimg_qHyJ4e-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/05/yimg_Pesh1e-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/05/yimg_M9UW4f-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/05/yimg_YDWApQ-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/05/yimg_8jyXT1-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_TZcEtK-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_zfeCar-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_EBauTx-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_MRiXdx-640x484.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_AuJp6G-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_GLbrzZ-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_ywMFzL-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_EwPIu2-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_7CA1iU-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_yj8AWD-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/05/yimg_1WNoQ6-600x250.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_UGyXYO-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_EwPIu2-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_7CA1iU-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_EBauTx-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_AuJp6G-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}