{
  "name": "Tagine",
  "address": "47 Thimbirigasyaya Rd, Colombo 5",
  "open_until": " Open until 11:00 PM",
  "telephone": "0767805242",
  "description": "Tagine is a new restaurant that shares the same building as Pho Vietnam. They  claim to serve Authentic Moroccan Cuisine, but it's really just a mix of dishes from various Middle Eastern/North African regions. ",
  "reviews": "Colombo has no shortage of restaurants but we're still missing out on traditional middle eastern/mediterranean cuisine. Taking on this particular niche is a laborious task, much like finishing a regular portion of\nor\n. It ain't easy.\nTagine does a surprisingly good job with their dishes, but although they claim to serve authentic Moroccan cuisine, their menu is a mix of food from different regions. Aside from their tagines, of course.\nWe started off with a Malsouka (Rs. 420) which is really the given name for the type of pastry used. A lot thinner and crispier than your average filo, this dish hails from Tunisia and is a common occurence in every bakery, supermarket or marketplace there.\nOurs was stuffed with chunks of tuna, olives, and diced vegetables - all infused with a delightfully sour sauce. It looked a lot better when it was served as opposed to the picture- that's my fault because I got a little overexcited and dug in before I remembered we were on the clock.\nThe pastry was light, crispy and the whole thing works as an excellent starter- light, sour and refreshing.\n\nA 'tagine' is a special type of Moroccan dish. It's literally a dish - an earthenware utensil, the tagine is used for any and all cooking purposes and serves as a versatile instrument. They love it so much, they named the food dish after the dish dish.\nWe got ourselves a Beef Tagine (Rs. 780). This came with large nuggets of tender, well-cooked beef, an assortment of seasonal vegetables and the richest beef gravy I've had in quite some time. The beef had soaked up all the gravy making every bite a luscious, spice packed, juicy treat. We loved it.\nThe vegetables (potatoes and carrots) were nice and soft, sort of like the type you'd find in a good, slow-cooked stew. Overall an excellent dish that'll leave you full and happy.\nThe Couscous (Rs. 300 per portion) in all honesty is a great accompaniment to the tagine, but it tasted unremarkable. A lot like the packaged, San Remo variety you'd get on the store shelves. We made sure to douse the stuff in gravy so we could taste more of that great beef.\nWe decided to skip out on dessert and get the drinks because while their baklava sounded promising, there's still no restaurant here that's nailed a proper cup of Arabic coffee.\nThe Arabic Coffee (Rs. 350) is served in a small glass, with a side of sugar in case you like yours sweet. I've had better, but this is probably the closest you'll come to 100% authentic Arabic coffee. Strong hits of cardamom and clove seep through and the coffee itself isn't strong but thankfully isn't over-roasted either.\nI couldn't taste any saffron or rosewater, but it's still a very rich drink.\n\nThe Cardamom Milk Tea (Rs. 350) wasn't very impressive. It was a glass of really good milk tea, but unfortunately we couldn't taste any cardamom. Not even a whisper. I'd suggest you stick to the coffee or their fruit juices.\nThe ambience is still Cilantro's boring, dark interior with the same wood panelling on the walls. Nothing's changed and I suppose it's because these guys are still new, but hopefully they'll brighten the space up with a little more personalised decor.\nAfter all, it can't be a Moroccan restaurant if there isn't an explosion of colour in some random corner, no?\nThe service makes up for the gloomy interior. As we walked in we were directed to our seats by a gentleman who proceeded to run us through the menu.\n\nWhen we asked for recommendations he took into account what we liked to eat etc, and suggested dishes according to our personal tastes. He then left us to decide on drinks and told us that he had to go 'get on with the cooking.'\nIt's very rare that you'll find the chef interacting with the customers and we found it to be an interesting quirk. Plus his recommendations worked, we really liked the food.\nTagine is still very new but their signature dish delivers. The decor is a bit random, but the service and hearty, tasty good make up for it.\n",
  "yamu_rating": "We love this!",
  "url": "https://www.yamu.lk/place/tagine/review-197869",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_b78zQt-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_tG9dxO-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_4dcmMh-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_k8ewyj-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_smlVAb-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_fgsf1C-150x100.png",
    "https://www.yamu.lk/uploads/dp/2017/01/sFOlV64o5GU2djDVqy.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_b78zQt-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_4dcmMh-640x352.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_tG9dxO-640x345.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_smlVAb-640x448.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_k8ewyj-640x451.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_fgsf1C-640x356.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oKIYgP-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/04/yimg_zadtZN-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_b78zQt-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_tG9dxO-640x345.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_4dcmMh-640x352.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_k8ewyj-640x451.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}