{
  "name": "Tao (Cinnamon Grand)",
  "address": "Cinnamon Grand, Shri Uttarananda Road, Colombo 3",
  "open_until": null,
  "telephone": "0112497361",
  "description": "There aren’t too many places in the world where one can sit down for a 24 course meal in a supposedly high-end restaurant for $20. This is, de facto, a fun experience and the knowledge that your wallet will emerge relatively unscathed provides a constant sop to the disappointment the taste buds feel as each course emerges.",
  "reviews": "Tao at Cinnamon Grand is one of Colombo's few Asian fusion restaurants. The fusion is subtle at times, but they do offer some interesting dishes with Asian influences and spices.\nThe menu at Tao (note: dinner only) is quite unique from the way it's presented to the dishes they offer. It's not the biggest menu you'll come across but they do offer a decent variety of items, each with a little bit of an Asian twist thrown in. Prices aren't too steep but expect to pay anywhere between Rs. 1200 - 2000 per head.\nWe started things off with the Tao caesar salad (Rs. 600). It seemed interesting on the menu since it was supposed to be served with a curry dressing and spiced crisps, but it turned out be a disappointment. The salad was pretty much all lettuce with a bit of grated parmesan and some thin manioc chips on top. The curry dressing was pretty much thin mayo with some curry powder mixed in. While the chips were meant to replace the usual croutons, they were hardly a worthy substitute. At Rs. 600 we'd expect at least some egg in there.\nThankfully, the tamarind infused chicken breast (Rs. 950) was a lot better. It's served along with a yam mash and pesto cream, though the latter was more of a sauce. Chicken breast while generally healthy, tends to be one of the duller parts of the chicken and can be easily overcooked. However, in this case the meat was tender and well marinated with the tamarind sauce adding a touch of sweetness and zest. The yam mash was also a pleasant surprise, with a smooth consistency and well balanced seasoning.\nThe Tao mixed grill (Rs. 1600) was also pretty satisfying. You get prawns, chicken, modha, salmon, pork and a cheese omlette, served with fried rice. One thing we really liked here were the different sauces they'd spread across the plate with a good contrasts between them. We didn't really find much fault with the other elements either, but our favourites were the salmon steak with chilli cream and the pork chop with the earlier tamarind sauce.\nFor dessert we had the shredded chocolate crepes with berry ice cream and caramelized banana tart (Rs. 400). We weren't huge fans of the chocolate crepes here, and the berry ice cream was only okay, but that caramelized banana tart was outstanding. It was actually more of a banana jello topped with caramel, but the taste was a perfect balance of sweet and sour.\nTao offers mostly outdoor seating along the walkway from the pool to the main hotel, between\nand\n. On a cool night the seating conditions are ideal but we can see it being less pleasant on more humid days. They've made optimum use of the area surrounding the walkway so that they can actually handle quite a decent capacity.\nThe service was generally efficient and well paced though the dessert was a bit slow. The waiters were attentive and friendly while maintaining a good level of professionalism, as you'd expect from a hotel.\nTao is an interesting change-up from the the norm with their Asian fusion dishes. It's not for everyone, but for those looking to try something different, it's definitely worth a visit.\nTao at Cinnamon Grand is one of Colombo's few Asian fusion restaurants. Said fusion is subtle at times, but they do offer some interesting dishes with Asian influences and spices.\nThere aren’t too many places in the world where one can sit down for a 24 course meal in a supposedly high-end restaurant for $20. This is, de facto, a fun experience and the knowledge that your wallet will emerge relatively unscathed provides a constant sop to the disappointment the taste buds feel as each course emerges.\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/tao/review-48228",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_K4zh10-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_K4zh10-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_8cwD6G-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_PAAaxR-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_qoAzFI-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_flCUuM-150x100.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/02/DSC00975-small-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/02/DSC00973-small-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/02/DSC00974-small-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/02/DSC00978-small-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/02/DSC00980-small-150x105.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_oH3GVj-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_acspCT-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_oH3GVj-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_PAAaxR-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_K4zh10-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_8cwD6G-640x444.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_qoAzFI-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_flCUuM-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://www.yamu.lk/wp-content/uploads/2013/09/IMG_3434-588x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_CNUkb0-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_K4zh10-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_8cwD6G-640x444.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_PAAaxR-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_qoAzFI-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}