{
  "name": "Taste Of Asia",
  "address": "324, Galle Road, Colombo 04",
  "open_until": " Open 7.00AM to 10.00PM",
  "telephone": "0112589921",
  "description": "Taste of Asia is a very affordable favourite on Galle Road for hoppers and Jaffna food. ",
  "reviews": "Taste of Asia is a popular favourite in Bamba, for Indian food, hoppers, kottu, and good Jaffna cuisine. (They're also at World Trade Center, but that branch functions only half-day on weekends.)\nThe restaurant is actually a fancyfied kade, easily spotted on Galle Road right opposite St. Peter's College. They've got a popular following, if the crowd after 4PM is anything to go by.\nIt can get exponentially crowded in the evenings so the best time to go for a seat, we'd guess, is at about 5. The best parts of the menu - hoppers and Jaffna food - are only available after this time. (Why haven't we heard of a place that does hoppers\n5PM? Free cookie for whoever can tell us why this hoppers thing is only a night-time affair.) There is also an unexpected quiet zone at the back of the restaurant, that's partly outdoors, we were ushered in here for dinner - rather pleasant in the evenings.\nSo the menu is pretty simple and extensive - covers Sri Lankan food, South Indian food and some Jaffna favourites like crab curry and mutton poriyal, both of which we made a note of ordering. The food is good, and so are the prices (curries cost around Rs. 450, sides like string hoppers are for less than Rs. 100). Really unfortunate was that at the time we visited, they didn't have any of the healthy smoothies, mocktails or sundaes described in the menu.\nThe crab curry smelled awesome when they brought it over. So awesome that I got up in excitement and dropped my camera lens and cracked it in two, but I digress. For Rs. 400, it was deliciously prepared in a thick, spicy sweet gravy, and we ended up wiping the shell clean. But it's not a big crab, so although sharing is usually caring, don't share in this case.\nWe also got string hoppers, Rs. 70 for two light meals, with sides of mutton poriyal and vendaya kulambu (aka fenugreek seeds gravy, a household dish in Tamilnadu). Looking at the food pictures now I have this urge to go back again, so that's always a good sign. The vendaya kulambu is a mild gravy, not very spicy, makes for a good hodhi to mince down your string hoppers.\nThe mutton poriyal came in delightful little chopped pieces tossed in a dry, light spicy paste, and though served in a tiny bowl for Rs. 450, was sufficient for two. Mix crab gravy and mutton poriyal in with your rice or strings - total dynamite (if you're one of those types who is still happy when spicy food makes them cry, you'll appreciate this).\nWe didn't forget the egg hoppers of course. At Rs. 80 each, they're good, perfectly rounded with a healthy peppered white egg center. We've heard that Taste of Asia is a popular choice for hoppers (for other popular hopper choices, check out\n).\nLittle did we know what we were signing up for when we asked for iced coffee. Was expecting little silver tumblers or plastic ones, but instead we got these giant milkshake type glasses loaded with milk, sugar and itty bitty strains of chocolate. Probably one of the best iced coffees I've had in a while, super satisfying for just Rs. 160.\nOne positive thing about the service here, is that it's fast. If you're in the front area near the doors, you just go to the counter and place your order and collect it right there. If you're at the restaurant's back space, where it's slightly more dining-friendly, the dishes get to you fast too - but besides that, it's incredibly hard to find a waiter. The work force seems to focus mainly at the front counter. You have to wait and hope someone will come find you eventually, or wander into the kitchen yourself. When our waiter did resurface though, he was nice and attentive, till he disappeared again.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/taste-of-asia/review-41670",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_nWPRVP-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_yg4nYT-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_kN6iy1-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_NhLoi5-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_Ltj0ux-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_Puo9Un-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_xKsXGH-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_6yTGU2-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_y9U76e-150x100.JPG",
    "https://www.yamu.lk/uploads/dp/2015/06/Be7FWdmIZXRAmC8tEt.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_y9U76e-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_Puo9Un-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_nWPRVP-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_Ltj0ux-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_yg4nYT-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_6yTGU2-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_NhLoi5-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oKIYgP-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/05/yimg_wPMcog-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2016/08/XeyiyT47QP0lwSxe3a.jpg",
    "https://www.yamu.lk/uploads/dp/2016/08/XeyiyT47QP0lwSxe3a.jpg",
    "https://www.yamu.lk/uploads/dp/2016/08/XeyiyT47QP0lwSxe3a.jpg",
    "https://www.yamu.lk/uploads/dp/2016/08/XeyiyT47QP0lwSxe3a.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_nWPRVP-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_yg4nYT-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_kN6iy1-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_NhLoi5-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}