{
  "name": "Tasty Caterers",
  "address": "88 Fife Road, Colombo 5",
  "open_until": " Open 6.30AM to 9.00PM",
  "telephone": "112580844",
  "description": "Tasty Caterers is one of the better bakeries in Colombo. They've got a good range of savouries, and some of the best eclairs in the city. ",
  "reviews": "Tasty Caterers is your above-average Colombo bakery. In addition to their wide variety of savouries, pastries and puddings, they also do rice and curry, and hoppers in the evenings. Firstly, it has to be said - the highlight of this review are the eclairs, some of the best we've ever had in the city.\nOur bakeries and little rice and curry shops rarely ever try very hard to invite customers to have a seat, so props to Tasty for its simple but pleasant interior. There are a few tables for those looking to grab a quick bite, but it's mostly functions as a take-out spot. The place caters to everyone from students to men in suits, usually wiping their stocks clean by about 2PM.\nWhile Tasty is mostly known for it's baked goods, they also offer spaghetti, pasta and a range of rice dishes. We tried out their chicken rice & curry (Rs. 200), and it turned out be pretty good. You need to drop in pretty early to get this since it's usually all out by around 2 PM. They also offer an oddly named \"rice & curry set menu\" for Rs. 400, but that one wasn't so great the last time we tried it and can barely be considered a rice & curry.\nTheir regular rice & curry comes with white samba rice, parippu, pol mallung, dambala, chicken and of course the magnificent combination of papadam and dried chillies. All in all there wasn't anything that really disappointed us with this one. The rice was ample in portion and not overdone, the chicken was seasoned well with a thin gravy which worked well with the samba and the pol mallung was fresh and added some texture. I generally prefer the milkier version of parippu but the slightly dry preparation here wasn't too bad either since the chicken gravy was thin.\nMaalu paan is arguably the most popular of the local shorteats and Tasty definitely does justice to it. In our opinion it's easily\n, and at Rs. 50, their price is on par with other bakers. It's just a balanced combination of good bread, well-spiced minced fish with a bit of potato, very \nlight and pleasant unlike other maalu paans that tend to be overwhelming with aroma and chunkiness.\nWe also got their 'shorteats assortment', which is a box of shorteats for Rs. 250. It's a fair deal, we think, and everything tasted good, particularly the fish cutlets.\nBehold! Tasty Caterers' beautiful, fluffy, creamy eclairs. We came upon these eclairs first on a really foul day, but one bite was taken and everything seemed wonderful and worth it again. Seriously speaking though, we are eternally on the hunt for the perfect eclair (and the perfect biscuit pudding, also) - and we found worthy contenders\n, and once\n- but the ones here knocked the ball out of the park.\nTasty Caterers is a very reliable choice if you're out for quick desserts or sili-sili bags full of savouries. Generally their prices are typical bakery standard, and though we are yet to try their hoppers we've heard they're good. Everything gets sold out fast though, especially those awesome eclairs, so try to make your trip in the morning.\nTasty Caterers is one of the better bakeries in Colombo. They've got a good range of savouries, and some of the best eclairs in the city.\nTasty however stands out as one of the cities better suppliers of short eats. They have a way with choux pastry (the éclairs and cream buns are superior), the offerings are fresh and they’ve got some unique items –filled pancakes, pies, twists on the on the old sausage roll. The short eats are all between Rs. 50-100.\n\nකෙසේවෙතත්, කොලොම්පුරයේ වඩා හොඳ කෙටිකෑම සපයන්නකු ලෙස ටේස්ටි හඳුන්වන්න පුළුවන්. ඔවුන් ළඟ ෂූස් (choux) පේස්ට්‍රි හදන විශේෂ ක්‍රමයක් තිබෙනවා. ඇඟිලි හැඩයේ ඊක්ලෙයාර් (éclairs) හා ක්‍රීම් බනිස් අති විශිෂ්ටයි. පිරිනැමුම් අලුත්. ඔවුන් ළඟ තිබෙනවා සුවිශේෂ දේවල්, පුරවාපු පෑන්කේක්, පැරණි සොසේජ් රෝල්වල අඹරපු ස්වරූපය වැනි. මේ කෙටිකෑම වර්ග හැමඑකක්ම රු. 50ත් 100ත් අතර.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/tasty-caterers/review-39286",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_MepYsG-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_bfWwmn-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_Os6HkX-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_gYeaMe-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_QK9aTT-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_nmzEBE-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_6sCi8a-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_QWn9LQ-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_sGRUvg-150x100.JPG",
    "https://www.yamu.lk/wp-content/uploads/2012/09/untitled-shoot-011-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/09/untitled-shoot-012-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/09/Akbar-Iced-Tea-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/09/Tasty-Caterers-Biriyani-1-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/09/Tasty-Caterers-Biriyani-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/09/Tasty-Caterers-Prices-150x105.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/Be7FWdmIZXRAmC8tEt.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_gYeaMe-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_bfWwmn-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_QK9aTT-320x480.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_Os6HkX-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_MepYsG-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_QWn9LQ-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_Zcotzd-600x250.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_Jw5H7t-600x250.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_MepYsG-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_bfWwmn-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_Os6HkX-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_gYeaMe-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}