{
  "name": "Tea Breeze  (Racecourse)",
  "address": "GS 4, Ground Floor, Race Course Grand Stand, Reid Avenue, Colombo 07",
  "open_until": " Open until 08:00 PM",
  "telephone": "0112682003",
  "description": "Tea Breeze is Mackwood's tea bar. They have decent teas, and good waffles.",
  "reviews": "Tea Breeze has been around at Racecourse for some time now, and it's weird how we've never given it a proper review. Their\nat Beira Lake didn't really make the cut with us, and whilst the food seems slightly better here, the lax service really put us off.\nThey've got a decent range of teas, with the teas listed under which provinces they're from and whether they're iced or 'tantalizers' (basically fancy tea with icecream and chocolate sauce and all that).After trying to locate a steward — all who had mysteriously walked out the door leaving no one but the customers inside — we managed to place an order eventually.\nThe waffles here by far are the best I've tasted amongst these cafes — including the ones generally available at the\n,\n, and the range of coffee/ tea shops down Barnes Place. What sets this waffle apart is that it's\nsoft and fluffy as opposed to the rubbery ones available at other places. Coming at three hundred bucks, this Waffle with Chocolate Icecream could have used a bit more chocolate sauce, but was pretty yum.\nTheir Smoked Salmon Canapes (Rs. 290) were alright, but it was just a couple of slices of baguette topped with lettuce and a slice cucumber and salmon. The bread was a bit dry and rubbery, and it wasn't all that great. Not sure if it's worth nearly three hundred bucks. There was a generous sprinkling of pepper all over everything though, so if you like your meals to be slathered in spices, this is for you.\nComing to the drinks, the flavours of both teas came out quite strongly, with the mint and cinnamon making their mark. The temperature seemed to be confused though, with the bottom half (which was just plain tea) kinda lukewarm, and the top topped off with a scoopful of vanilla icecream. It would've been nice if the tea itself was iced, so it wouldn't give off that\ntemperature. Looks a bit of a mess too, but it's actually quite okay if it was cooled evenly.\nTea Breeze looks twice the size of life and seems surprisingly large until you realize that it's all an illusion. For real, coz one whole wall is a mirror. It's full of comfortable leather settees, and fresh flowers (one fresh flower) prettily placed on each table. The staff are really nice and friendly, but they have a tendency to evaporate. \"They breeze in and breeze out,\" explained my brother, when he saw me look around for them. This is quite inconvenient especially if you want to place an order or pay up when you're in a hurry to leave.\nTheir deco is simplistic and minimal, and it's quite a quiet place. Good to hang out and get some work done.\nTheir teas are okay, but the waffles are better. It's not a bad place and ambience-wise is a bit more laid-out and comfortable than\n. The prices are reasonable as well, and you can get something to eat and drink for approx Rs. 600. So other than the staff's breezing in and out, this place is quite okay to hang out.\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/tea-breeze-racecourse/review-62584",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_1fOQlr-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_hQTzYb-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_6yCeBS-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_KMFrvY-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_9bw6eO-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_wA3g8P-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_OcV0c1-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_EENnvF-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/08/bf9TdKPSlnqFHMaZrC.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_fzEjRq-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_hQTzYb-640x385.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_wA3g8P-320x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_KMFrvY-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_OcV0c1-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_NjMN6Z-600x250.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/09/IMG_3434-588x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_1fOQlr-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_hQTzYb-640x385.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_6yCeBS-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_KMFrvY-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}