{
  "name": "Terro's Pies & Roasts",
  "address": "329/95 , 3rd Lane, Lake Road, Dehiwala.",
  "open_until": " Open Just call her 24 hours in advance to place the order.",
  "telephone": "0766387079",
  "description": "Terro's Pies and Roasts is a home cook in Dehiwala that bakes some tasty pies and serves up some hearty roast meats. As far as home cooks go, we'd say she's a great pick for savory dishes.",
  "reviews": "Terro's Pies and Roasts is a home-cook in Dehiwala that bakes some tasty pies and serves up some hearty roast meats. As far as home cooks go, we'd say she's a great pick for savory dishes.\nTerro's is still quite a new operation, but we liked what we saw when we went through her Facebook page. One thing in particular that impressed us was that she updates her page with the stages of cooking of a dish so you know her process. Although she's a home-cook she offers quite an impressive menu with a whole bunch of pies, lasagna, roasts and meats, as well as a bunch of dessert options to choose from.\nHer prices, compared to the likes of Backyard BBQ, are quite high with roasts priced between Rs. 1500 - Rs. 2200 and pies coming in at around Rs. 1300. The good news, however, is that the portions are quite large, roughly enough for three or four people.\nOur favourite of the dishes was the BBQ pork spare ribs (Rs. 2000). She offers a bunch of different sauces, so you can pick one that suits your preferences. We went with the sweet mustard sauce which turned out to work brilliantly with the pork. For 2000 bucks you get around 10 to 12 ribs which is a more than decent portion. The ribs were cooked nice and tender with the meat coming clean off the bone. What I really liked about the sauce in this case was the fact that she used mustard seeds as oppose to the usual yellow mustard cream. The sweetness of sauce along with the slightly charred flavour of the ribs is something we'd recommend.\nNext up we tried the beef and mushroom pie (Rs. 1200), which again can be had either slightly sweet or spicy. With this one we went with the latter and when she says spicy, she means it. The pastry itself is actually thinner than conventional pies and has a very rustic presentation. On the flip side there's plenty of filling and she doesn't skimp on the meat, with a good amount of well cooked beef along with sauteed oyster mushrooms. The sauce in the filling is what really adds that spiciness with the taste of the pepper and chilli coming through distinctly.\nFor dessert we had the marshmallow and pineapple cream pie (Rs. 1500). This one was actually not on the menu but we had a hard time deciding between marshmallow or pineapple so we were offered both in one. The marshmallow part of the pie was great, but the pineapple at the bottom was soggy, which in turn made the base of the pie soggy. Honestly though, flavour-wise this is still pretty good.\nOrders need to be placed a day in advance, which is pretty standard since she needs to go out, get the ingredients and what not. Terro's works on an advance payment where you need to make a bank deposit for the relevant amount after she confirms the order. Good news is that she does delivery, which is charged according to standard meter tuk fair.\nTerro's Pies & Roasts is a great addition to the ever growing list of Colombo's home-cooks. Her savories in particular were very tasty. If you're looking to grab some meaty dishes for a small gathering, Terro's will likely fit the bill.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/terros-pies-roasts/review-46324",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_RYN8Mz-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_6Rh1wh-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_AoclCQ-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_xGJzl9-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_xquMHD-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_DBy5xB-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_AoclCQ-640x445.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_6Rh1wh-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_RYN8Mz-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_xGJzl9-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_zFF92D-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_mOENRl-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_RYN8Mz-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_6Rh1wh-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_AoclCQ-640x445.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_xGJzl9-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}