{
  "name": "TGI Friday's",
  "address": "Bank Of Ceylon Mawatha, Colombo 1",
  "open_until": " Open until 09:00 PM",
  "telephone": "112337501",
  "description": "It's always Friday in here.",
  "reviews": "Casual dining is an unrefined art in Colombo. If you want to eat well, you generally need to have pants and shoes on, but not at TGI Friday's! Their menu is varied yet concise, which I was grateful for. You'll get everything from ribs to pasta, with carefully curated choices for each section. Their main draw is still the Jack Daniels-slathered meat, whether it's steak, ribs, or chicken filet you're looking for.\nWe've been a bit disappointed by their appetizers on previous visits (as recently as 2 weeks ago), so we decided to plunge right into the mains. We got a JD half rack of ribs (more than enough for one human) along with a classic Fish and Chips.\nThe Jack Daniels ribs were excellent albeit pricey at Rs. 1750 for a half rack. The full rack is a massive portion enough for a couple to share, in case that's your idea of romance. Accompanied by coleslaw and additional JD sauce, the flavours here are sweet and smokey, with a sticky glaze. With lots of meat, sauce, and flavour, this was an excellent dish. However, I ordered the exact same dish about 2 weeks ago and there was a lot less meat on the bones and what was there was quite tough, so watch out for consistency!\nThe Fish and Chips medium portion was absolutely delicious and reasonable at Rs. 630. This was honestly some of the best-executed F&C I've come across in a while. Crisp, crunchy batter lightly herbed and salted ensconced an unbelievably soft and flaky fish within. I don't know any local fish (as amazing as our seafood is) that replicates this same texture, and sure enough our waiter informed us it was a Vietnamese import, probably basa. I generally prefer eating local seafood, but this was delicious.\nThe Oreo Madness was a bit pricey at Rs. 650, but it was also absolutely massive. They were nice enough to cut it in half so my partner and I could share without too much mess, so what you're seeing above is just half the portion. This is a frozen dessert, a fairly straightforward confection of vanilla ice cream squished between two hard dark chocolate biscuits slathered in caramel and chocolate sauce.\nIf you're looking for cheap and quick options, try their super value lunch specials which go for Rs. 600 nett from 11 AM to 3 PM on weekdays. You can choose from different rice options (nasi goreng, seafood, devilled chicken), Thai veg wrap or Cajun chicken sandwich plus unlimited coke.\nThe drinks here are surprisingly reasonable. At about Rs. 270 for 300 ml of Lion Lager, Rs. 220 for a 30 ml of arrack, and an array of spirits on the menu, it's a good spot to head for a drink with friends. I tried their Pina Colada which was a superbly priced Rs. 560. Featuring a fresh pineapple slice, a tad too much coconut milk, a splash or so of white rum, this was a light and refreshing drink perfect for a sunny Fort afternoon. It was a little thinner than your average freshly-made PC, but I preferred it this way as it was a lot easier to drink.\nThe ambience strictly adheres to franchise rules, so it's the same red plex-leather couches, red and white glass lamps, guitars and rock music posters that you'd find at any TGIF's anywhere in the world. What makes this location special, however, is the colonial building it's housed in. The upstairs area is generally closed, but if you head up there to use the bathroom you'll notice the sweeping wooden stairs with ornate brass embellishments, the wooden awnings, and the lovely old windows.\nOur service here has usually been a bit of a hit or miss. During busy times like weekend afternoons and evenings, the waitstaff seems to be a bit overwhelmed and service can be spotty. However, on this last visit, everything from the initial greeting and being ushered to the table, to our meal service and bill was handled by the manager Sasi. He's easily one of the most efficient and knowledgeable staff members I've ever encountered in the city and our experience was seamless thanks to him. We saw lots of waiters just sort of lounging about, but this one person was scurrying about answering peoples questions, taking orders, and greeting people. Impressive!\nIf I were to rate TGIF based on just this experience, it would be a whopping 5 stars from me. Unfortunately, the consistency of their fare and service tends to waver during busier times, so we'll have to give them an overall 4. The food, especially the options we ordered this time around, was excellent, as was the waitstaff. Our total bill for 2 mains, a dessert, water, and a cocktail, came to about Rs. 4500 which isn't bad at all. We'd recommend you visit during less busy times, settle in with a beer, and prepare to get your hands nice and dirty.\nEasy, quick, international dining.\nIt's always Friday at TGI Friday's. Or so they proclaim.\nAfter the first miserable experience at TGI Friday’s, we decided to give the restaurant another go. Given some time to train up and settle down, it’s actually doing pretty well.\nWe were excited to hear about this restaurant opening, but we're sad to report that it simply doesn't live up to the hype and pricing, not yet. Can you go and have a good time with friends? Yes. It's a beautiful location and if you don't expect too much you won't be disappointed. If you're expecting an international quality franchise, however, this just isn't it.\n\nමෙතන හැමදාම සිකුරාදාලු.  කෑමත් ඒ වගේද? පොඩ්ඩක් බලමු.\n\nTGI ෆ්‍රයිඩේ’ස් කියන්නේ කොළඹ 1ට අලුතින් ආව ෆ්රැන්චයිස් එකක්. ඒක පිහිටලා තියෙන්නේ කදිම ඉඩක වුණත් සාමාන්‍ය මට්ටමේ කෑමයි, අදක්ෂ සේවාවයි, ඉහළ මිල ගනනුයි නිසා එතන ආකර්ෂණය අඩු වෙලයි තියෙන්නේ.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/tgi-fridays/review-192496",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_bMxYO7-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_bMxYO7-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/07/yimg_PmkfAS-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/07/yimg_QbQShI-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/07/yimg_puE0wi-150x100.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/10/DSCF4990-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/10/DSCF4976-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/10/DSCF4984-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/10/DSCF4986-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/10/DSCF6753-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/10/DSCF6757-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/10/20140426_223121-150x105.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/07/yimg_t8nk4L-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/07/yimg_QpMRol-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_SsLdPC-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_NAdhQ1-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_qzVr8j-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_d5YedZ-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_xqSbHL-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2017/04/KE2F77hW9uoRt7RHja.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_d5YedZ-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_bMxYO7-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_xqSbHL-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_qzVr8j-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_NAdhQ1-640x368.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_SsLdPC-640x387.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/10/20140426_223121-600x450.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_mOENRl-600x250.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/05/IMG_1685-588x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_bMxYO7-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/07/yimg_PmkfAS-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/07/yimg_QbQShI-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/07/yimg_puE0wi-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}