{
  "name": "Thai Cuisine La Rambla",
  "address": "69 Hotel Road, Mount Lavinia",
  "open_until": " Open 11:30 to 2:30, 6:30 to 10:30",
  "telephone": "0112725403",
  "description": "La Rambla is a pleasant little restaurant tucked away down Hotel Road in Mount Lavinia. If you're looking for a quiet, private meal with good food and quick service, this is one we'd recommend. They now exclusively serve up Thai food under the same name and roof.",
  "reviews": "With a Catalan name and completely new and revamped Thai menu and decor, La Rambla is culturally confusing. While we do think they should drop the Spanish \"La Rambla\" name, there's no denying their Thai fare is top notch. If you need any more convincing, this spot is from Tasty Caterers, who are also responsible for the\n.\nWe stopped by for dinner on a quiet Thursday, and left absolutely impressed. This is definitely some of the best dining in Mount Lavinia.\nIn short, the food is superb - and expensive. They don't have a liquor licence, so a meal for two without drinks will still cost you something like 5-6 K.\nWe opted for the Satay Kai to start with. At Rs. 840, the dish came with 4 little bits of impossibly succulent and lightly grilled chicken satay. The accompanying sauce wasn't your average peanut sauce concoction either. It was a delicately nuanced mélange of flavours that we wish we could have drunk straight from the bowl (we didn't, the waiters were watching).\nFor our mains, we ordered a Khao Pad Pak (vegetable fried rice), Phak Bung Fai Dang (kang kung), and Choo Chee Goong (prawn).\nThe rice served as the carb base for our meal, a well-executed but boring dish of rice tossed with a bunch of chunkily-cut vegetables. It was tasty enough, but featured a little bit too much tomato for my own personal liking. Topped with the creamy prawn curry and oodles of kang kung, it made for a full and flavourful meal.\nThe prawns came stir fried with dry shrimp, chillie paste, all topped with lemongrass sauce and coconut cream. At Rs. 1890, this is definitely very pricey, but the quality is commendable. The dish is enough for 2 people, with around 6-7 fat jumbo prawns soaked in the delicious, rich sauce. You can expect to pay the same price for most other prawn/seafood main dishes on the menu.\nThe kang kung (Rs. 640) was simple, well stir fried, and with a solid smattering of golden brown sautéed garlic and chilli.\nWe also attempted a Gluay Tod (Rs. 750), basically a sort of banana fritter coated with jaggery, dry coconut, and chopped nuts served with vanilla ice cream. In short, it was overwhelming - both in terms of flavour and texture. Given the heaviness of our meal, we would have preferred something simple and light but our waiter recommended this as their star dessert. We'd recommend you go for this only if you're REALLY into fritters.\nAll of this was washed down with a couple of drinks, a Mango Juice and a fresh Mint concoction, both just under Rs. 400. They came served in tall glasses, with plenty of quantity and fresh ingredients.\nThe ambience is minimally changed, preserving the old bungalow's clean lines and white wash. You'll just notice a Thai- themed difference in artwork, cutlery, and decor.\nDuring the entirety of our visit, service was impeccable. Each waiter that served us was pleasant, happy to help, and knew their way around the menu. The managers themselves checked up on us a couple of times and asked for feedback, which we appreciated. They were also happy to tell us about the place's background, their new Thai chef, and recommend dishes (even though we didn't love the dessert).\nThis is seriously high-quality Thai dining, from execution to service. However, our total bill for 2 was Rs. 6171, which is very expensive even by Colombo's rising standards. We reckon if you stick to chicken/ pork instead of seafood, or just opt for a variety of starters, you'll be able to dine for under Rs. 4000.\nThai cuisine at La Rambla, Mount Lavinia.\nLa Rambla is a pleasant little restaurant tucked away down Hotel Road in Mount Lavinia. If you're looking for a quiet, private meal in Mt.Lavinia with good food and quick service, this is one we'd recommend.\nWhile it benefits from a lovely location the food at La Rambla has never struck me as exceptional (its been downright disappointing at times) but on a sweltering afternoon we were desperate for a cold drink and something sweet so we piled in and ordered the dessert platter (Rs 600) and a pavlova (Rs 400).\n\nසුන්දර ඉසව්වක පිහිටීමේ වාසිය තිබුණාට La Ramblaහි ආහාරනම් මට සුවිශේෂ යයි සිතුණේ නැහැ. ඇතැම් වේලාවට එය බලාපොරොත්තු සුන්කරන සුළුයි. එදා උණුසුම් දහවලේ පැණි රස දෙයක හා සිසිල් බීමක ආශාව නිසා අපි එහි පිවිස අතුරුපස පලංගානක් (රු. 600) හා පැව්ලොවා එකක් (රු. 400) ඇණවුම් කළා.\n",
  "yamu_rating": "We love this!",
  "url": "https://www.yamu.lk/place/la-rambla/review-150665",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_JNivx5-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_GV5Ml5-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_bEXAd2-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_9e5nAA-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_6oUXN2-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_65bz7u-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_mCAaM0-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_aPpmf7-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_gt4X8Y-150x100.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/09/mount-lavinia-foods-039-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/09/mount-lavinia-foods-041-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/09/mount-lavinia-foods-033-150x105.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_p9J69G-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_pCUjY2-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_YMX9PB-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_i9A860-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_P7iX0P-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_Z4MqrV-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2017/04/KE2F77hW9uoRt7RHja.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_9e5nAA-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_Z4MqrV-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_bEXAd2-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_P7iX0P-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_pCUjY2-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_YMX9PB-293x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_6oUXN2-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_65bz7u-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_GhmYgS-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/04/yimg_cNE8mP-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_JNivx5-640x360.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_GV5Ml5-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_bEXAd2-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_9e5nAA-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}