{
  "name": "Thai Heritage (Galle Dutch Hospital) ",
  "address": "1st Floor, 10-02, Old Dutch Hospital, Hospital Street, Galle Fort, Galle",
  "open_until": " Open 11.00AM to 10.00PM",
  "telephone": "0912231009",
  "description": "Thai Heritage is one of the many chic little restaurants on the foyers of the Old Dutch Hospital building in the Galle fort. The food though not striving for authenticity, is still alright, and somewhat on par with most fancy diners in the fort. ",
  "reviews": "Thai Heritage is another one of the many, slightly expensive, popular-among-tourists restaurants at the Old Dutch Hospital building at the Galle fort. We tried out a few things here and the food is alright, although not by any means trying very hard to hit the mark where authenticity is concerned.\nThe Galle fort, despite its many charms, is unfortunately also known for its not-so-great value for money where dining is concerned, thanks to its mainly tourist clientele. The old Dutch Hospital building, though visually a fancy and cool addition to the face of the fort, seems to be a mix of these slightly expensive eateries that offer okay-food (although we love the\nhere). Thai Heritage is one of these places, near\nand Starbeans, with a busy hallway of customers, and the simple white-and-wood theme of this old Dutch building.\nService is so-so if you're seated here outside. If the waiters are outside they're quite attentive and will refill your glass and so on, but if they choose to hang out inside, you're going to have to wait around till you hopefully catch their eye at some point.\nThe menu is small and touches on a few Thai cuisine typicals. We tried the Pad Thai, a popular Thai streetfood dish which is basically flat noodles tossed with a wide assortment of vegetables, and egg, shrimp, tofu etc. For Rs. 950, this was a memorable dish with a strong aroma and a rich mix of flavours, somewhat salty, wet and spicy, and we wish there had been more shrimp. This is tasty though it's a relatively sloppy tossing-together, than the careful and subtle flavour-jumbling of authentic Thai food (which by the way, I have not even had in Sri Lanka yet -\ndoesn't hit the mark but they're better at it).\nWe also got the grilled fillet of seer for the same price (their mains are in the Rs. 1000 range). This is a heavy piece, only ever so slightly grilled, covered in a milky, lemongrassy sauce. The hit of lemongrass was nice but overall this was a little bland, and also served with potato wedges that had been weirdly rolled in some kind of masala.\nFor dessert, we got the 'hazelnut crunch chocolate fudge', which quizzically had no fudge or hazelnut in it. For Rs. 450, we got two tiny Kandos-like flavoured cubes, sandwiching a little glob of ice cream. Fudge isn't very hard to get wrong so we're not sure what the hold up was here. Our milkshake, for Rs. 300, was great - we got a green banana and honey melon - it was a very thick glass with the flavours coming out nicely, mixed with little sugary melony bits to break the taste.\nThai Heritage is not truly attempting to honour Thai heritage, though the food is alright, and if you skip dessert you'd spend about Rs. 1500 per head. Is it worth it? Well that seems to be the going rate at the fort anyway, so if you feel like a dinner at the old Dutch Hospital it's one of the many\noptions in the building.\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/thai-heritage-galle-dutch-hospital/review-45057",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_0yiur4-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_3AeiKi-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_sC716u-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_PZV41L-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_X4tVjN-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_YOe1mE-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_vdudAO-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_ZbNYLR-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_itTyqY-150x100.JPG",
    "https://www.yamu.lk/uploads/dp/2015/06/Be7FWdmIZXRAmC8tEt.jpg",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_3AeiKi-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_0yiur4-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_sC716u-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_YOe1mE-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_vdudAO-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/12/yimg_xXnDPG-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/11/yimg_tabxl7-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_0yiur4-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_3AeiKi-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_sC716u-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_PZV41L-320x480.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}