{
  "name": "Thalis ",
  "address": "155, Park Road, Colombo 5",
  "open_until": " Open 11 AM–11 PM",
  "telephone": "112586000",
  "description": "Serving both north and south Indian thalis in addition to a la carte dishes, this all-vegetarian eatery is authentic and affordable — two adjectives we love a little more than others.",
  "reviews": "Indian cuisine can present a problem of plenty — with so many different states, it's nearly impossible to represent India on a plate. But the\nis a pretty good primer. Quite literally a plate laden with several small cups bearing up to a dozen dishes, the\nis a compact introduction to the dizzying variety of regional Indian cuisine. That's precisely what you get at Thalis, a brand new vegetarian addition to Park Road. Serving both north and south Indian\nin addition to a la carte dishes and snacks, this all-vegetarian eatery is authentic and affordable — two adjectives we love more than others.\nSpanning the whole range from\n,\nand other light bites to north Indian dishes, with a cursory nod to Chindian (or Indian Chinese), the menu at Thalis is an ambitious and expansive one. But displaying a rare decisiveness when confronted with multiple options, I zeroed in on the south Indian thali (Rs. 400).\nA neat freak's delight, the\nheld ten individual cups arranged around the plate, with a larger vessel of rice in the middle. I was delighted to find both\n(a tangy and usually fiery soup made of\n) and\na coconutty snake gourd curry as well as a dry bean one; fresh curd to wash it all down and\nto sweeten the deal.\nSome of these worked better than others: the\nwas much too watered down to have any real punch, and the beans\nwas run-of-the-mill. But the thick\nladen with pearl onions was perfectly balanced (and reminded me of my mum's\n), while the tamarind-laden\na spicy-sour dish with lady fingers and\nwas the sleeper hit of the meal. With unlimited refills available for each of the individual elements, Thalis' thali is fantastic value for money.\nYou'd imagine that a\nwith multiple refills of\n(just perfectly sweet, creamy and decadent) would have been plenty, but we had brought our A game to this lunch. So we also ordered\n(Rs. 350) or tamarind rice, along with a cucumber\n(Rs. 200). Usually a tangy and spicy preparation, Thalis' version was a tad off-balance. Although generously speckled with fried peanuts for crunch, the rice was underseasoned and didn't have the characteristic pucker of tamarind. The\nwith cucumber cubes in watery curd was similarly under-salted and generally underwhelming.\nOn the other hand, the melt-in-the-mouth paneer butter masala (Rs. 600) positively took us by surprise. Usually a combination of rubbery pieces of cottage cheese in a sweetened gravy, a good paneer dish is rare to find in Colombo. However, Thalis' iteration of this classic north Indian preparation gave us little reason to nitpick. The soft and crumbly pieces of paneer added richness to the tangy and perfectly balanced tomato gravy. Scooped up with pieces of the fresh and soft\n(Rs. 225) studded with fat cloves of garlic, it was one of the highlights of our meal.\nThe beverages also held up their end of the bargain. The savoury buttermilk (Rs. 150) seasoned with salt and asafoetida, and garnished with green chillies and coriander stems, was pretty damn perfect. Neither thick nor diluted, and chilled just so, it was the perfect antidote for a sunny day.\nBut it was the frothy filter coffee served in a petite tumbler that I enjoyed the most. From the presentation down to the sweet, frothy brew, everything reminded me of the afternoon coffee rituals that were such an important part of my growing-up years. Just for the joy of the filter coffee alone, I'm sure I'll return to Thalis soon.\nThalis bears the simple and functional air of a restaurant where the focus is on food over frills (although we appreciate the colourful little touches at the entrance, pictured below).\nThe comfortable wooden chairs and gleaming table tops arranged in a brightly-lit dining area aren't designed for you to dawdle over a long meal. This is the sort of place where you eat with your full attention and then get on with it. Although the speedy service keeps pace with the general air of briskness, we found all the wait staff to be polite, hospitable and attentive, urging us to have more refills of the\n.\nDespite being close, authentic Indian food is still not abundant in Colombo. For this reason alone, Thalis makes for an exciting addition to the local culinary scene. At just over Rs. 2,000 for a substantial meal that also included a full\nit is a wallet-friendly and generally happy-making option that we are bound to revisit again. And again.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/thalis/review-57034",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_UIfP2A-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_OaKsx0-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_1xK2S0-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_WZErdf-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_zbQu01-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_bnFhaM-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_8XKYx6-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_AtPQI8-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_7yVLm7-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_EIMxvm-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_cVMI4U-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_EzZqSj-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_LuViWv-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_UIfP2A-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_1xK2S0-640x507.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_WZErdf-640x348.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_7yVLm7-640x513.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_zbQu01-640x481.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_OaKsx0-640x520.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_8XKYx6-640x513.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://www.yamu.lk/wp-content/uploads/2014/09/DSCF9533-588x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_0nakvg-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_UIfP2A-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_OaKsx0-640x520.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_1xK2S0-640x507.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_WZErdf-640x348.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}