{
  "name": "The Lattice (Taj Samudra)",
  "address": "Taj Samudra, 25 Galle Face Center Rd, Colombo 3",
  "open_until": null,
  "telephone": "0112446622",
  "description": "The Lattice at Taj is an informal business lounge situated on the right side of their expansive lobby as you enter. They're open from 9:00AM to 11:00PM and their Afternoon Tea session starts from 3:00PM to 6:00PM. They have an excellent menu and are reasonably priced.\r\n\r\n",
  "reviews": "The Lattice at Taj is an informal business lounge situated on the right side of their expansive lobby. Since I am a posh gentlewoman, I decided on an Afternoon Tea session (which runs from 3 to 6 PM), so I could loll back and enjoy some scones and talk about politics and post-colonial issues. They have an excellent and reasonably priced menu.\n\nThey have a selection of different types of tea sets to try out but we opted for the Traditional English Tea (Rs. 1,200). I am happy to report that the pseudo-Englishwoman in me was absolutely chuffed at the contents of this set.  The edibles were skilfully prepared with great attention to detail and were delicious to boot.\nThe savoury types were your standard teatime snacks but in Lattice's case, the pastries were packed with filling and flavour. There was as much meat as could be stuffed in these titchy delights and the crust was buttery and not overdone. You know the hands that prepare these treats are experienced when they're not overly spiced or bland but rather just right with that light tinge of condiment.\nThe Sandwiches were passable at best and not exactly anything to write home about maybe save for the Salmon sandwich. The Parma Ham Grissini was a bit confusing, because for some reason it had a very overpowering floral jasmine taste to it.\nThe sweets were the best part of the entire experience for me because they were moreish and all the elements of each sweet item were tied together perfectly. The scones were divine, they were soft enough to melt in your mouth and the clotted cream, strawberry jam and orange marmalade served on the sides complemented them well. There was a great variety of sweets as well, from mini tarts to macarons to pana cotta, creme brulee and chocolatey petite-foire.\nDili ordered the Minute Steak, Bacon and Caramelised Onion in Herb Country Bread sandwich. At Rs.925 this was an excellent choice of dish. Sandwiched in between soft, fresh slices of herb bread, the steak was juicy and flavoursome, the bacon was well done, and really brought the entire thing together. The sandwich was served with a side of fresh, crisp fries and a teeny bit of coleslaw just for presentation purposes.\nAs choice of drink to go with the tea set we ordered an iced coffee. It was a modest Sri Lankan iced coffee but prepared well.\nOf course we also got something to dull the senses just a bit and when asked the waiter recommended the Margarita (Rs.695). This was a seriously boozy drink with a nice big shot of Tequila, equal amounts of Triple Sec and an angel's share of lime that made the drink tart and refreshing. I call it the Alcoholic's Limeade.\nWe ordered all this and the bill only came to Rs.3,546 for the two of us. Not to mention we were both so full we decided to walk halfway back to the office to burn it off.\n\nThe decor was an interflow of Persian, Sri Lankan and French elements. The walls and the random palm trees placed in pots throughout the lounge, the abstract wooden mural on the wall behind the serving station and the chintz chairs along with the rich couches were a bit confusing, but I didn't mind because who wouldn't want to feel like a Babylonian Princess having Tea at an extremely fancy Post-French Revolutionised kade?\nDili and I were pretty noticeable in a high-end place like that since we were in the casual attire and were waving a camera around, but it took about twenty minutes for the waiters to notice us which irked me a little since everyone around us was being waited on.\nOnly after we flagged a waiter down did he approach us with the menu. After that though we experienced some great service and the waiters knew their menu well.  I appreciated how jovial they were and thankfully didn't give us the old foreigners>locals treatment that we run into frequently at certain establishments.\n\nGet your friends, dress up and head over to The Lattice at Taj for an Afternoon Tea session, because it makes for a splendid experience. Not only are they not exorbitantly priced, the area is amazing as well and once you're done you can stroll by the beach and watch the sun go down on Galle Face Green.\nThe Lattice at Taj is an informal business lounge open from 9:00AM to 11:00PM and their Afternoon Tea session starts from 3:00PM to 6:00PM. They have an excellent menu and are reasonably priced.\n\nකට්ටියක් එක්ක එකට කන්න ඕනේ වෙලාවක ටාජ් සමුද්‍රා එකේ ලැටිස් රෙස්ටෝරන්ට් එකට යන්න. නරකක් වෙන්නෙ නැහැ.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/the-lattice-taj-samudra/review-120769",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_xFrEq7-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_kObRo8-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_YnreLA-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_o53JCc-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_apV1Pz-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_hZDk6n-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_Q4Opvw-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_1oOQcE-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_3XUKyK-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_NlHUs1-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_w37PQo-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2017/01/sFOlV64o5GU2djDVqy.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_xFrEq7-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_YnreLA-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_w37PQo-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_o53JCc-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_Q4Opvw-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_kObRo8-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_apV1Pz-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_NlHUs1-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_5YTlbU-600x250.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_6MCjOm-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_xFrEq7-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_kObRo8-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_YnreLA-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_o53JCc-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}