{
  "name": "The Soya Center (Kandy)",
  "address": "16 A, Kotugodella Veediya, Kandy",
  "open_until": null,
  "telephone": "0756363219",
  "description": "Great, cheap soya-based food.",
  "reviews": "The Soya Center is a no-nonsense business that doesn’t try to be something it isn’t. It is run out of the Kandy Young Men’s Christian Association (YMCA) and has been open since 1987.\nThe Soya Ice Cream (Rs. 90 for 3 scoops) is by far its most popular product. Even on rainy days a steady trickle of couples, tourists, families and office workers can be seen eating the delicious stuff out of cones. If you’ve never tasted soya ice cream before, it’s lighter than the usual, and the texture can seem a little gelatinous. You get a mixture of vanilla and chocolate in your cone. They don’t serve any other flavors. Both tasted pretty good.\nSoya milk is another standard soya product on offer. It comes in chocolate and pineapple. Having already tried the chocolate ice cream, we went for the Pineapple Milk (Rs. 60 a glass). I’d say it tasted like a milkshake, but the pineapple in it is artificial extract. So while the soya milk tasted great and was nice and smooth without being too thin, the pineapple added a slightly too-sugary after taste.\nThey also serve a variety of soya-based food that we didn’t try, our stomachs just having been filled by a rather large lunch from a\nnearby. But the Soya Vades (Rs. 50 each) in particular looked quite good.\nThe staff aren’t overly friendly, neither are they rude. There is no ‘customer is king’ pandering going on here. This is highly refreshing, especially because they're also very efficient and know a thing or two about the food. Some of them have even been around since the beginning.\nThe place also comes highly recommended (judging by the paraphernalia on the walls) by institutions like Trip Advisor, Culture Trip and the Kandy Municipality, which has given it a rating of A (\n).\nThe Soya Center is located on the first floor of the YMCA building. There is a large airy terrace that looks out over the street. When you approach the building, a wide, red, cement staircase with a railing along the middle leads up from the street.\nThere are little yellow footprints painted on it to indicate which side to take when either entering or exiting. Either they had gotten the placement of the railing wrong, or some artist had decided to mess with people’s heads, because one set of footprints leading downwards indicated that exiting customers might want to consider walking downstairs with the railing between their legs.\nThe Kandy YMCA itself is an interesting place to look at. It’s a relic out of the 70s. Some signboards seemingly haven’t changed for decades. Depending on the time, you can also watch people (young men and not-so-young men mostly) practicing karate, playing volleyball or doing other things members of the YMCA might be inclined to do within the premises.\nCentrally located, no-nonsense and efficient with great, really cheap, really clean AND really healthy food. This one is a no brainer.\n",
  "yamu_rating": "We love this!",
  "url": "https://www.yamu.lk/place/soya-center-kandy/review-203594",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_o9NEGX-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_DaZHRB-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_epWzUG-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_MAm1bP-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_P12q9v-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_o9NEGX-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_DaZHRB-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_epWzUG-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_mOENRl-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oKIYgP-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_o9NEGX-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_DaZHRB-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_epWzUG-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_MAm1bP-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}