{
  "name": "The Bayleaf",
  "address": "79, Gregory's Road, Colombo 07.",
  "open_until": " Open until 11:00 PM",
  "telephone": "0112695920",
  "description": "As far as safe bets go, Bayleaf is right up there. Good Italian fare at not too exorbitant prices, and a rather extensive menu to choose from.",
  "reviews": "Bayleaf on Gregory's Road is one of the better restaurants in Colombo, and it's earned its reputation over years of good service. While it might be pricey, the food has always been good. They're an Italian restaurant that serves Harpo's pizza as well. It's a great place to meet up with friends or host a little private dinner.\nThe menu is quite extensive, covering everything from antipasti to dessert, but there's also plenty of food options in the drinks menu that you should definitely check out. We decided on the Tagliatelle verdi con Prosciutto and Ravioli d'Anatra (duck ravioli) for mains, opting for the Trio Bruschetta off the drinks menu as our appetiser, and the Panacotta for dessert.\n\nWe were quite glad we tried out the Trio Bruschetta (Rs 695) because they were flavourful with plenty of meat on them. There was pepperoni, smoked salmon, smoked chicken and bell pepper. I didn't get to eat much of the salmon because my dining partner has an inextinguishable appetite for this particular protein. Nevertheless, they were all tasty and I can see why they'd make sense as a bite, bringing more savouriness to the typical bruschetta.\n\nThe Tagliatelle (Rs 1050) didn't look like a massive portion, at first, for which I'm glad, but the moment I started digging into it, I couldn't help but feel full. The sauce is very rich, so, despite the fact that it's a single serving, you really do feel every bite. There's lots of fresh mushrooms going on here, and the flavours come through really well. It's a really hearty meal and the pasta is on point. My photography, though, in this instance, not so much. (Sorry!)\nBy way of the duck, our ravioli (Rs 1175) was pretty good. I tasted mostly oregano, but the sauce was creamy and delish. As far as raviolis go, this one seems a little extravagant because of the choice of protein, but sometimes a spinach ravioli can taste that much better. My dining partner enjoyed this much more than I did. Perhaps if there was more duck and less oregano, I'd be more partial to this dish.\nFinally, the Panacotta (Rs 400) was executed well, much unlike the disastrous gello we were served at\n. For the price, it's well worth it and you can easily share this with two to three people, depending on how much of a sweet tooth you have. I would have liked more of that tart sauce, but that's because I'm just a sucker for sour. All in all our meal was on point and we didn't feel ripped off. So, that's a win!\nThe staff at Bayleaf appear very well composed and you get the sense that they really know what they're doing. They'll come and clear your plates just when you're done, almost instinctually, though you won't notice them hovering about you. We really liked that we could experience an intimate dinner while not having to hunt for our waiter. You can ask them for recommendations, and they'll help you around the menu.\n\nI like the feel of the place. You can easily forget that this used to be a home at some point. As you enter, you're hit by the fragrance of citronella. It can be a bit intense, but the absolute lack of mosquitoes in the open air dining areas are a result of this. Also, I think it helps cut the otherwise meaty aroma of pepperoni and pizza that I would imagine could flood the place. We dined upstairs and it was cool. You can get your own little spot. Otherwise, there's plenty of space downstairs by the entrance as well.\nYou can't go wrong with Bayleaf, really, and that makes for a comfortable choice when making decisions on where to go for dinner. There's service charge and VAT that adds on to the bill, so watch out for that. Otherwise, you can dine for about Rs 1500 - 2000 per head. They do lunch, too, and we've heard that's pretty good as well. Whether it's pizza, pasta or just tiramisu, you can find pretty good renditions of a fair deal of Italian fare here. Oh, and there's drinks and a dedicated bar too!\nWhether it's pizza, pasta or just tiramisu, you can find pretty good renditions of a fair deal of Italian fare here. Oh, and there's drinks, too!\nAs far as safe bets go, Bayleaf is right up there. Good Italian fare at not too exorbitant prices, and a rather extensive menu to choose from.\nAfter an evening with a decent bottle of wine and perfectly reasonable food in a lovely setting I am going to retract some of my previous criticism and apologize for my perhaps excessive bad mouthing of the Bayleaf\n\nඉතින් හොඳ වයින් බෝතලයක් බීමෙන් අනතුරුව ඉතාම සාධාරණ මිළට සුන්දර පරිසරයක සිට ගත් ආහාර වේලකින් පසු මම දැන් සූදානම් වන්නේ මගේ කලින් විවේචන හකුළාගනිමින් ඇතැම්විට උමනාවට වඩා වැඩිය කියා කියන්නට පුළුවන් නරක වචන ගැන බේලීෆ් වෙතින් සමාව ඉල්ලන්න.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/bayleaf/review-86218",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_EnOqLn-150x100.jpeg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_uvlTbe-150x100.jpeg",
    "https://www.yamu.lk/wp-content/uploads/2012/09/20140507_134821-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/09/20140507_134832-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/09/20140507_134850-150x105.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_LC08MX-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_YYNy47-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_G41aLm-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_KLYaiO-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_KvyVIB-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/12/0F34X3pTfLr7btifJN.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_LC08MX-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_YYNy47-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_G41aLm-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_KLYaiO-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/03/yimg_KvyVIB-640x480.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_uvlTbe-640x426.jpeg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_EnOqLn-640x319.jpeg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_rrZzWU-600x250.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_beimJT-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_EnOqLn-640x319.jpeg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_uvlTbe-640x426.jpeg",
    "https://www.yamu.lk/wp-content/uploads/2012/09/20140507_134821-600x450.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/09/20140507_134832-600x450.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}