{
  "name": "The Courtyard (Tintagel Boutique Hotel)",
  "address": "65 Rosmead Place, Colombo 7",
  "open_until": " Open 12 to 3:30 PM, 6:30 to 10:30 PM",
  "telephone": "114602060",
  "description": "Tintagel is a historic Colombo establishment with chic design and generally good (but pricey) food at its al fresco restaurant.",
  "reviews": "Tintagel is one of Colombo's prettiest colonial mansions. Steeped in dark political history and chic contemporary design, the hotel is a must-visit if you've got time and money to spare. We swung by for a late lunch on a lazy Saturday afternoon.\nNestled in Colombo 7's chi-chi Rosmead Place, Tintagel's structure dates back to 1930. Since then it has served as the backdrop of numerous political events - the occupation of the British military, an assassination on its front steps, and a trifecta of Bandaranaikes who would go on to become Sri Lanka's premieres. It's now a pricey boutique hotel under Paradise Hotel management.\nThe dining at Paradise Road Hotels is generally of a high standard. However, we haven't really seen any menu changes in years, which is tiring.\nFor this experience, we ordered a Smoked Salmon with Caviar for our starter. At Rs. 1175++, this is my staple Tintagel order. It's a simple but delicious prep of imported salmon, lightly smoked and rolled with cream cheese and a soupçon of what appeared to be tobiko (rather than sturgeon caviar). Don't expect quantity, there are just about 3 rolls and a handful of leaves covered in delicious home-made honey mustard vinaigrette.\nFor our mains, we opted for a Braised Pork Belly (Rs. 1895) and the Paradise Road classic, the Baked Crab (Rs. 1495). The pork was perfection, a superbly well-marinated slice of belly with soft fat perched on a bed of roast potatoes, betroot, and jus. It was topped with a poached egg that wasn't runny at all, but we hardly noticed since the pork flavour eclipsed all else.\nThe crab was a bit of a disappointment, especially since this is one of their most popular dishes. The crab meat itself was fresh and plentiful, but it was so lacking in flavour I had to fling salt on it in a crazed fashion to make any sort of impression on my palate. The usual concoction of crab, saffron, garlic, butter, and cream seemed to be missing any compelling flavour, but compensated for it with loads of shards of crab shell. Not cool.\nGiven that the temperature was in the high 20s, we decided to go for one of their signature cocktails, the Frozen Strawberry Margarita. At Rs. 1995++, it's touted as one of the Paradise Road's pièces de résistance. We've had this dozens of times before at the\n, and it's always a massive confection of mounds of iced margarita, fresh strawberry, and generous amounts of tequila. What we received at Tintagel wasn't frozen at all, and the quantity was vastly inferior. It was more of a alcohol-ridden fresh strawberry smoothie, and absolutely not worth the cash it cost.\nTo wrap up, we got ourselves a Via Paradiso, a layered dessert featuring tiramisu, meringue, black cherries, and cream. It's a sinful indulgence we thoroughly enjoyed. At Rs. 795 it's actually rich enough to share between two if you've had a full meal.\nThe Courtyard is a lovely al fresco spot, a quiet respite from Colombo's noise and air pollution, but not its heat or mosquitos. I'm always surprised by how empty it is (this isn't the first time we've been the only occupied table here).\nTheir ambience features the classic Paradise Road stark monochrome colour palette, with an interspersion of stonework and cement pots thrown in. I'd always recommend it for a quiet drink or an elegantly balmy lunch.\nWe've heard endless complaints about the Paradise Road service in general, with rude waiters, discriminatory behaviour, and supercilious management. However, on the visit we found our waiters attentive, friendly, and efficient, which means that they've taken their criticism to heart. Shockingly, my only service complaint was that the manager who greeted us couldn't manage to make eye contact with anything above my collar bones (both upon our entrance and exit into the hotel). You don't drop some 10K on a meal to be checked out like you're standing at the Welikada Junction.\nBarring Mr. Creepsauce at the entrance, we're happy to see Tintagel has sorted out their service and quality of food (especially in comparison to\n). With (generally) good food at very high prices, we'd recommend this spot for the dessert but definitely not for the overpriced and under-executed drinks. Beware though, our taxes and service charge came to about Rs. 2200, closing our bill at a steep Rs. 9567 for two.\nPerhaps just order a bottle of wine and dessert, and soak in the historic glam.\nOne of Colombo's fanciest boutique hotels.\nTintagel is a great space done well. We highly recommend it for dessert and maybe bring your own wine, but the dinner we had was unexceptional for the price.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/tintagel/review-172243",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_a8kGRi-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_j5UxUw-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_zYfXAV-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_Ed7DB5-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_hDMyAJ-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_akGyhP-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_nFZbpV-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_RsLyuk-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_S1pDsy-150x100.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/03/DSCF7231-2-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/03/DSCF7220-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/03/DSCF7238-150x105.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_FpjLUf-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_TkDmbn-150x100.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/03/DSCF7205-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/03/DSCF7221-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/03/DSCF7212-150x105.jpg",
    "https://www.yamu.lk/uploads/dp/2017/04/KE2F77hW9uoRt7RHja.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_akGyhP-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_TkDmbn-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_S1pDsy-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_RsLyuk-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_nFZbpV-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_zYfXAV-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_FpjLUf-640x396.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_Ed7DB5-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_hDMyAJ-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_a8kGRi-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_XEh2m9-600x250.jpg",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_KfEoHC-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_a8kGRi-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_j5UxUw-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_zYfXAV-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_Ed7DB5-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}