{
  "name": "The Lagoon (Cinnamon Grand)",
  "address": "Cinnamon Grand, 77, Galle Road, Colombo 3",
  "open_until": " Open 12 Noon to 2.30 PM, 7 PM to Midnight",
  "telephone": "0112497371",
  "description": "The Lagoon is a fine dining seafood restaurant located in Colombo's Cinnamon Grand Hotel. Freshly caught seafood is displayed upon a bed of ice and can be chosen with the preferred style of preparation and sides. It's very good, and very expensive.",
  "reviews": "The Lagoon is Cinnamon Grand's riff on a\nseafood restaurant. They offer an excellent selection of fresh seafood, along with the option of choosing how you want each element prepared. They serve up some high quality dishes along with top-notch service, but none of this comes cheap.\nFrom Mount Lavinia to Fort, Colombo has no shortage of seafood restaurants at drastically varying price points. With so much competition, it takes a lot to be considered among the upper echelon, which is where The Lagoon would be placed by most, along with\nand\n. However, it also finds itself in the top bracket when it comes to pricing. The cost per head generally comes to approximately Rs. 2,500-Rs. 3,000, if not more.\nThis time around, we went for a slightly different approach. We tried to limit the damage to Rs. 2,000 per head with a group of six diners. In most restaurants, this would be fairly straightforward. But The Lagoon's method of picking out seafood from the central display and pricing it depending on weight, makes it a bit arduous.\nWhile their mains are definitely on the higher-end of the price \nspectrum, their starters are priced quite reasonably in comparison. The 12-piece sushi platter (Rs. 1,200) was certainly value for money, with a respectable array of maki, uramaki (inverted maki), salmon nigiri and ebi nigiri, along with a bit of salad and soy sauce. What really shone through in this dish was the quality of the seafood, which tasted incredibly fresh. We were also impressed with the overall construction and presentation of the sushi given the fact that Lagoon isn't a Japanese restaurant. Our only minor quibble was that there wasn't quite enough wasabi in the sushi, which mean we had to add it separately.\nSpring rolls aren't very complex. Even so, we couldn't find fault with Lagoon's prawn spring rolls (Rs. 600), which were substantial, crisp and well-seasoned. The prawn inside was cooked perfectly with just the slightest bite, which helped maintain the structure of the spring roll when you bit into it.\nThe smoked seer (Rs. 600) was also enjoyable for the most part. It was a tad on the dry side, but that's if we were being very critical. The portion wasn't particular large, although it was a decent starter portion for two. The seer was evenly cooked with just the right amount of smokiness. It was, however, a bit heavy on the pepper so it may not be to everyone's tastes.\nAfter some mental math, we finally came around to our mains. We started off with the quintessential hot butter cuttlefish (Rs. 535 per 100g). The portion you see above was roughly 150g, which came to a reasonable Rs. 800. The dish itself was excellent, with a thin and crisp, almost crackling-like batter — a welcome change from the norm. It was also quite robustly seasoned, with a good degree of saltiness and spice.\nWe also tried the Singapore chilli-style crab meat (Rs. 535 per 100g). This turned out be one of the best dishes of the night. The beauty of this dish was that it negated the biggest issue I have with eating crab outside of home: the mess that ensues from having to get through the shell. In this case, the crab meat was shaped into small, lightly-fried balls cooked in Singapore chilli sauce. The thick sauce clung to the crab meat and brought in a good mix of sweet and spicy flavours.\nThe white curry prawns (Rs. 580 per 100g), in contrast, was a letdown. First, we were quite disappointed to find that the cooked portion was far less than the initial weight. (Perhaps that's something we should have anticipated). Second, the curry itself was bland, besides the flavour from the curry leaves. A white curry is supposed to be light on spice, but this one was simply lacking seasoning.\nUnfortunately, the steamed garupa (Rs. 440 per 100g) also fell into the same boat (no pun intended) as the prawns. It was fresh like the rest of the seafood we tried, but once the head and the bones were removed, what we were left with was a pretty measly portion. This was a shame since the fish was cooked very well with acidity from lime, chilli and garlic.\nThe Lagoon is, without a doubt, one of the better-looking seafood restaurants in Colombo.  The decor is simple yet sophisticated, with the fresh seafood station acting as the centrepiece of the restaurant. You could consider it an upscale take on a fish market.\nService at The Lagoon was exceptional on all fronts. All the waiters were polite and knowledgeable, with at least two of them always around to attend to tables. Even when it came to selecting seafood, there was one waiter to advise us on how to pair our seafood with the preparations. All in all, we left thoroughly impressed with the level of service we received.\nWhile difficult, it is possible to spend Rs. 2,000 per head at the Lagoon and enjoy a wholesome meal, provided you steer clear of lobster (and have a fairly large group). Not all the dishes were pitch perfect, but we still feel that Lagoon is right up there with the best.\nThe Lagoon is the Cinnamon Grand's riff on a seafood restaurant. They serve up some high quality dishes along with top-notch service, but none of this comes cheap.\nThe Lagoon is a fine dining seafood restaurant located in Colombo's Cinnamon Grand Hotel. Freshly caught seafood is displayed upon a bed of ice and can be chosen with the preferred style of preparation and sides. It's very good, and very expensive.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/the-lagoon/review-54772",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_vHyxOh-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_nHgazH-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_cno2kV-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_OdWOLa-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_Bh5CBq-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_8W398m-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_eK7z2i-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_UVDs4p-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_MkCpHt-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_qosqbX-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_StHUoR-150x100.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/08/IMG_1665-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/08/IMG_1653-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/08/IMG_1652-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/08/IMG_1644-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/08/IMG_1642-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/08/IMG_1643-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/08/IMG_1648-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/08/IMG_1649-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/08/IMG_1656-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/08/IMG_1655-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/08/IMG_1635-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/08/IMG_1664-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/08/IMG_1659-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/08/IMG_1663-150x105.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_vHyxOh-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_cno2kV-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_UVDs4p-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_8W398m-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_nHgazH-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_Bh5CBq-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_qosqbX-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_eK7z2i-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_OdWOLa-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_MkCpHt-318x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://www.yamu.lk/wp-content/uploads/2014/02/tartar-on-beach-588x250.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/07/DSCF0119-588x250.jpg",
    "https://www.yamu.lk/uploads/dp/2016/08/XeyiyT47QP0lwSxe3a.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_vHyxOh-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_nHgazH-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_cno2kV-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_OdWOLa-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}