{
  "name": "The Colombo Swimming Club",
  "address": "148 Galle Road, Kollupitiya, Colombo 3",
  "open_until": null,
  "telephone": "0112421645",
  "description": "It’s called the swimming club, so this ought to be a good place for a swim - and it is. Apart from splashing it out in the pool, you can also dive into their excellent club-level food.",
  "reviews": "The Colombo Swimming Club is perhaps one of the most well known clubs in Colombo. It's got a bit of history and traces its roots back to 1936 when British expatriates needed a sort of family club with a pool. The pool's big and all but the food is what makes the biggest splash.\nNow, if you’re a carnivorous lad like me, or a hulking monstrous barbarian, try out their meaty mixed grill(Rs.950). This steaming, sizzling platter of succulent cuts of meat and sausage (Lamb, pork, chicken, beef) is the sort of feast you’ll see in an Asterix comic. It has a scanty portion of veggies on the side, which is perfect. A serving of pineapple is mixed up in the dish which offers a seductive sweetness. The portion, which comes with mash and egg by the side is huge. So, eat this only if you’re very, very hungry, or have finished ploughing through the legions of Caesar himself.\nIf you’re not exhausted and spent after wrestling with the mixed grill try their dark side of the moon (Rs.250). This is essentially a chocolate sundae, drenched with chocolate sauce and nuts. Yes, before you ask you get a cherry and wafer too (yippee). It’s a fairly large, tasty option that comes at a decent price considering other sundaes.\nSince its inception the CSC has been known for its exclusivity.  Its service is good and its seaside location is ideal if you want to spend an evening to simply unwind. Evenings are pretty active and crowded. More often than not they feature a buffet, sandwich promotion or the like (Good luck getting parking on weekends).\nThe evening staff consists of veterans who’ve served for years and are likely to remember you and your usual orders. \nThe club itself is actually large and apart from the two pools, features a bar, a separate enclosure honouring the late member Arthur C. Clarke, a fully equipped gym, and even badminton and squash courts. It also has rooms for guests though the rates are a tad bit steep.\nThe main building, the Storm Lodge, was made pre-independence and still retains its 20th century colonial facade. The rest of the buildings are airy, modern and complement the lodge well.\nClubs like this will usually cost you big time to sign up, but if you’re a member or have been the guest of a member you’ll know it’s well worth your while.\nIt’s called the swimming club, so this ought to be a good place for a swim - and it is. Apart from splashing it out in the pool, you can also dive into their excellent club-level food.\nIt’s called the swimming club, so this ought to be a good place for a swim - and it is. The pool isn’t going to win any awards for design, but its large, and just feet from sea. Once again though the pool might be the only place on the club’s terrace from where you don’t get a sea view, but you do get an eyeful of the old club house and the Colpetty’s skyline while you’re splashing about.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/the-colombo-swimming-club-pool/review-47662",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_LAfk0j-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_DHWR0m-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_qdS5Ss-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_xTSjlT-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_ysmaZt-150x100.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/11/DSCF1444-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/11/DSCF14451-150x105.jpg",
    "https://www.yamu.lk/uploads/dp/2015/07/r7ukSszy258MtvRTun.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_LAfk0j-640x426.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_ysmaZt-640x491.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_qdS5Ss-640x375.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_xTSjlT-380x480.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_DHWR0m-640x283.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_mOENRl-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/05/yimg_wPMcog-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2015/07/r7ukSszy258MtvRTun.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_LAfk0j-640x426.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_DHWR0m-640x283.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_qdS5Ss-640x375.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_xTSjlT-380x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}