{
  "name": "The Verandah (Galle Face Hotel)",
  "address": "2 Galle Road, Colombo 3",
  "open_until": null,
  "telephone": "0112541010",
  "description": "The Galle Face Hotel is one of Colombo's oldest, best known hotels, established in 1864. Over the years it's provided food and shelter to many a revered name: Yuri Gagarin, John D. Rockefeller, Prince Phillip and Richard Nixon, to name just a few. They've changed over the years and we decided to pop in to see how they're doing.",
  "reviews": "The historic Galle Face Hotel's Verandah is now a full-fledged restaurant that serves lunch and dinner buffets with one of the most gorgeous views in the city. The buffet's original price is 2783, but taxes and service charge round it off at Rs. 3500.\nWe went in at lunch time and the buffet consisted of a range of salads and cold cuts for starters. The cuts were fresh and the salmon especially was beautifully pink and delicious.\nThe main theme here was a fusion of Oriental, Indian and Sri Lankan Cuisine with Sri Lankan being the main focus. However, at Rs. 3500, the variety of food presented here was limited. For island dining, there was also little to no seafood.\nThe focal dishes were typical steamed white rice, red rice and basic Sri Lankan curries that were prepared exceptionally well. The\ncurry in particular was excellent as it wasn't too soggy but not too tough either and had a nice chillli tinge to it. The stir fry however, was disappointing as the mushrooms and corn seemed to have been poured straight out of a can.\nThe Thai style chicken was juicy and thoroughly marinated in what tasted like a mixture of lemon, honey, chilli and some other secret ingredient. I liked this one a lot because I could taste the chicken through the marinade, it was well-balanced.\nThe Tandoori chicken though, not so much. It tasted rather bland which was disappointing and the flavour isn't anything to get excited about. This was a bit of a let-down because how could you possibly go wrong with Tandoori chicken?\nI will however, give them points for how well cooked and fresh the meat is.\nThere's a Make-Your-Own-Noodle-Soup station that's full of ingredients like Vegetable Tom Yum soup and Oriental Chicken Broth along with basic add-on ingredients like bok choy, mushrooms, really good tofu etc. They also had chicken and seafood dim-sum which were both well-made and delicious.\nWe ordered the Fish and Chips (Rs.1,509 all inclusive of taxes) off the a la carte menu since we were dining by the sea, and this was the highlight of our day. The fish steak was massive. The crispy batter was light and the fish itself was soft. The fish was served with some tartar sauce and a dish of 'mint-crusted' peas. The chips were chunky and basically perfect.\nThe desserts that are served as part of the buffet consisted of your typical range of  fresh fruit, sweet treats like panna cotta, mousse, bite sized portions of cake, brownies and cheesecake.\nI picked out the blueberry panna cotta, mango mousse and the brownies along with the chocolate chip cake.\nThe cake itself was dry, and felt like it'd just come out of the fridge. The brownies though were delicious - the chocolate brownie was intense and the white chocolate brownie had to be the best out of the two. It had a tiny meringue drop on top so you got a nice crunchy, chewy bite. The blueberry panna cotta was fine, albeit a little runny. The mango mousse tasted more like mango sunquick with yoghurt but in terms of presentation it looked very appealing so I couldn't resist.\nThe service was up to standard, the waiters were friendly and I appreciate that they'd always keep our water glasses full at all times.\nThe restaurant itself is beautiful with creamy white pillars, black rattan chairs and glass tables that would be enough to seat about 70+ people on a busy day.\n, you're looking right out onto the sea, and you can see silhouettes of vessels out on the horizon.\nYou WILL however be interrupted by a few unexpected visitors every now and then. There are a few squirrels who aren't the least bit afraid of us menacing humans and they'll happily jump onto your tables and wave their tails about the place. One of them managed to snag a fry off our plate. Here he is:\nThere's also a rogue crow or two who annoy the living daylights out of the gardener and chefs by mockingly flying in and out of the place.\nWe didn't mind the wildlife but some people might find this disturbing.\nWe're not sure the buffet is worth Rs. 3500 a head. But we'd visit again solely for the view, and the a la carte Fish and Chips. Make sure you visit for lunch, or make an early reservation for dinner so you can catch a last glimpse of the setting sun.\nThe Verandah is now a full-fledged restaurant that serves lunch and dinner buffet meals at a questionable  price range with a limited variety of cuisines to choose from.\nThe Galle Face Hotel is one of Colombo's oldest, best known hotels, established in 1864. Over the years it's provided food and shelter to many a revered name: Yuri Gagarin, John D. Rockefeller, Prince Phillip and Richard Nixon, to name just a few.\n\nගාලු මුවදොර හෝටලේ  ලස්සන වගේ කෑමත් හොඳද? පොඩ්ඩක් බලමු.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/the-verandah-at-galle-face-hotel/review-128134",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_AlDbOS-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_0RCoLO-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_hu8ahr-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_L4DXVz-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_Ekpcyu-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_VCuiBz-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_OC3GRw-150x100.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_6NTJym-150x100.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/09/DSC01400-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/09/DSC01409-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/09/DSC01414-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/09/DSC01415-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/09/DSC01420-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/09/DSC01421-150x105.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_YwCqzT-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_4x6gVT-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2017/05/yimg_oNQ4NF-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2017/01/sFOlV64o5GU2djDVqy.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_Ekpcyu-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_0RCoLO-640x471.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_YwCqzT-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_L4DXVz-640x398.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_hu8ahr-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_VCuiBz-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_6NTJym-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_OC3GRw-640x444.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_mOENRl-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oKIYgP-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_AlDbOS-640x423.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_0RCoLO-640x471.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_hu8ahr-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/09/yimg_L4DXVz-640x398.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}