{
  "name": "The Grand – Espresso Bar",
  "address": "45, Colombo Road, Negombo",
  "open_until": " Open 7 AM–7 PM",
  "telephone": "0777393684",
  "description": "The Grand is a little coffee shop along the bustling  Colombo Road in Negombo. They serve really good drinks and some killer cheesecake for very decent prices.",
  "reviews": "The Grand is a coffee shop with a nondescript exterior, but don't let that put you off. They whip up some great stuff (especially coffee) at even greater prices, particularly when compared to what you'd pay in Colombo.\nIt's a small, cosy space, with a sofa, a cushioned bench, and several tables scattered around. There's also an outdoor seating area at the back. It is minimal and unpretentious, and has a good vibe that has a lot to do with the staff, who are friendly and always smiling (what a difference a smile can make!).\nThey have a counter full of common breads (buns, pastries etc), and also offer a variety of teas, coffees and cakes.\nWe placed an order for a Hot Chocolate and an Iced Mocha and then sat down with a generous slice of Blueberry Cheesecake.\nThe cheesecake (Rs. 220) was totally worth the price. With a thin biscuit crust, a soft, creamy texture, and gooey blueberry topping, this is THE perfect cheesecake. The cream cheese was not too sweet, and the blueberries had just the right amount of sweetness to balance the rest of the cake out.\nOur Hot Chocolate (Rs. 150) and Iced Mocha (Rs. 250) came next.\nWe have to say that both drinks were presented really nicely. The Hot Chocolate looked like it had two shades, thanks to the milk-and-dark-chocolate art\non top.\nIt\nlooked too pretty to mess up and made us feel bad about drinking it, but wuttodoo. It sadly had to be tasted.\nFor Rs. 150, that hot choc came in a pretty large mug. This was legit hot chocolate, unlike the watery or too-thick versions I've tasted around Colombo. It was thick, creamy, and actually hot, not lukewarm. (Btw, we saw cans of Cadbury's Hot Chocolate lining the shelves along the wall behind the counter, so it's most probably what they use ;-))\nThe Iced Mocha was a paradox because the coffee's flavour was strong, yet both strong yet subtle at the same time. It tasted as it should of chocolate with a hint of coffee (or was it coffee with a hint of chocolate?) We loved it! Both flavours blended into each other perfectly, and the taste and texture was just right. It also comes with a generous serving of whipped cream at no additional charge.\nService was top-notch. The staff are friendly and helpful, and make you feel welcome. The  ambience is nice too, although I think it's something of a cross between that of a relaxed coffeeshop and a bakery. It would be good to have a few more couches spread around , but given that this is right along the Negombo Road, I guess a lot of people drop in just for a quick bite as well.\nThe Grand is a quaint and friendly little coffeeshop which could possibly top its more popular contemporaries in Colombo. The prices are wallet-friendly and their portions are generous. You get really good value for money, and I've been told that they're very consistent as well, so you probably won't be disappointed even if you drop in a few months or years from now.\n",
  "yamu_rating": "We love this!",
  "url": "https://www.yamu.lk/place/the-grand/review-52897",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_piKi3E-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_UYZB2j-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_SlK1cG-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_17S0m9-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_Iol4Kb-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_emB6MF-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_dnwDJO-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_YWWDtt-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_yuRMvB-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_Trt3bD-150x100.JPG",
    "https://www.yamu.lk/uploads/dp/2015/08/bf9TdKPSlnqFHMaZrC.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_SlK1cG-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_YWWDtt-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_yuRMvB-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_Trt3bD-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/05/yimg_4iB4Y2-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/02/yimg_ry8Ca1-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/VBxu8OQlwaXM6zpakX.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_piKi3E-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_UYZB2j-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_SlK1cG-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_17S0m9-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}