{
  "name": "The Sushi Bar (Samurai) ",
  "address": "Porutota Road, Negombo",
  "open_until": " Open 11.00AM - 3.00PM, 6.00PM - 11.00PM",
  "telephone": "0312279500",
  "description": "This Japanese stopover is a wonderful addition to Negombo's popular stretch of restaurants. The food and service are great and they've got a sushi conveyor belt in the evenings.",
  "reviews": "The Sushi Bar aka Samurai is a new Japanese restaurant on the Porutota stretch in Negombo. The food we tried out was very fresh and tasty, service was excellent, and we didn't end up spending much either. Unfortunately we visited in the daytime so we couldn't try out their kaiten zushi (the sushi conveyor belt), which is switched on only after 5PM.\nThe menu here is pretty extensive - the only thing they didn't seem to have were bento boxes. Everything sounded surprisingly affordable for quality Japanese food, in the Rs. 800 - 1000 range. We ordered some fresh sashimi, sushi rolls and a Japanese dessert.\nThis plate of California rolls was a very pleasant surprise: eight massive rolls, beautifully presented, for just Rs. 980. California rolls are typically made inside-out, with the seaweed on the inside and the sticky rice on the outside, stuffed with a bit of cucumber, crab meat and avocado. This was very fresh and light, and more than enough for two.\nOur salmon sashimi came in six pieces, delicately sliced and incredibly fresh - we were really happy with this one. This cost Rs. 880 which is good when compared to Japanese favourites in Colombo (five pieces at\ncosts about Rs. 900).\nJapanese desserts, at least the ones we've tried, tend to be way richer than the mains so it's an acquired taste - either you'll love it or hate it. We were recommended a sweet, warm bowl of Zensai, which is basically mochi or rice cake soaked in red bean soup. Mochi is chewy and interesting and very sweet, but overall this is a really, really sweet dish, and there's a lot of chunky rice cake, so we wouldn't recommend it unless you have a big sweet-toothy appetite even after your main.\nThe restaurant is one long, simply, pale themed space, simple but sleek. One row of tables line the glass wall that looks out onto the hotel hub that is Porutota Road, and the other is next to the sushi conveyor belt which functions in the evenings. There's also a bar near the entrance that serves mocktails in the Rs. 350 range and local and foreign liquor in the Rs. 350 - 500 range (the bottles are fancier at about Rs. 3000+). There's also a stretch of tables outside if you feel like catching some sun.\nThe place, being in Negombo's hotel central, is unsurprisingly frequented by tourists from the area. Service was very good during our visit - even one of the restaurant owners stopped by our table to say hi, and our waitress was well versed with the menu and more than happy to help us pick out our meals.\nSamurai is a great addition to the restaurant scene in Negombo, especially since the place has more generic beachside eateries than any memorable ones. It may even be the only restaurant on this stretch that specializes in Japanese. The food is fresh, well presented, and not overly pricey - we'd recommend a drop-in if you're in town.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/the-sushi-bar-samurai/review-46112",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_NW6Myw-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_mZcRn4-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_ZPXGO3-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_5J0van-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_hoIlUV-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_DWx1ff-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_C1F2V3-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_ibfehA-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_lVb35R-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_lweGwP-150x100.JPG",
    "https://www.yamu.lk/uploads/dp/2015/06/Be7FWdmIZXRAmC8tEt.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_NW6Myw-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_ZPXGO3-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_5J0van-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_C1F2V3-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_ibfehA-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_DWx1ff-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_Z9mUmz-600x250.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_sdbGWc-600x250.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_NW6Myw-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_mZcRn4-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_ZPXGO3-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_5J0van-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}