{
  "name": "The Boulevard ",
  "address": "No 33, Queens Road, Colombo 03",
  "open_until": " Open 11.30 AM - 2.30 PM & 6.30 PM - 11.30 PM",
  "telephone": "0112055425",
  "description": "The Boulevard, formerly a cafe/restuarant, has been completely revamped into what we'd consider one of the top Thai restaurants in Colombo. With chef Mama (former head chef at Royal Thai) at the fore, as well as some outstanding food, this is one place to keep an eye on.",
  "reviews": "The Boulevard has been completely revamped into what we'd consider one of the top Thai restaurants in Colombo. With chef Mama (former head chef at\n) at the fore this place delivers some outstanding food already.\nWhen we did our initial review of the former Boulevard, we actually really liked the place. The problem, however, was the fact that they seemed to lack identity, which is probably why they didn't get as many customers as they should have. They recently closed down for a few months, and reopened with a brand new look and Thai theme. We really like the fact that they went all out with everything from the look of the restaurant to hiring arguably the most experienced Thai chef in Colombo.\nAs you may have guessed, with all this hyperbole there has to be a catch somewhere, and that comes in the form of prices, which are undeniably high, so expect to pay at least Rs. 2000 per head. That being said, we feel that the food here is actually good enough to justify the cost.\nWe started things off with the classic tom yum soup (Rs. 650), which was excellent. Everything about this one was on point with a myriad of different flavours from the galangal, kaffir lime leaves, cilantro, chili, mushrooms and of the prawns. This one is plenty spicy but the soup itself is slightly creamy which balances everything out beautifully, so you won't be bawling your eyes out.\nFirst up for our mains was another Thai classic - pad thai goong (Rs. 900). We immediately noticed the similarity to Royal Thai's rendition, but this one has a bit more kick to it, which we liked. The rice noodles were cooked perfectly, with all the elements of the pad thai sauce coming through beautifully with the ever so slight tang from the tamarind and saltiness of the fish sauce. They're also not stingy with the prawns which were also perfectly stir fried along with the eggs.\nMoo yang (Rs. 1000) is basically grilled pork kebabs, which is a popular Thai street food. This is my kind of kebab, which is to say that it's all pork. The preparation itself is quite simple but whatever marinade they used really brings out the flavour here. It's served with a creamy tamarind sauce which really enhances the dish by adding a bit of sweetness.\nThe Boulevard has also jumped on the hot butter cuttlefish bandwagon with their meuk pad hang (Rs. 1350) which is a Thai HBC. This one was entirely different from the Chinese renditions you find everywhere else since they add a lot more ingredients, a more puffy batter and what we think was that pad thai sauce. You get to taste a bit of everything from salty to sweet to tangy, which makes this one of the best HBC you can get in the city.\nOur final side was the Thai beef curry (Rs. 1200) which was also a winner. What you get is large chunks of beef in a thick gravy with a good amount of green peppercorns for heat. While the beef was cooked well, this dish was all about that gravy which was full of flavour. Even with this one they add a considerable amount of coconut cream to the gravy so that it isn't overpoweringly hot.\nFor dessert we had the sticky rice with mango (Rs. 800). When it came to table I was convinced that this was just far too expensive, but one bite and I was immediately thinking \"goddammit, this tastes amazing!\". The mango here is almost inconsequential, but that near translucent rice is a perfect combination of sticky texture, creaminess and sweetness.\nLike we mentioned earlier, we think they did a stellar job of completely revamping Boulevard, especially considering how fast they did it. The interior has a nice blend of traditional and contemporary decor with a jade and beige coloured theme which works surprisingly well together. We can see this being a good location for a date, office lunch or even for groups.\nSpeaking to the waiters we were told that they've retained most of the staff from The Boulevard of old, which means they aren't newbies. A couple of them seemed a bit aloof, but the rest were friendly, attentive, knew the menu by heart and were not afraid of giving us a few suggestions.\nWe really like the new Boulevard. It's run by the\n, and they've hired an excellent chef and manager. We get the feeling that in time to come, it could become one of the top restaurants in the city, assuming that they keep their standards up.\nThe Boulevard, formerly a cafe/restuarant, has been completely revamped into what we'd consider one of the top Thai restaurants in Colombo. With chef Mama (former head chef at Royal Thai) at the fore, as well as some outstanding food, this is one place to keep an eye on.\nThe Boulevard has been hidden away on Queen's Road for a while now. We'd gone past it a bunch of times, but never got the chance to have a bite. We finally dropped in, and all we can say is that we regret not having gone there earlier.\n",
  "yamu_rating": "We love this!",
  "url": "https://www.yamu.lk/place/the-boulevard/review-49797",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_GhmYgS-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_j6MpvG-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_bex0mv-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_ePC9G9-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_bv3Wej-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_PRwj4V-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_aW8Fsp-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_CIenhT-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_M9m1FK-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_W6YXv6-150x100.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/08/DSCF0967-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/08/DSCF0968-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/08/DSCF0965-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/08/DSCF0948-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/08/DSCF0955-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/08/DSCF0952-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/08/DSCF0962-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/08/DSCF0970-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/08/DSCF0957-150x105.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_GhmYgS-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_bex0mv-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_M9m1FK-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_bv3Wej-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_j6MpvG-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_PRwj4V-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_CIenhT-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_aW8Fsp-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_ePC9G9-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_W6YXv6-318x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_mOENRl-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/12/yimg_m5n55O-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://www.yamu.lk/uploads/dp/2015/07/q1vXZX3kbX7iQTSdNX.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_GhmYgS-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_j6MpvG-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_bex0mv-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_ePC9G9-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}