{
  "name": "The Fab (Wattala)",
  "address": "394, Negombo Road, Wattala",
  "open_until": " Open 6 AM - 8 PM Monday to Saturday\n7 AM - 7 PM Sundays and Poya days",
  "telephone": "0115112232",
  "description": "Fab is one of the older and more established bakeries in town. The franchise is well known for its cakes.",
  "reviews": "The Fab in Wattala is a welcome new addition to the ever-evolving Hendala\nJunction. Just a hop and a step away from the Arpico Supercentre and right\nopposite Hemas Hospitals, this is a good spot for a quick snack if you're\npassing by, or want to place an order for a cake.\nThe Fab franchise is well known for its cakes, and in addition to whole\ncakes, they generally have slices on sale as well. That wasn't the case when we\nvisited, however. They seemed to be out of stock in the cake department —\nexcept for a few whole cakes on display, they didn't have smaller pieces up for\ngrabs. That's a pity, given that it is a bakery after all.\nOn the other hand, they had a range of bites including pastries, sandwiches,\nmuffins, cookies, and brownies. We went for a cherry muffin (Rs. 140), a\nstuffed-date cookie (Rs. 70), a sultana and nut muffin (Rs. 140), a fish\nstuffed chillie (Rs. 70) and an iced coffee (Rs. 80).\nPriced at Rs. 140, we didn't think that the cherry muffin was worth the\nprice. For one, it was small, and more like a tart rather than a muffin. The\ntaste and texture of the base was more like a pie than a muffin. Instead of the\ncakey-sponginess of a good muffin, we got a crumbly base that became softer in\nthe middle. The only hint of cherry flavour we got was from a gelatinous dollop\non top of the muffin, so this was a disappointment.\nThe almond and raisin muffin had a bit more bang for the\nbuck. It (a)\nand\n(b)\nWith these basics\ncovered, and at the same price as the cherry muffin, this one was a clear\nwinner among the two. It was soft and felt fresh, with lots of chopped almonds and raisins. The chopped almonds\nadded texture, while the raisins gave it a burst of sweetness.\nNext on the list was the stuffed date cookie. This didn't look like a cookie\nin the traditional sense, with a thick layer of date-and-almond mixture\nsandwiched between two doughy layers. It was more like a date-roll or a pie\nthan a cookie. The flavour of the date mixture came through quite\nstrongly, with a spot of almond mixed in. The powdery crustiness of the\n'cookie' went well with the sticky date mixture.\nIf you've got a penchant for sugary liquids with a slight dash of caffeine,\nthe Fab's iced coffee is for you. It tastes a bit like the iced coffee you\ncould whip up at home if you combined Milkmaid and Nescafe, and then\nrefrigerated it for an hour or two. There's a hint of coffee, but it's a bit\ntoo sweet for my liking. This isn't to say that the coffee is bad—it isn't—but\nit's still a bit too saccharine for me.\nThe highlight of the small snacks was the fish stuffed chillie. This was\n. It was not a letdown like\nour classic\nbuns,\nwhere you'd need a microscope to find where the fish is. This was a salty,\nslightly spicy, well-combined mixture of fish and potatoes stuffed into a\ncapsicum, which was then rolled in breadcrumbs and fried for that crispy touch.\nThe capsicum went well with the fish and sambol, and added a slight touch of\nsweetness to the overall taste.\nIn terms of service, the staff are friendly and efficient behind the\ncounter, but slow when it comes to clearing the tables and having a clean\nseating space ready for waiting customers.\nThe Fab doesn't have the chilled-out ambience of a coffee shop, but the\ndrop-in-for-a-bite vibe of a fast-moving bakery. It's spacious, and there are\nfive to six tables placed around. However, there were also a\nof flies when we visited, and this made\neating comfortably quite difficult. It would be nice if they could invest in a\nbug-zapper to alleviate the fly-situ.\nThe Fab in Wattala has a convenient location, and is a good place to stop by\nfor a quick bite at any time of day. Based on what we had, I'd say their\nstuffed chillies are better than their baked goodies, and that their iced\ncoffee is passable.\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/the-fab-wattala/review-54072",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_HPX8m7-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_TO8AIm-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_ecs85N-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_QjXJ9m-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_6Yyq50-150x100.JPG",
    "https://www.yamu.lk/uploads/dp/2015/08/bf9TdKPSlnqFHMaZrC.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_ecs85N-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_TO8AIm-320x480.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_6Yyq50-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_Jw5H7t-600x250.JPG",
    "https://www.yamu.lk/uploads/files/2015/02/yimg_Zcotzd-600x250.JPG",
    "https://www.yamu.lk/uploads/dp/2017/11/C4cTBYs5tKhL2h1qNi.jpg",
    "https://www.yamu.lk/uploads/dp/2017/11/C4cTBYs5tKhL2h1qNi.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_HPX8m7-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_TO8AIm-320x480.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_ecs85N-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_QjXJ9m-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}