{
  "name": "The Ceylon City Hotel",
  "address": "11, Upatissa Road, Colombo 4",
  "open_until": " Open All Day",
  "telephone": "0112508000",
  "description": "The Ceylon City Hotel is one of the newer new age hotels in Colombo. It's got good facilities at decent prices.",
  "reviews": "The Ceylon City Hotel is one of those new age city hotels that cater to tourists looking for accommodation at flexible rates. It has a good few things up its sleeve and is an ideal spot if you’re looking for a short stay in Colombo.\nGiven the name ‘Ceylon City Hotel’, I expected the place to be extremely regal and grand in terms of architecture and style.  It isn’t any of these (which isn’t necessarily a bad thing) but the CCH finds itself stuck in between the crispness of the new age and the slightly garish trends of the past (eg. Glossy gold paint) .  The Hotel itself can feel a bit small, akin to most new age hotels in Colombo today.\nHowever, where the hotel fails in term of style and architecture it makes up for in rates, facilities, and friendly staff. They can organise tours for you and arrange for your travel to/from the airport. They’ve even got a small conference room for small meetings. If your flight is late, there’s an all day coffee shop to give you that much needed espresso boost.\nThe hotel has thirty-seven snug looking rooms in three categories: Standard, Deluxe and Junior Suite. The rates cover the room, and a range of facilities (A/C, Wifi, and Cable TV to name a few) and breakfast for two. All bathroom sizes are the same and come with hot water and toiletries. Given that this is Colombo the rates are pretty affordable.\nThe Standard Room comes in at 70USD and is the cheaper option compared to the larger Deluxe (80USD) and Junior Suite (95USD) options. Room service and laundry is available all day too. The rooms themselves are very well maintained though some sport colours that lean towards the loud. I preferred the crisp, lighter rooms.\nBy the way, they've been nominated for Sri Lanka's Leading Family Resort in the 22nd World Travel Awards. Not bad considering they've been in the business for less than a year.\nI'm going to be straightforward here. Flamingo, the hotel's main restaurant, is open for \noutsiders as well as guests. Stylistically, it feels jarringly out of place with the rest \nof the hotel. It, like the rest of the hotel, is clean and well maintained, \nno doubt about it, but there’s just something about the style that keeps getting to me. \nFor the life of me I can't put my finger on it. It's a fairly large restaurant with a panorama \nof the Colombo cityscape. Urbanisation however has spoilt the potential this view has to offer. \nYour shore view is blocked by nearby concrete boxes and sprawling towers steal your sunset. But this is Colombo after all.\nNow for the good stuff. Their menu has a decent selection of Asian and Western cuisine. \nI ordered their Club Sandwich, Cream Caramel, and Hot Chocolate. These were pretty good \ntaste-wise and personally I enjoyed them. Their sandwich had a good serving of cheese and \nmeat and the fries were done nicely.\nThe cream caramel, what many may regard to be boring, was actually one of the better ones \non my list. I avoided the healthy stuff like cut up fruits (being the rebel I am) and walloped \nthe sugary goodness. The syrup on the serving complemented the cool caramel well. Their hot \nchocolate was alright. One thing I appreciate about their warm drinks is that everything isn't hot enough \nto scald your tongue, but just warm enough.\nWhile Ceylon City Hotel loses points on ambiance and style, it has an array of facilities at decent pricing in addition to good service. The location is ideal if you want to scour Colombo’s popular hubs. You can compare this to\nsans the crispness of its architecture and pool.\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/the-ceylon-city-hotel/review-47026",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_yaeI2t-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_0TLp66-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_qrS1il-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_JIjFRy-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_LgmwiI-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_4qG95L-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_1OER05-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_xPzEga-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_3OpCvS-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/07/r7ukSszy258MtvRTun.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_4qG95L-640x426.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_yaeI2t-640x426.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_LgmwiI-640x426.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_xPzEga-640x426.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_JIjFRy-640x426.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_0TLp66-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/05/yimg_wPMcog-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_mOENRl-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_yaeI2t-640x426.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_0TLp66-640x426.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_qrS1il-640x426.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_JIjFRy-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}