{
  "name": "The Sushi Bar (Samurai)",
  "address": "226, Sri Jayawardenepura Mawatha, Sri Jayawardenepura Kotte",
  "open_until": " Open until 11:00 PM",
  "telephone": "0703551551",
  "description": "The Samurai Sushi Bar has finally established themselves here in the Big City (they're in Rajagiriya, but still). ",
  "reviews": "Samurai is on the floor above Bread Talk in Rajagiriya. They've got an awesome logo so you can't really miss them. We walked in for lunch at around 12:30-ish, with growling tummies and walked out satisfied.\nTheir menu consists of a range of Japanese fare including some interesting desserts.\n\nThe Tuna Sashimi (Rs. 780) comes with a few slices of well-prepared tuna resting on some sort of julienned carrot and a slice of cucumber for decoration. The tuna was excellent, and tasted like the live fish instead of the dead, sea-water soaked corpse we are so used to in some restaurants. But yeah. The tuna was succulent and slips right down your throat. It's a good starter if you feel like nibbling on something light.\n\n\nFrom their sushi platter section, we opted for the Assorted Sushi Silver Platter (Rs. 1,680). It comes with 6 pieces of nigiri (tuna, squid, salmon, barramundi, shrimp, egg, and a crispy fried tofu pocket), one piece of roe maki and 6 cucumber rolls.\nEach piece of nigiri is actually well done but I must admit some of the fish was placed slightly askew which made picking it up with chopsticks a tricky task.\nThe squid nigiri was very very chewy but I liked it. If you're fussy then stay away from the squid. The rest of the elements on the plate were pretty basic but satisfying nevertheless. The tofu pocket was crispy but rather oily and the roe maki roll was served with oodles of roe. The cucumber rolls don't make you sob with joy but they'll fill you up all the same. The platter's a fairly good deal for just Rs.1,680 too.\n\n\nThe Ramen in Miso (Rs. 1,180) as you can see in the picture above; tastes as delicious as it looks. The noodles weren't soggy at all and tasted delicious thanks to having soaked in all the goodness from the miso soup. It came garnished with a few bits of delicious chicken, steamed vegetables, two delicate slices of\n(fish cakes), half a boiled egg, spring onions and two large sheets of seaweed. All elements in this dish were executed well and there really isn't anything to find fault in save for the fact that they could have served more miso soup.\nWe got a pot of Green Tea (Rs. 270 for a small pot) which serves four cups and is more than enough for two. The tea was your average green tea, but it was a nice accompaniment to sushi.\nFor dessert we went for the Mango Sweetened Snowflakes (Rs. 350) which is really just shaved ice doused in mango syrup. It isn't a big deal but is quite, quite refreshing. As the ice melts it doubles as a drink so I suppose it's convenient — but not special.\nThe Tempura Ice Cream (Rs. 450), on the other hand is an absolute treat. It's a scoop of deep fried ice cream, served with mango and a sauce that tastes a lot like\nThis is probably because the gravy/sauce was infused with chillie and vinegar: something that contrasts strongly with the sweet mango and ice cream. When eaten with the ice cream it's a burst of flavour and leaves the tongue confused because you have no idea if it's sweet, sour or savoury. The ice cream melts fairly quickly but I can guarantee you won't leave it for that long once you've had a spoonful.\nThe staff are a friendly and polite bunch. They check on you every so often without it being intrusive or annoying. They also know their way around the menu well so if you're confused just ask and they'll help you out.\nThey have a separate floor for larger groups so call ahead and make a reservation if you're going in with more than 5 people.\nThe restaurant has a quaint and quirky ambience to it with tiny wooden tables and chairs. What I absolutely loved was the mural depicting a fight scene between two samurai. It's a brilliant touch and really livens the place up. Very Samurai Jack. For you anime lovers this is a cool place to chill at and talk about Attack on Titan or whatever.\nThey're not cheap by any means, but I'd say this is definitely a good place to get sushi if you're not up for forking over thousands of rupees. The place is cosy, the staff is pleasant and the food is great. Definitely a must-visit.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/the-sushi-bar-samurai-2/review-159977",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/02/yimg_wZHxyG-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/02/yimg_r6hKdP-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/02/yimg_uSrsg5-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/02/yimg_inw9oc-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/02/yimg_zWDYsL-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/02/yimg_fs8vgn-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/02/yimg_jU86dc-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/02/yimg_ZgFSrV-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/02/yimg_7mRwuP-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2017/01/sFOlV64o5GU2djDVqy.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/02/yimg_wZHxyG-640x419.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/02/yimg_zWDYsL-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/02/yimg_inw9oc-640x328.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/02/yimg_r6hKdP-640x444.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/02/yimg_uSrsg5-640x449.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/02/yimg_7mRwuP-640x430.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/02/yimg_ZgFSrV-640x461.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/02/yimg_jU86dc-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/06/yimg_MRVOpj-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_Z9mUmz-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/02/yimg_wZHxyG-640x419.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/02/yimg_r6hKdP-640x444.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/02/yimg_uSrsg5-640x449.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/02/yimg_inw9oc-640x328.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}