{
  "name": "The Shore By O!",
  "address": "College Avenue, Mount Lavinia",
  "open_until": " Open 11 AM–11 PM",
  "telephone": "773295760",
  "description": "As far as beach bars go, Shore By O! is by far the most popular. Not all their drinks are excellent, but they do the best beer cocktails around and their bites aren’t too shabby either.",
  "reviews": "As far as beach bars go, The Shore By O! is by far the most popular. Not all their drinks are excellent, but they do the best beer cocktails around and their bites aren’t too shabby either.\nBack in 2013, Shore By O! took up the space formerly occupied by The Golden Mile on Mount Lavinia Beach.\nSince then, it's become arguably the most frequented beach bar around. The main reason for its continued success: value for money, especially when it comes to the booze. If you’re a fan of beer, Shore is tough to beat in terms of price, with a pitcher of Lion Lager costing Rs. 900. Cocktails are also very reasonably priced, ranging from Rs. 350–Rs. 850.\nEven though Shore is open from 11 AM to 11 PM, they don’t serve alcohol between 2 PM to 5 PM. Unfortunately, we forgot this minor detail on our first visit, so I ended up having the tongue in cheek (Rs. 300) which is a cranberry, lime and lemonade virgintail. The predominant flavour here is definitely cranberry, which coupled with the lime, makes this a very tangy drink. It may not be everyone, but fans of citrus my find themselves liking this. I couldn't help but feel that it could have done with a dash of vodka.\nOn our next visit, we got there in time for the booze. Our first pick was the arrack sour (Rs. 400), which seems like a new addition to the menu. Shore’s cocktails have impressed us in the past, but we can't really recommend this one. It comes in a tall glass but it’s diluted to the point that you can barely taste the arrack. Had someone handed it to me as a lemonade, I probably wouldn’t have\nThe pol adi (Rs.450), on the other hand, was excellent. It’s a somewhat unorthodox combination of arrack, stout, orange and passionfruit, but they all work beautifully together. It’s not too heavy on the stout, but you still get that almost coffee-like flavour, along with kick from the arrack and acidity from the passion fruit and orange. Besides this we've also tried a couple of their other beer cocktails (the dark knight & red sun), which were also on point.\nOur past experience with Shore’s mains were quite disappointing, so we weren’t really looking forward to the food on this visit either. This time around, however, we decided to try only their bites and came away a lot happier. Again, the prices are quite reasonable compared to their contemporaries, with all of the finger food priced under Rs. 1,000 for decent portions.\nTheir grease yaka style pork (Rs. 550) was more or less the classic devilled pork preparation, albeit done well. The pork was cooked nicely with the thick sauce binding to it, adding the requisite seasoning. The portion wasn’t huge, but we’d say it was adequate for two. This one looks quite spicy, but in reality it’s not all that bad. There is a bit of heat, but it’s more of an undertone.\nWe hadn’t tasted Shore’s beer marinated HBC (Rs. 700) before, but after trying it, we think it deserves a spot on our\n. This is simple, batter-fried cuttlefish with shallots, spring onions and dried chilli flakes, but the kicker is the beer marinade that adds more depth of flavour. It also helps soften that cuttlefish, so you experience a beautiful contrast in texture between the crispy batter and the soft cuttlefish.\nWe wrapped up with their tiramisu (Rs. 350). We’ve enjoyed it in the past but on this occasion found it way too heavy on the cream cheese. The cheese was quite dense making this a lot richer than it needed to be. Needless to say, the ratio of cream to sponge was way off as well, with just a very thin layer that didn’t add much in terms of texture or coffee flavour.\nShore wins style points purely for its location. While Mount Lavinia beach isn’t in the best state, Shore still offers a beautiful view of the ocean. They’ve also got one of the longest bars around (which is where we’d suggest sitting for expedited service). Drop in around 6 PM on a clear day and you can catch an excellent view of the sunset.\nService at Shore has been mostly pleasant during our visits, but we’ve heard that it can get pretty slow during crowded nights. The attentiveness of the waiters also depends on where you’re seated. If you’re at the bar, you’ll get your drinks in no time. But if you’re seated in one of the cubicles along the sides, you’ll likely find yourself looking for someone to take your orders, which isn’t ideal.\nWe’re glad to see that The Shore By O! has stuck to what it does best: serving up affordable drinks at a great location. With the beach just a few steps away, the atmosphere is also pretty tough to beat.\nAs far as beach bars go, Shore By O! is by far the most popular. Not all their drinks are excellent, but they do the best beer cocktails around and their bites aren’t too shabby either.\nThe Shore By O! has become of the most popular venues to go out and have a drink with friends. It's still one of the most affordable places in town, with the obvious allure of the beach, but we feel they've let their standards drop.\nAs far as beach bars go, Shore By O! is by far the most popular. Not all their drinks are excellent, but they do the best beer cocktails around and their bites aren’t too shabby either.\n\nෂෝ බයි ඕ! නිලවශයෙන් විවෘත වුණේ මේ ඉරිදා. ඒක පරණ ගෝල්ඩන් මයිල් තිබුණ තැන පටන් ගත්ත විශාල බාර් එකක්. ඒක තියෙන්නේ හරියටම ගල්කිස්සේ මැද. ගල්කිස්ස කොළඹ සිට පැය භාගයක් තරම්වත් දුරයි. ඒත් දැන් මේක තමයි එහෙ තියෙන හොඳම තැන.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/shore-by-o/review-52939",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_JJ8jB3-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_UjBzzz-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_3OTelQ-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_Q4TgGP-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_dapdkF-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_tZJ0P7-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_uVPMkc-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_YGyIeR-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_XZP0sR-150x100.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/11/DSCF0634-150x100.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/11/DSCF0647-150x100.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/11/DSCF0621-150x100.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/11/DSCF0641-150x100.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/11/DSCF0642-150x100.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/11/DSCF0635-150x100.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/11/DSCF0636-150x100.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/11/DSCF0626-150x100.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/11/DSCF0620-150x100.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/11/DSCF0624-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_Q4TgGP-318x480.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_uVPMkc-318x480.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_JJ8jB3-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_dapdkF-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_3OTelQ-640x462.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_tZJ0P7-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_UjBzzz-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_XZP0sR-318x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_YBjNF1-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oKIYgP-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2015/07/r7ukSszy258MtvRTun.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_JJ8jB3-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_UjBzzz-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_3OTelQ-640x462.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_Q4TgGP-318x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}