{
  "name": "The Red Pineapple by Torana",
  "address": "618, Galle Road, Colombo 03",
  "open_until": " Open 8AM–8PM",
  "telephone": "112581412",
  "description": "Nestled among the Torana shops on Galle Road, this little eatery serves up a good fried rice, a hefty chow mein, and quite a range of juices.",
  "reviews": "With a wide range on offer, The Red Pineapple by Torana is a competitively priced Sri Lankan and Mongolian food place on Galle Road, Colpetty. There's hardly any space to sit inside, with just enough seats for ten people, but the kitchen seems to pump out ten parcels at a time, with delivery boys shuffling to meet the workday lunch orders. We decided to check this place out for lunch, and were quite pleased with our dine-in experience. The seafood chow mein was generous, and their juices were flavourful. Later, we tried their delivery service, particularly to try their Burger With A Lot, but that turned out to be a bad idea.\nI like noodles, so I decided to try the chow mein. The seafood chow mein (Rs. 450) is the perfect portion for the average Colombo appetite, and we managed to share it between two people.\nThere’s a hefty amount of seafood that’s thrown into the mix, with long chunks of cuttlefish, your average sized prawn, and\nsized fish cubes that you can’t possibly miss.\nIt wasn't aggressively seasoned, and although the noodles were quite oily, they weren't distasteful. We didn’t taste an excessive amount of MSG, but there was definitely some of its magic at work.\nThis is where The Red Pineapple surprised us. We ordered ambarella juice (Rs. 130) and were recommended a mango and passion fruit juice (Rs. 180) in addition. They were both really, really good.\nThey blend their juices to a fine consistency. That worked quite well with the ambarella, as the fruit doesn’t lend itself too well to juicers. If you've tried the thick, 'medicinal' juices at the Good Market, these are a lot more favourable in comparison.\nMango and passion fruit work really well together, combining the goopy viscosity of the mango and the crunch of the passion fruit seeds. We really enjoyed our juices and wanted more. They have got quite a range, from blends and smoothies to straight-forward juices. Starting at Rs. 100 for a lime juice, the pricing is very fair.\nQuite pleased with the dine-in experience, I decided to give the burger menu a shot and went the delivery route. When I called them, I was told that they only deliver orders of a minimum total of Rs 1,000. All I wanted was the Burger With A Lot (Rs. 480), but I tacked on a Devilled Cuttlefish (Rs. 500) to meet the requirement.\nI placed my order at 3.15 PM, at which point I was informed that their delivery boys had not returned yet, and they expected a delay. I said I’d like to have my food arrive by 4 PM and they said they’d be able to deliver. Alas, at 4.20 PM, munchies abound, I rang them again, and they said the delivery guy had just left the restaurant.\nThe food arrived at 4.45 PM, and not long after we opened up the packaging at the office, regret filled my stomach.\nThe Devilled Cuttlefish was a goopy mess, visually, and a saccharine wreck in terms of flavour. It tasted of the cheap, corn starch-laden tomato ketchup you get at pastry shops. There were capsicums in the mix, too, but none of that heat really came through. And given the late delivery, there was no heat to speak of anyway.\nAlthough the cuttlefish came in quite a generous quantity, the massive rings were not too convenient to eat. They even included some pieces with the suckers, which was a nice touch.\nOn to the burger, the grand promise that had me hooked thanks to its catchy and imaginative name. The Burger With A Lot was a strange composition, with a bottom bun, a top bun, and even some bun in the middle. The salad leaf had withered under the weight of the other ingredients. The other fillings included a fried egg, fried chicken, tomato, onion, and a large, chunky disk of pineapple.\nThe flavours didn’t work too well together, simply because the pineapple was too large, and made for a jarring first bite. The bun was far too dry, which was off-putting.\nThe Red Pineapple is great for people who work in Colpetty and would like to dine in or have take away during lunch. You have to place lunch orders by 10AM, and they only deliver to Colpetty. Their rice looks pretty good, and we quite liked their noodles. Stay away from the burgers and don’t try their BBQ unless you’re dining in, because their delivery isn’t quite up to scratch as yet. You can't go wrong with their juices though. We recommend the mango and passion fruit juice.\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/red-pineapple/review-60664",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_K7jE5B-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_wNeDHy-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_XxRFAW-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_9KYs6w-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_HzpWCe-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_LppuGn-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_vEfdIz-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_VAQL1L-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_vFaKuL-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_Mp24Oh-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_k5IAb0-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_Oj6hBG-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_mhjYNQ-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_WgyAcO-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_OwNk4l-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/12/0F34X3pTfLr7btifJN.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_vEfdIz-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_9KYs6w-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_LppuGn-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_K7jE5B-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_VAQL1L-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_HzpWCe-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_XxRFAW-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_wNeDHy-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_HUDWRP-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/11/yimg_cHD7lg-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_K7jE5B-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_wNeDHy-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_XxRFAW-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_9KYs6w-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}