{
  "name": "The Gardenia Coffee Shop (Ramada) ",
  "address": "Ground Floor, No. 30, Sri Mohamed Macan Marker Mawatha, Colombo 3",
  "open_until": " Open Open 24 hours ",
  "telephone": "112422001",
  "description": "The Gardenia is Hotel Ramada's main restaurant, and they do a wide range of cuisines, from Italian to Jaffna, that are good value for money. ",
  "reviews": "The Gardenia Coffee Shop at the Ramada hotel is actually much more than a coffee shop - they do a very wide range of food types, from sandwiches to Italian pastas and Jaffna mains. The food we tried was pretty good and not too pricey either.\nThere's a lot of different random stuff on the menu - burgers, grills, Sri Lankan food, a few Jaffna dishes, Italian - so we picked one from a few sections. The prices are quite affordable considering the portions, with most dishes in the Rs. 600 - 800 range.\nWe asked for a barbecued cheese steak, priced at Rs. 850. This featured two chunks of cut meat, we weren't asked how we wanted it prepared but it felt firm and about medium. The meats were covered in a layer of cheese and bedded on mashed potatoes, with sides of chicken ham and fresh vegetables - nothing grand but a filling, tasty meal, though the meat was tougher than to my liking.\nOur spaghetti carbonara was very well put together - it's a huge portion for Rs. 700 that took a while to finish. Plenty of warm liquid cheese, olives, chicken ham and chicken bacon. Delicious, mild and more than enough to fill you up, but note that everything here is facon (fake bacon) so those of you who want actual pork in your dishes will be disappointed.\nThe nasi goreng was the bomb diggity. This is an Indonesian or Malay dish which has become a big favourite in Sri Lanka, usually featuring rice stir-fried with meats, and a mix of sweet and spicy ingredients like sweet soy sauce, chilli and tamarind. It's typically presented with the mound of rice wearing a sunny-side-up egg hat. The one here was brilliant for only Rs. 550 - the rice had a very rich, spicy flavour, even without the chilli paste, with a bit of sweetness in there, and a lovely mix of fragrant stir-fried shrimps.\nThe unexpected winner for me was the mutton poriyal, a bonus dish we randomly thought of trying from the small Jaffna menu. For Rs. 750, this is a hefty dish enough to be shared among two or three people. It's an excellently prepared perattal, with very tender, flavoursome chunks of mutton tossed and fried in a bevvy of onions, chillies and spices. It's authentic, an absolute treat if you enjoy spicy food, and I'd recommend just having this with some bread or rotti.\nThe Gardenia has a lovely, cosy ambience, with tasteful light fixtures and soothing paintings on the walls. The music was faint and varied from Indian mystical to the soundtrack of the movie 300. It can get very crowded though, so best to call and make a reservation. Our waiter was friendly, but most customers seemed to be there for the buffet, so we suspect they weren't at all prepared for us ordering off the menu - our steak, spaghetti and nasi goreng took almost an hour to get to our table.\nThe Gardenia at Ramada is a wonderful place for a satisfying meal, especially with a group of friends or family. They seem to do a good job at different cuisines, though I suspect their strongest suit is their Asian foods. It's also thankfully not expensive, surprisingly so for a big hotel, only coming to about Rs. 1000 a head, which is great considering quality and portions.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/the-gardenia-coffee-shop/review-48659",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_rrZzWU-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_lOh5M4-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_NxCi9s-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_IDRWYN-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_yXdOe6-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_pM8aW3-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_zvUrof-150x100.JPG",
    "https://www.yamu.lk/uploads/dp/2015/06/Be7FWdmIZXRAmC8tEt.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_IDRWYN-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_lOh5M4-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_rrZzWU-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_NxCi9s-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_yXdOe6-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oKIYgP-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_mOENRl-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_rrZzWU-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_lOh5M4-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_NxCi9s-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_IDRWYN-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}