{
  "name": "The Lounge (Cinnamon Lakeside)",
  "address": "115, Sir Chittampalam A. Gardiner Mawatha, Colombo 02",
  "open_until": " Open until 01:00 AM",
  "telephone": "0112491000",
  "description": "The Lounge is located at the Lakeside lobby and will serve you almost anything from coffee to dessert to sandwiches.",
  "reviews": "The Cinnamon Lakeside lobby was arguably the hotel lobby to be seen in, back when its only competitor was the lobby at the Cinnamon Grand. But these days, hotel lobbies don’t seem to be fashionable places to go out of your way to hang out in. Or I could be wrong, how would I know? I am not very fashionable (cry).\nCoffee Stop at the Cinnamon Grand offers more secluded spaces for socializing, and you also have more reasons to go there, because it’s close to a lot other places that attract foot traffic. But that’s just like, my opinion bro.\nThe Lounge, like Coffee Stop, operates out of the lobby. It has terrible Wi-fi, so coming here to work is not an option. So why would you come here? Maybe you’re a guest, need to kill some time, or you want to have a quick business meeting perhaps? For that kind of thing, The Lounge will do.\nI walked in around brunch time, so I ordered some papaya juice (a little steep for a medium sized glass at Rs. 320) and a smoked salmon bagel (Rs. 800). The juice was unsweetened and all natural. Slightly on the sour side, but overall it was decent.\nThe bagel though, was definitely above average. The bread was the right texture, not crispy and hard, not soft and soggy. It also tasted rather neutral and didn’t interfere with the fillings. The salmon had a firm consistency but was also soft and easy to bite into. The feta cheese complemented its salty flavor well. Lettuce, cucumber and onion provided a crispy sensation, and put green things into my stomach .\nThey have good coffee, I tried the mocha latte (Rs. 360), very smooth. And it left me wishing I had a more expansive coffee vocabulary to break it down.\nThe Lounge is also shcizophrenic in a good way, and doubles as The Sushi Bar after 12 a.m. It offers a range of sashimi, sushi, maki, donburi, teriyaki and tapanyaki dishes. I tried the chicken Katsudon (Rs. 1000), it was a generous portion and more than enough for a really hungry guy with a massive appetite, which I was that evening (I'm a little schizo as well). The chicken was fresh, crispy on the outside and flavorful.\nThe rice was soft, but a little too grainy, while the sauce (consisting of soy sauce, rashi powder and sugar) wasn't really doing it for me. But the dish came with juicy egg, nicely seasoned with dried seaweed, onions and spring onions which added great texture and taste that made up for the too sugary sauce.\nIn the daytime it’s not very exciting, actually some might argue that it’s downright boring. Nothing much has changed since the Lakeside opened and maybe I’ve just seen this place too many times, but the muted cream walls and burgundy-and-grey patterned carpets are just a little shrug inducing. The Lounge has a very uh, hotel lobby feel, it is not pretending to be anything else. But again, nothing here compels you to make a special trip to visit the place.\nIn the evenings however, the place becomes far more pleasant. There is live music (piano) and the lighting makes the décor much more interesting. The lobby also gets more crowded then, but not too crowded to be claustrophobic.\nBrilliant. I got everything quick and fast, and was treated like royalty. It gets slower in the evening when there are bigger crowds and the waiters are busier.\nA decent place to hang at if you happen to find yourself needing to kill time at the Lakeside, or if it’s the closest option you have.\nThe Lounge's ambiance can change drastically depending on when you go, evenings are lively, mornings aren't. The cuisine is reliably good.\nFood with a view. Of people.\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/the-lounge-cinnamon-lakeside/review-208218",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/12/yimg_shgxKT-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_7L5DCg-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_wPbLIG-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_x05A5D-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_MhEpHE-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_Ps32GV-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_hdbDC7-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_oFEmDs-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_SnnDkc-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/12/yimg_coujgr-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/12/yimg_UU7iXd-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/12/yimg_RmRqvs-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/12/yimg_coujgr-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/12/yimg_shgxKT-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/12/yimg_UU7iXd-640x387.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_HUDWRP-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_mOENRl-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/12/yimg_shgxKT-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_7L5DCg-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_wPbLIG-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_x05A5D-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}