{
  "name": "The Mango Tree",
  "address": "82, Dharmapala Mawatha, Colombo 3",
  "open_until": " Open 12 PM–3 PM, 7 PM–11 PM",
  "telephone": "0117620620",
  "description": "Mango Tree is a hugely popular Indian restaurant on Dharmapala Mawatha, serving mainly North Indian cuisine. The food is very rich, and quite good.",
  "reviews": "The Mango Tree down Dharmapala Road boasts of authentic North Indian cuisine. For the most part, it doesn't disappoint. YAMU\nthis place in early 2013, and it didn't win too many accolades back then, mostly due to crappy service. We figured that a place could change a lot in two years, and decided it was time to check it out again — and we were happily not let down.\nWe walked in for lunch, and it was more than half-packed even though it was a weekday. As luck would have it, there were about two tables free, and we were ushered towards them as soon as we walked in. We were then presented with the menu and a basket of complimentary\n.\n.\nThe stewards were efficient and service was quite fast. We received our orders within 15 minutes. A single portion at Mango Tree is more than sufficient for two people (including the soups). We started off with the soup, a chicken shorba (Rs. 450).\nWe really liked the chicken shorba because of how flavoursome it was. The consistency was thick and somewhat creamy, while also being subtly spicy at the same time. The heat hits you really slowly, so your mouth kind of waters for a few minutes after you've finished slurping it up.\nAccording to the description on the menu, the dum aloo punjabi (Rs. 795) had whole potatoes stuffed with onions, cottage cheese and vegetables, and cooked in an onion gravy. This dish was heavy and sweet, and 'onion gravy' isn't really as weird as it sounds. The onions didn't have that overpowering smell or taste. We had this both with the\n(Rs. 250) and with the steamed Basmati rice (Rs. 425), and it paired really well with both. As you can see in the photo below, the potatoes were drowned in the oniony paste. This is definitely one of the better vegetarian dishes I've tasted for the sheer amount of flavour in it, and I'd recommend it even though it's on the pricey end of the spectrum.\nThe chicken tikka masala (Rs. 975) was also delicious, but I think it was a bit too expensive for the amount of meat in it. If I recall correctly, there were only about five little pieces of chicken, and we would have liked more (especially since that dish alone came up to nearly a thousand bucks). Although it looked red and hot, this dish wasn't spicy. We liked it, but I personally didn't think it's worth it. Notwithstanding the meat, though, the gravy was a generous portion that could probably have served about four people.\nWe don't have pictures of the drinks, a fresh papaya juice (Rs. 450) and masala tea (Rs. 295), but both of them fared well. The papaya juice tasted fresh and wasn't too watery or too thick. It practically tasted like a papaw itself. I loved the masala chai though, and it was definitely worth the price given that there were more than two teacups full of tea in the pot.\nService was pretty fast and the stewards were good. Some of them seem rather young and new, and lacking a bit of confidence, but they did their job efficiently, serving the food the first time around and clearing the plates as soon as we were done. (In one humorous instance, the steward spooned rice on to my plate and then walked off, making my friend wonder about gender equality). The ambience is one of an upscale restaurant. The seating arrangements are a bit too crowded-in for my liking, and they could be spaced out a bit better, but overall it's a pretty nice place. It's an expensive restaurant, frequented by many foreigners.\nThe Mango Tree whips up some pretty nice dishes, especially of the vegetarian kind. The flavours feel (and most probably are) authentic, with an underpinning of cinnamon, garlic, cloves, cardamom and other spices, as opposed to the flat and generic taste you get in most other places. They also serve really nice masala tea. The prices are somewhat expensive though, and don't include taxes and the service charge.\n\n\nThe Mango Tree is one of the better (and more popular) Indian joints out there, specialising in North Indian cuisine. Although the prices are definitely upscale, the authentic flavours and attentive service justify the premium.\nMango Tree is a hugely popular Indian restaurant on Dharmapala Mawatha serving mainly North Indian cuisine. The food is very rich, but it can be good. Order wisely.\n\nමැංගෝ ට්‍රී කියන්නේ ඉතා ජනප්‍රිය ඉන්දියන් අවන්හලක්. ආහාර හොඳයි. හිතා බලා ඇණවුම් කරන්න.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/the-mango-tree/review-56140",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_Ax2kfk-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_Ax2kfk-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_MJF4Nv-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_L8Lqqr-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_A20ZAN-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_Ssljjk-150x100.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/04/photo-7-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/04/photo-8-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/04/photo-10-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/04/photo-111-150x105.jpg",
    "https://www.yamu.lk/uploads/dp/2015/08/bf9TdKPSlnqFHMaZrC.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_MJF4Nv-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_A20ZAN-640x430.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_Ax2kfk-640x447.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_Ssljjk-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_L8Lqqr-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_qqlXHB-600x250.JPG",
    "https://www.yamu.lk/wp-content/uploads/2014/09/DSCF9533-588x250.jpg",
    "https://www.yamu.lk/uploads/dp/2015/07/uzI50We9CRr1yYpFEF.jpg",
    "https://www.yamu.lk/uploads/dp/2015/07/uzI50We9CRr1yYpFEF.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_Ax2kfk-640x447.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_MJF4Nv-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_L8Lqqr-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/09/yimg_A20ZAN-640x430.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}