{
  "name": "The Beach Wadiya",
  "address": "2 Station Road, Wellawatte",
  "open_until": " Open 11 AM to 3 PM,  6:30 PM to 11 PM ",
  "telephone": "112588568",
  "description": "Beach Wadiya is an old school beachside restaurant in Wellawatte. The service is fast and the food is good, but not excellent.",
  "reviews": "Beach Wadiya is an old school beachside restaurant in Wellawatte. The service is fast and the food is simple and good, if not mind-blowing.\nBeach Wadiya has been around since the 70s so it's very popular among Colombars looking to get some seafood. Their menu is actually surprisingly small and entirely seafood based. You generally only get what they've bought from the fishermen, in our case this meant only seer fish, crabs, prawns and cuttlefish were available.\nWe asked them if them if we could get a crab omelette, but apparently they were running short on eggs as well. When it comes to prices they aren't too bad but a few dishes like the prawns and crab tend to be bit expensive.\nFor our carb we had no choice but to go for the fried rice (Rs. 375), which was pretty average since it was just a plain fried rice with no seafood. For Rs. 375 you get a portion which is just enough for two which is fine.\nThe hot butter cuttlefish (Rs. 575) was by far the best dish we had during our meal. Unlike most other spots, they fry the cuttlefish in a thin bread crumb batter which was a great change up from the contemporaries. The seasoning was also on point with a good balance of saltiness and spice.\nThe garlic prawns (Rs. 1250) were fresh and tasty, but a bit expensive at the end of the day. You get seven pan-fried large prawns (with the heads) in a light garlic sauce. We would have preferred the garlic sauce with a bit more seasoning but the prawns themselves were fresh and chunky. This was honestly quite nice but we just didn't feel it justified the price.\nThe devilled crab (Rs. 950) tasted good, but we wouldn't say it's one of the best crab dishes in town. The problem here was that there wasn't enough meat in the crab, which can be pretty disappointing when you've gone all in with your hands covered in gravy. The gravy, while being a bit oily, had good balance of of flavours with enough heat to be a \"devilled\" dish.\nThe entire experience of dining by the beach is one of the main draws at Beach Wadiya, but unfortunately this time around we came away less than impressed. We dropped in for lunch and took seat in the outdoor section. In retrospect this was a mistake, since we practically ended up sharing the table with a bunch of crows who seem to think they're food ninjas, trying to grab stuff off the plates on the table. The beach strip near Wellawatte isn't the cleanest, but this is all the beach you get in Colombo itself.\nIf you're dining during the day we suggest sitting indoors unless you're prepared to be vigilant. Plus it's super hot anyways. The place is a bit more romantic at night.\nThe service is generally fast but not really that friendly. The waiter that served our table seemed irritated when we asked him if we could get that crab omlette and the other one was trying to scare the crows away with a slingshot, but failed spectacularly at it.\nDespite the somewhat unappealing state of the beach, Wadiya is a pretty good place to get your seafood fix. Their hot butter cuttlefish in particular is excellent.\nBeach Wadiya is an old school beachside restaurant in Wellawatte. The service is fast and the food is good, but not excellent.\nThe ancient progenitor of all Colombo’s seafood restaurants.\n\nකොළඹ මුහුදු ආහාර අවන්හල් අතරින් ආදිතමයා\n\nகொழும்பின் மிகப்பழமையான கடலுணவு உணவகமான \"பீச் வாடிய\" 70களில் வெள்ளவத்தை கடற்கரையில் ஆரம்பிக்கப்பட்டது.அன்றிலிருந்து  கிடுகு குடில், கண்டிப்பான உபசரிப்பாளர்கள், முகாமையாளரான ஒல்வின், நுழைவாயிலில், அவர் இருக்கும் மேசை என பலவிடயங்கள் மாறவில்லை.\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/the-beach-wadiya/review-43795",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_ZaxpmE-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_blo1bA-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_vwe99c-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_iZUFXQ-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_WrmA8T-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_onWjOR-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_0W3gI6-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_iT6ZuD-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_blo1bA-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_ZaxpmE-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_iZUFXQ-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_vwe99c-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_WrmA8T-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_onWjOR-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_iT6ZuD-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_0W3gI6-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_5YTlbU-600x250.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oKIYgP-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_ZaxpmE-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_blo1bA-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_vwe99c-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_iZUFXQ-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}