{
  "name": "The Bavarian Garden (Water's Edge)",
  "address": "Boardwalk, Battaramulla",
  "open_until": null,
  "telephone": "0777236239",
  "description": "A German restaurant at the Boardwalk's outdoor premises.",
  "reviews": "Colombo's\nis very limited, despite a pretty established Deutsche expat community. So the entrant of the new Water's Edge spot was welcome. Unfortunately, our experience wasn't spectacular.\nThe menu comes up on a sleek little tablet, which is very easy to use and navigate. The prices too seemed incredible (too good to be true, as we'd soon find out), with most mains under Rs. 1000. A fair warning, this is not a place for vegetarians, as every main featured some sort of meat. The options seemed fairly authentic, with a selection of Bavarian starters and mains ranging from bratwurst to pork knuckle.\nWe opted for a Schweinsteak, which was a roasted pork steak topped with mushrooms, potato salad, sauerkraut, onion and bacon sauce at a paltry Rs. 900. We also asked for a Weisswurst sausage with sweet mustard at Rs. 650, but it wasn't available so we went for a Chicken Schnitzel with potato salad at Rs. 750.\nThe food came out in a surprisingly short 10 minutes, beautifully plated and in fairly hefty portions. Unfortunately, that's where our glee ended. The steak was unbearably chewy and bad cuts of meat cooked within an inch of becoming a Goodyear tire. The waiters only provided us with a butter knife, but even after we upgraded to a proper knife (they didn't seem to have steak knives), it was almost impossible to incise. Chewing was another horror show, and I kept having to remove large chunks of gristle and inedible meat from my mouth. The sauce, sauerkraut, and kartoffelsalat were quite good though.\nThe schnitzel was likewise flat panels of dry crumb-fried chicken. With almost no discernable flavour and no moisture to be found, this dish didn't satiate us but it made us thirsty. Again, the accompanying salad was fine.\nOur dessert was possibly the most disappointing aspect of them all, as we opted for one of my favourite dishes of all time,\n. I didn't expect it to be exactly like the beautiful, hot, flaky pastries you encounter in Vienna, but I also didn't expect it to be some sort of lukewarm love cake ensconced in flat, old coating reminiscent in texture of a stale fish pie shell. Needless to say, we didn't finish a single dish.\nTheir drinks menu has a lot of beer, both local and imported, at fairly reasonable prices. You can get a small draft of Lion Lager for as low as Rs. 250 and a litre for about Rs. 800. They also have imported brands like Erdinger and Magners, if you're flush with cash. We noticed a beer cocktails section, so thought we'd try the Dancing Angel (which sounded a lot like something playing at the Rio Cinema after dark).\nA watery concoction of indiscernible beer and rum, and very strong ginger and lime, this was kind of miserable at Rs. 550.\nThe place is just the garden area of the Boardwalk. It overlooks the Diyawanna Oya, a lovely and peaceful waterbody surrounded by joggers and the less-peaceful Parliament.\nThe seating areas themselves are good for groups of about 6, and it's spacious enough if you want to be a bit loud. They also generally have the match of the day showing on a large projector screen, which the uncles appeared to be enjoying.\nEverything was fine ambience-wise barring the nondescript entrance and the kind of uncomfortable seating.\nUnlike the rest of our experience, the waitstaff was actually good. They were friendly and checked up on us often. However, there was a lot of confusion actually finding the restaurant as there was almost no information available online, and when we got to the Water's Edge lobby we were greeted by a host of confused bell boys and valets who sent us back to the Boardwalk. The security guard there told us there was no German restaurant and to go back to the main building, which we did (again), and they sent us back to the Boardwalk (again). Finally, we decided to investigate the Boardwalk and the manager there told us the Bavarian Garden was the outdoor section.\nThis restaurant seems to be a random expansion from the Water's Edge management, with a serious lack of care or commitment. There isn't a single sign, entrance panel, or branding to indicate that this restaurant exists, and the well-curated menu is executed with little understanding of how long meat should be cooked. Until they sort this out, we'd recommend you just come here for the beautiful lakeside view, or to catch the match over some reasonable beers.\n",
  "yamu_rating": "We don’t like it",
  "url": "https://www.yamu.lk/place/bavarian-garden/review-174632",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_nuu59D-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_nuu59D-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_kvGIEt-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_E4EY4W-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_CRfZH3-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_TX8ICS-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_gfDLdS-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_DtZVc4-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_ytr4zJ-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2017/04/KE2F77hW9uoRt7RHja.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_TX8ICS-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_DtZVc4-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_gfDLdS-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_CRfZH3-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_ytr4zJ-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_E4EY4W-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/06/yimg_z0GmSV-600x250.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_shDWlh-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_nuu59D-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_kvGIEt-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_E4EY4W-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/04/yimg_CRfZH3-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}