{
  "name": "The Tangerine (Calamansi Cove) ",
  "address": "Wijerama Temple Rd, Balapitiya, Sri Lanka",
  "open_until": " Open 7.30 AM - 10.00 PM",
  "telephone": "0772441114",
  "description": "The Tangerine is a gem of restaurant hidden away in Balapitiya at Calamansi Cove by Jetwing. As far hotel restaurants go, this is one of the best we've tried in recent times. Delicious food, beautiful presentation and good service.",
  "reviews": "The Tangerine is a gem of restaurant hidden away in Balapitiya at\n. As far as hotel restaurants go, this is one of the best we've tried in recent times. Delicious food, beautiful presentation and great service.\nHotel restaurants in general don't really have the best reputations when it comes to quality of food. There are, however, a few exceptions, and The Tangerine definitely qualifies. Since Calamansi Cove is a boutique hotel, The Tangerine sticks to a small menu. What's great though is that they offer a good variety of dishes, each with a whole bunch of elements that worked beautifully together. Prices are on the higher end, so expect the cost per head to push Rs. 2000. That being said, we definitely feel that the quality of the food justifies the price.\nTo start things off we had the roasted green pepper crustacean bisque (Rs. 950). This looks pretty innocent when you look at it but it actually packs some intense flavours and spices. The bisque itself was creamy with a good amount of seasoning and pepper. The green dots you see is the green pepper puree which is what really adds that burst of spice. That combination of creaminess and heat really works well together along with the additions of local flowers which also adds a bit of distinct, yet slightly understated aroma and flavour.\nFor our appetizer we had the stuffed calamari with madhu ganga prawns and butter nut creme (Rs. 1400). Now Rs. 1400 is expensive for an appetizer but every element on the plate was on point. The presentation itself will get your taste buds going. If you're wondering, madhu ganga prawns are similar to tiger prawns but a bit larger and softer in terms of texture. The best part of this dish though was the stuffed calamari which was composed of seared calamari rings with a well seasoned creamy filling. The seafood is served on a butter nut creme which is super smooth, adding a great contrast of textures among the three. This dish was also garnished with different local flowers, which both adds to the taste as well makes the dish look like something George Calombaris would be proud of.\nFor our main we chose the slow roasted pork neck with teriyaki calamansi reduction (Rs. 2100) which is one of their more expensive dishes, but with my love for pork, I just couldn't say no. In this case the pork neck had been slow cooked, pulled and served on a stock based puree along with crispy crackling and a generous drizzle of that teriyaki glaze.\nAll in all this was just brilliant, with tender meat cooked just right and the fat rendered beautifully. This is also one of the only places that has actually nailed the crackling. The predominant spice was star anise which does add a very unique flavour to the entire dish. One thing to keep in mind is that this isn't about copious amounts of food, what you get is well curated portions and courses.\nFinally for dessert we had the caramelized baby pineapple (Rs. 750), which is served with cinnamon brown sugar and passion fruit granita. They don't really have specific dessert options, instead the head chef will ask you what you prefer and come up with a custom dessert. This one was just a good way to end the meal, but as we expected it did have a bunch of things going on. The pineapple itself is quite ripe which is caramelized with cinnamon sugar and topped with a bit of pepper which may seem odd but actually works well with the cinnamon.\nThe Tangerine is a simple restaurant when it comes to looks, with the added benefit of being in close proximity to the beach and the pool. They've got seating for around 30, which is what they consider to be the amount that they can handle while individually speaking with the dinners.\nThe restaurant service is handled by the Calamansi Cove hotel staff, so the waiters were very professional and attentive. One thing that impressed in particular was that the courses paced perfectly, in such a way that you weren't sitting around for two too long.\nThe Tangerine is easily one of the best restaurants down south. The food is flavoursome and sophisticated, with well paced and professional service.\n",
  "yamu_rating": "We love this!",
  "url": "https://www.yamu.lk/place/the-tangerine/review-46282",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_BzdGO0-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_T6zP5G-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_9JSh0y-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_gk2Wn5-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_qTkoCM-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_abU30h-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_gk2Wn5-640x432.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_T6zP5G-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_BzdGO0-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_abU30h-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_qTkoCM-318x480.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_9JSh0y-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oKIYgP-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/12/yimg_m5n55O-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_BzdGO0-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_T6zP5G-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_9JSh0y-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/05/yimg_gk2Wn5-640x432.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}