{
  "name": "The Fresh Milk Shop (Kiri Kade)",
  "address": "No.52, Dharmarama Road, Wellawatte",
  "open_until": null,
  "telephone": "0112552565",
  "description": "Kiri Kade, which humbly began as a milk delivery service is one of the most well established milk delivery services we know of. They still deliver and their milk is still fresh and flavoursome.",
  "reviews": "The Fresh Milk Shop, commonly known as the Kiri Kade is a Wellawatte establishment that runs a delivery service as well as a milk bar. Popular among hungry, thirsty students, the Kiri Kade has an array of relatively cheap short eats and drinks to offer.\nKiri Kade when it first began was a popular stop for students and sportsmen alike. I fondly remember my rowing crew taking the place by storm every evening after practice to fill our stomachs with cheap samosas and fresh flavoured milk.\nWhat makes the Kiri Kade unique is that it has two unique flavours up its sleeve. Apart from the usual chocolate, strawberry and vanilla options its got almond, and banana (Though Banana wasn't available when I visited).\nI ordered three mugs - one chocolate, strawberry and almond. That's a lot of milk for one Yamu scout... I know. The chocolate is sweet, but has a pleasant ,somewhat grainy cocoa taste to it. I prefer this fresher option to the smooth artificial tasting packets found in supermarkets. Ideal for a warm day the chocolate is cool and filling.\nI have never cared much for the strawberry but there are people who prefer it. It tastes like ordinary strawberry to me - It's sweet and probably a good hit for kids. On the other hand the almond is a strange and delightful option. Because it isn't as sweet the almond tends to be popular with older students. What's nice about it is that it leaves the lingering essence of almond upon the tongue for just a moment after you've sipped it. I remember it being stronger though before KK reopened.\nDairy goods are always touch and go, but I don't recall anyone ever falling sick. It's legit fresh milk - you'll even find bits of the top skim floating around occasionally so don't be alarmed.\nThe Kiri Kade began like a hobbit hole. It was once a tiny stop - like the marriage of a fairly clean saivar kade and a tiny milk bar. Its gone under heavy expansion since - there's more seating and even a garage to house their sizeable fleet of delivery vehicles.\nThe bar itself is self service. The cashier is friendly enough, but that's about it. While they deliver fresh milk I've run into issues (before expansion) where the milk wasn't delivered to my door step. I'm not sure how good their delivery is now, but given the amount of motorbikes and tuks I saw  - there must be big demand. The downside- if you can call it one is that your  fresh milk will expire fast.\nWhile the Kiri Kade isn't excellent or downright amazing it is a good stop for students or the like to grab short eats and drinks. Their milk is filling, flavoursome and safe to drink (So far).\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/the-fresh-milk-shop-kiri-kade/review-48518",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_mezAB6-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_0Zw6mF-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_BxN0cF-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/07/r7ukSszy258MtvRTun.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_BxN0cF-640x534.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_mezAB6-640x369.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/02/yimg_88LCB4-600x250.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/02/DSCF4268-588x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_mezAB6-640x369.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_0Zw6mF-640x543.jpg",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_BxN0cF-640x534.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}