{
  "name": "The Bakery at the Edge (Waters Edge) ",
  "address": "316, Ethul Kotte Road, Battaramulla",
  "open_until": " Open 6.00 AM to 10.00 PM ",
  "telephone": "0112863863",
  "description": "Colombo's only drive-through bakery. They've got good ice cream and amazing chocolate fudge cake. ",
  "reviews": "We've tried the drive-thru option of The Bakery at the Edge previously, so we checked it out to dine in this time. As the name suggests, it's a bakery, at Water's Edge. They've got a little outdoor seating area, but that's just a no in this weather. Fortunately, they also have a cozy little interior with bar-like seating arrangements. In terms of food, they have your average bready items, confectionary, and coffees and shakes.\nWe've reviewed some of the confectionary before, including eclairs and what not, so we went for the bready stuff this time. They've got a few interesting options for buns, including a\nand soya bun. It's a regular looking bun, but is stuffed with this super spicy (think: peppercorn type spicy) sambol.\nTexture-wise, it's almost like the stuffing of the\n, sans the potatos. I can't say I got the flavour of either the\nor the soya, and the insides didn't look very\n-ish either. But the bun in itself was soft and fresh, so it was alright. Super spicy (I may have mentioned this a hundred times before) but alright. Also, it was priced at 98 bucks, which is a weird sum.\nNext up we tried the Tandoori Chicken Wrap (Rs. 414) which we were told would take 3 minutes to arrive at our table, but eventually reached us like 15 minutes later. This was much better than the\nand soya bun, with soft, succulent pieces of chicken in a fresh wrap.\nIt wasn't overly spiced, and the elements (greens, mayo) blended together quite well. There was plenty of chicken as opposed to being filled with onions and whatnot, so we're happy with this.\nThe drinks were sadly not on par, with the Cookies and Cream Milkshake (Rs. 345) being almost lukewarm and overly sweet, with no hint of cookies or cream whatsoever.\nThe Caffe Mocha (Rs. 266) was meh-meh, don't try it. Also lukewarm, with an unappealing frothy surface, and indistinguishable hit of caffeine which didn't really come through.\nOne whole wall being glass, along which there are long granite tabletops adjoining gives The Bakery a very well-lit and open-space ambience, despite the interior being quite small. It could seat about nine people, tops.\nThere's some nice wall art going on, and pretty decor what with colourful sand (powder? dust?) filled bottles adorning the higher shelves.\nService wise, the staff are very friendly but quite slow in delivering. This could be because they were busy managing both the drive-thru and the dine-in customers, but it was still a little frustrating especially when you're waiting ages for your bill.\nFrom what we've experienced, The Bakery's food is pretty good, and their ice creams are great too. We were there for about an hour tops on a Saturday and they seemed quite busy throughout. We'd advise you to not go for the drinks unless you're really really thirsty, but then again, there's this food court a few minutes away at Diyatha Uyana, near the large\n, where you can get something cooler to drink.\nThe Bakery on the Edge has good food and can easily satisfy your sweet tooth cravings. Drinks are meh, though.\nThis is Colombo's only drive-through bakery. We liked their ice cream and they have amazing chocolate fudge cake.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/the-bakery-at-the-edge-waters-edge/review-74883",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_1ZTPKQ-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_zdXzCF-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_A6qlOj-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_2SrxFQ-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_AT7gG3-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_vOP5jx-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2014/12/yimg_5lT8ty-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2014/12/yimg_RSpaby-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2014/12/yimg_RZt1AO-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2014/12/yimg_ex8eKz-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2014/12/yimg_cwmQGF-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2014/12/yimg_bDqofX-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/08/bf9TdKPSlnqFHMaZrC.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_A6qlOj-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_AT7gG3-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_zdXzCF-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_1ZTPKQ-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_2SrxFQ-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_sw6ktP-600x250.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/12/yimg_bIPRJe-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_1ZTPKQ-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_zdXzCF-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_A6qlOj-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_2SrxFQ-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}