{
  "name": "The Vu",
  "address": "249/15 Lewis Place, Beach Road, Negombo",
  "open_until": " Open 7.00 PM - 12.00 PM",
  "telephone": "0312244100",
  "description": "The Vu is the rooftop restaurant at The Beach in Negombo. It may be a new venture, but the food is good, the service is excellent and as you'd expect, the view is spectacular.",
  "reviews": "The Vu is the rooftop restaurant at\nin Negombo. It may be a new venture, but the food is good, the service is excellent and as you'd expect, the view is spectacular.\nRooftop dining is definitely a sought after nowadays, and when the location and the food is done right, it can make for an amazing experience. If you're in Negombo the choices for rooftop restaurants are limited, so we were happy to hear about The Vu. They offer a pretty extensive menu with a good mix of both western and Asian cuisine as well as some interesting local fusion dishes like the pork kalu pol. Prices are also quite reasonable with mains ranging between Rs. 750 to Rs. 2500.\nTo start off we tried the prawn and spinach soup (Rs. 550), which was a lot more intense than what we expected. It manages to be creamy, while still having a nice spice kick and just the right saltiness from the prawn broth, with the diced prawns and spinach leaves further adding flavour and texture.\nFor our main we went with the mixed grill platter (Rs. 2100). This comes with grilled chicken, two pork chops, beef steak, sausages, french fries and a salad. We were quite happy with this for the most part, but it did have a few areas for improvement, namely the sausages and the beef. The sausages they used were store brought, which wasn't really bad, but they could do better if they made their own. The beef while cooked and seasoned well, was a very thick cut which made it quite difficult. They also need to work on the presentation.\nThose two aside, all the other elements were great. While we weren't really expecting the salad, it was very fresh and added a nice contrast to the meats. Both the chicken and pork were cooked and seasoned beautifully, with the one of the best barbeque sauce's we've had in a while. We just wished there was a bit more of it.\nFor dessert we tried out the passion fruit mousse (Rs. 550). This was the first time I had this type of mousse and it was actually really tasty. From what we could taste, the mousse itself was made with a mix of condensed milk and cream with a passion fruit topping to add acidity and cut through the sweetness. All in all a great way to wrap up the meal.\nThe rooftop ambience is one of the high points when dining at The Vu, with a great view of the beach and the surrounding area. The open air dining also works great with the light sea breeze and makes for a good option for both a family dinner or a date.\nThe service at The Vu, as with\n, was very professional, attentive and helpful. The staff makes it a point to drop in at each table to inquire if they require anything and this was the case for every table with a waiter assigned to each. At the end of the meal the manager went by each table getting feedback and taking notes, which is great to see from any restaurant.\nThe Vu is one of the few spots in Negombo to enjoy a legit rooftop dining experience with great service to boot. The restaurant is still in it's infancy, but besides a few minor details, they seem to know what they're doing.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/the-vu/review-39837",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_xQx3jk-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_5mfPn2-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_F0U45A-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_jGgV3Y-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_5L0uxq-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_4eZtD8-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_Nt5mnx-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_QH2rrc-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_5L0uxq-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_xQx3jk-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_QH2rrc-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_5mfPn2-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_jGgV3Y-640x359.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_F0U45A-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_Nt5mnx-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/05/yimg_vsJCcO-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/10/yimg_mOENRl-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_xQx3jk-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_5mfPn2-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_F0U45A-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/01/yimg_jGgV3Y-640x359.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}