{
  "name": "Thinesh Bake House",
  "address": "180, Jaffna-Manipay Road, Jaffna",
  "open_until": null,
  "telephone": "0212255370",
  "description": "You'll be pleasantly surprised by the quality of the breads, biscuits and baked goods at this Jaffna bakery and cafe. ",
  "reviews": "Here's an interesting fact on bakeries in Jaffna. Long before gluten-free became a buzzword, the city's bakeries had got the formula down pat. Wheat flour was difficult to procure during the war years, so they swapped it with rice flour instead.\nBut if Thinesh Bake House, a surprisingly high-quality bakery in Jaffna is anything to go by, the city's bakers haven't been able to resist the lure of refined flour since. All the biscuits, breads and baked goods boast the signature springiness of wheat flour. Glossy, fresh and amply sized, they also prove that the secret of good things lies in the little details.\nGiven that we eat with our eyes first, an attractive showcase is the strongest sales pitch for a bakery. Let's just say Thinesh Bake House had us sold. With neatly packaged breads, biscuits and cookies at eye level and a glass showcase full of baked goods that looked sumptuous, it didn't take too much convincing for us to load our tray with multiple items. From the bakery's\n, it's clear that a large part of the sales is in cakes (the prices of which are mentioned in Canadian dollars!). We had neither the occasion nor the appetite to try any of these brightly-coloured confections, but we imagine that this would be a good place to begin if you're looking for cakes in Jaffna.\nSpacious enough to accommodate a few tables, it is also a convenient place to settle down with your guilty pleasures and savour them peacefully. Service is brisk and business-like, as you'd expect in a place that welcomes a steady stream of hungry patrons. On the flip side, the store could do with one of those insect-trap lamps to zap the flies that can be a bit of an annoyance.\nWe have to be honest: in a city where everything from Indian food to ice cream is laced with a generous dose of sugar, we were expecting more of the same saccharine sweetness from a bakery. But Thinesh Bake House is an honorable exception to that particular local penchant.\nSubstantially larger than the scrawny\nyou get in most Colombo bakeries, Thinesh's version (Rs. 30) came with only a gentle dusting of sugar crystals. Deceptively dense-looking but soft and airy on the inside, it made me want to revisit my old Indian habit of tearing pieces of bread and dunking it in my cup of coffee. (Nescafe, tea and iced coffee are available at the bakery). Fragrant and studded with fat cloves of fried garlic, the large loaf of garlic bread is also totally worth the Rs. 150 you will pay for it. We're kicking ourselves for not trying the beautifully braided,\nlike bread this time around. If you try it, tell us what you think?\nThe cookies and biscuits also deliver on the freshness front. Straddling the line between savoury and sweet, the peanut cookies (Rs. 110) are crisp, crunchy and plenty peanutty. A lot less sweet than most cookies, they may not satisfy a strong sweet tooth. But we recommend crumbling them over dark chocolate ice cream for a crunchy-salty-sweet hit. The toast-like rusk biscuits (Rs. 80) are practically made to be married with tea or coffee (that old Indian habit again). Soak little bits of them in a hot cuppa and savour their soggy sweetness.\nGluten be damned, Thinesh Bake House's offerings are glorious because of it. Avowed carb fanatics, we were so surprised by the high quality and affordable pricing of most of the bakery's products that we brought several packets of the cookies and biscuits back home. While in Jaffna, stop by for a leisurely afternoon snack. We reckon you won't regret it.\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/thinesh-bake-house/review-53810",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_yIhp9W-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_8veXh9-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_KsCj73-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_Qn1kLB-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_611zyT-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_tkAmWw-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_XZRasd-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_Qn1kLB-640x485.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_8veXh9-640x568.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_tkAmWw-640x470.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_KsCj73-640x441.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://www.yamu.lk/uploads/files/2015/06/yimg_ht1uSm-600x250.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/11/yimg_Jw5H7t-600x250.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_yIhp9W-640x479.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_8veXh9-640x568.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_KsCj73-640x441.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_Qn1kLB-640x485.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}