{
  "name": "Thiru Murugan's Food Waves",
  "address": "41 Kandewatta Road Nugegoda",
  "open_until": " Open until 10:30 PM",
  "telephone": "0112822992",
  "description": "An Indian vegetarian restaurant with an extensive menu of North and South Indian cuisine.",
  "reviews": "Food Waves is not the most crowded place but it has been running for years. It's a vegetarian restaurant serving both North and South Indian cuisine. While some aspects of the food were alright, the service was extremely disappointing.\nThe food arrived pretty quick, which isn't saying much because there were only about three more customers aside from us. We got the Moghalai Biriyani (Rs. 350) and a side of Paneer Butter Masala (Rs. 400). The subtle use of spices in the biriyani and the well-cooked basmati rice mixed with a handsome amount of cashews were great, but the amount of oil could not be overlooked. We also missed the boiled egg that normally comes with the dish, and the portion was really small and not worth the price.\nThe Paneer Butter Masala is one of their most popular dishes. Although it tasted more like tofu than paneer, it was succulent in its own way and the gravy did wonders. It went very well with the biriyani and the rest of the dishes we ordered and was the only dish that wasn't dripping with oil.\nTheir naan and kulcha weren't available for lunch so we settled for a Butter Parotta (Rs. 300). You get two parottas with a side of sambar and a coconut chutney. The parottas were really tasty - crispy around the edges and soft in the middle. The coconut chutney worked well with the parotta but the sambar was watery with no texture or flavour.\nWe also ordered the Cheese Parotta (Rs. 380) which was a huge disappointment. When it said cheese we were expecting cheese\nthe parotta, not a sloppy smattering of grated cheese. It's not worth the extra bucks.\nThey didn't have any of the Lassis we wanted to try out, so we settled for two Lime Juices (Rs. 180 each) and a Lemon Soda (Rs. 220). I know you can't tell the difference, neither could we. There wasn't enough lemon or lime in both. The texture and flavour weren't strong enough either. They both tasted, more or less the same, and the only thing it did was help wash out all that oil.\nThe place seemed congested with so many tables and chairs which I don't think they need considering most people just come there for takeaway. The furnishing, however, was quite fancy.\nIn terms of service, it didn't come off as a surprise to us when the service was just downright rude and inconsiderate. There have been so many complaints about their service in other reviews going back years and they clearly couldn't care less about it. The waiter was telling us what was available as he was walking away. I don't see what his hurry was, seeing as the place was practically deserted.\nIt was rather a disappointing experience. They do seem to have a clear customer base, particularly for takeaway orders, but we wouldn't count ourselves among them. Their parottas are alright if you're willing to look past the oil, but we couldn't.\n",
  "yamu_rating": "We don’t like it",
  "url": "https://www.yamu.lk/place/food-waves/review-179830",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/06/yimg_oYePCJ-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/06/yimg_FSj1BV-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/06/yimg_jPaUFf-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/06/yimg_9ls7Sg-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/06/yimg_e6UvO1-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/06/yimg_kcZGk7-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/06/yimg_wqV6Iv-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2017/05/8ASFnC1F2g6DeTqofz.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/06/yimg_oYePCJ-1024x699.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/06/yimg_FSj1BV-768x768.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/06/yimg_jPaUFf-768x768.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/06/yimg_9ls7Sg-480x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/06/yimg_kcZGk7-1024x768.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/02/yimg_au7gKd-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/06/yimg_7CZ0vU-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2018/06/8vWkh5taQ5CVDJgqpQ.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/06/yimg_oYePCJ-640x437.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/06/yimg_FSj1BV-480x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/06/yimg_jPaUFf-480x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/06/yimg_9ls7Sg-480x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}