{
  "name": "Townhouse by &Co",
  "address": "282, R.A. De Mel Mawatha, Colombo 03",
  "open_until": " Open until 07:00 PM",
  "telephone": "0112339416",
  "description": "They're supposed to be a tea room, but they serve rice & curry, lamprais and other random stuff.",
  "reviews": "Townhouse at Liberty Arcade is the latest addition to the food scene, identifying themselves to be a \"modern day teahouse with delicious food and ingenuous drinks\". We dropped by for lunch a week after they officially opened, and were slightly surprised to see the likes of rice and curry and lamprais available. So we promptly ordered them.\nUnfortunately, half of the drinks which are tacked on the menu right at the entrace, weren't.\nThe interior of Townhouse is lovely. They've got an off-white theme going on, with slight gold accents (in the form of beads) highlighting some of the furniture. It's got a very soothing atmosphere, but could use some good music, which was completely lacking.\nIt's an exceedingly comfortable space, and quite spacious as well.\nSoon as you move on from the ambience though, things get a bit hilarious (depending on your sense of humour). It seems that though &Co opened shop about a week ago, they're yet to staff\nstock the place, which is weird. As in, there were no staff nor were there half the things displayed on the menu which was proudly displayed just outside the entrance. There was, however, a nice caretaker who mentioned that there'd been a change of management and she was filling in from the old management until adequate resources (human and otherwise) were sent over.\nIn all honesty, she did the best she could managing the place single-handedly.\nThey've got a few rice parcels displayed at the counter, along with lamprais and a couple of sandwiches. The meat options are fish, chicken, and pork.\nWe decided to try their main options before hitting up the desserts, so we went for their Pork Rice and Curry (Rs. 300) and Lamprais (Rs. 500).\nFor 500 bucks, we don't think the lamprais was worth it because the flavours didn't really come through. The main ingredients (well, most of) checked out, with there being a decent frikkadel, ash-plaintain curry, a somewhat okay brinjal pahe, and a very flavoursome blanchan, along with a boiled and fried egg, and dry chicken curry within. However it was rather underwhelming, and we've tasted\nThe pork rice and curry was rather more satisfactory.\nIt's basmati, with a side of\nand milky\ncame with a rather spicy pork curry and an even spicier\nwhich was, according to Bhagya, quite delish. So this is a win.\n(Moral of the story? Stick with the rice and curry.\nNah, jk).\nWe asked for a few drinks highlighted on their menu, only to be told that they only had tea stocked in at the moment, and the coffees and whatnot would come in later. Pity, because they legit have an item named 'Virgin Blow Job' which apparently consists of pineapple, coconut cream, passion fruit and grenadine, and Bhagya wanted to try it.\nOur conversation with the lady behind the counter went thus (I dared him to ask it out loud as well):\nBhagya: Hi, I'd like a virgin blowjob please.\nWaitstaff: Sorry?\nBhagya: Umm... a virgin blowjob?\nWaitstaff: ?\nBhagya: The pineapple and coconut drink?\nWS: Ah, sorry sir, new management, we don't have any of that yet. Only teas.\nSo. Tea it is.\nThe Raspberry Iced Tea is super reasonably priced at only a hundred rupees, but we'd recommend not going for it even if it was free. The aroma of sweet raspberries wafted out to the dining area soon after we'd placed our order, which rather made us wonder if they were pouring in syrup instead. But the tea in itself, when it came, had a very muddy texture and was overpoweringly bitter, with the\noverwhelming all other senses.\nWe couldn't finish it.\nThe Chai (by which they mean\ninstead of just chai, which is tea anyway) was described as black tea mixed with spices, strong, with a 'pick me up spicy flavour', but this sadly wasn't so. What arrived instead was a tea bag, along with some nice white porcelain, filled with hot water, milk, and brown sugar respectively.\nThe tea was disappointingly mild, with the barest hint of spice in it. Weird. No, the right word is disappointing, especially at Rs. 250.\nTownhouse is all set to be one of the nicest new hangout spots, especially with that interior, if they only got their food and staff sorted. It's been about a week now, and such an experience is understandable if the chef and staff are new and still finding their footing — but it's a different story altogether if there are\nchef or other staff at all except for the nice caretaker aunty who didn't really know what to do about the lack of items. Or to prepare the flavoured iced tea.\nMeanwhile, tip No. 01:\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/townhouse-by-co/review-74612",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_82nk8S-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_Wrk2ix-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_LVFuNn-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_v9jL1x-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_DN7UeR-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_geFnm7-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_QZWWFu-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_xuVVQY-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_ZkVg9f-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_ITG30a-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_WyPJ20-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_EE6bY3-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/08/bf9TdKPSlnqFHMaZrC.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_LVFuNn-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_v9jL1x-640x503.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_geFnm7-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_Wrk2ix-320x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_82nk8S-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_ITG30a-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/05/yimg_Wz4DZj-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_sh0mka-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_82nk8S-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_Wrk2ix-320x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_LVFuNn-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/01/yimg_v9jL1x-640x503.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}