{
  "name": "Urban Cafe",
  "address": "75, Olcott Mawatha, Colombo.",
  "open_until": " Open until 09:00 PM",
  "telephone": "0112328272",
  "description": "A new Chinese restaurant on the second floor of the New Colonial Hotel.",
  "reviews": "We went to Urban Cafe, located right in Pettah and on the second floor of the New Colonial Hotel, with relatively low expectations. The location (right in front of the railway station) is hectic as hell, and I had to limbo underneath a broken barrier to get from road to pavement. The staircase to the restaurant comes down right onto the pavement outside, but as soon as you get up it's significantly cooler and more peaceful, and I was very pleasantly surprised by the food and ambience.\nWe ordered some steamed rice (Rs. 180) as a base for all the curries, and it came in very generous portions. The rice was sambar rather than basmati, which was a nice change. The food itself is not authentic Chinese, but rather a Chinese that caters more to a Sri Lankan palate - the flavours are stronger, the portions are larger and the chillies far more abundant.\nThe kang kung (Rs. 200) is spicier than I'm used to, and there were a ton of visible chilli flakes in it that you don't usually find in kang kung. It wasn't unbearably spicy though, and the flavour remained quite subtle apart from the spice. The water spinach was fresh, and the dish was really satisfying.\nThe fish with spring onions and ginger (Rs. 580) was fried rather than steamed - as it traditionally is - and is pretty typical of any fish dish you'd find in any Sri Lankan Chinese restaurant. The flavour was good and the spring onion taste really came through, but it is on the saltier end of the spectrum so that's something to keep in mind if you're watching your sodium intake.\nThe Chop Suey (Rs. 200) was also spicier than usual (like the kang kung, the chilli flakes were everywhere). It was also less artificial and MSG-ridden than usual though, because most other chop sueys are coated in a thick beige sodium and corn starch gravy that is equal parts gross and addictive. The gravy in this was thin and watery, but super spicy, so I would recommend having just a little. The vegetables, again, were fresh and this really made the difference.\nThe kung pao chicken (Rs. 580) was probably one of the best we've had in Sri Lanka. The MSG was definitely present in this one too, but was much more subtle than in the fish. The roasted peanuts were a nice addition and added some crunch to the dish, as did the green chilli peppers. You could definitely just have this dish with some rice and be super satisfied, as the flavours are varied without being overpowering.\nHot Butter Mushroom (Rs. 290) will obviously never replace the godsend that is hot butter cuttlefish, but this one comes pretty damn close. It's not oily so it doesn't make you feel sick and gross, but the coating is super crunchy. The mushroom to batter ratio is perfect as well, and you can really taste the mushroom once you bitten through the outside. It tastes great as well, and the chilli flakes were a great addition here.\nAll the men who worked here were very accommodating and friendly. They were quick and willing to answer any questions we had about the food, and the food came in pretty fast and was all very fresh. Our waiter was a sweet middle-aged man who was really, really nice and insisted we could and should each eat an entire portion of steamed rice (we couldn't).\nThe place has a real old-school charm to it that we loved. The fact that it's not on the ground floor means it offers a little peace and quiet from the hustle and bustle of Pettah, and it's also a lot cooler and open, with just a few fans across the length of the space. There are also framed pictures of colonial Colombo on the walls, which are nice to look at but also filled me with righteous rage and prompted a rant on the evils of imperialism that no one listened to. The waiters wore polo shirts tucked into sarongs with fanny-packs as belts, which I loved and which also looked quite smart. Fanny-packs win, always.\nI would definitely recommend Urban Cafe to anyone who finds themselves near Pettah at lunch time. There's a section of ready-made food that you can have if you're a bit pressed for time, but if not, the freshly prepared food comes hot-hot. The food is highly satisfying and the prices very reasonable, but the nostalgic decor and ambience are what really won me over.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/urban-cafe/review-191237",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_sgj9uc-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_nP5qiq-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_Of9wa5-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_HZRzfQ-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_KQ9GWh-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_kJqcFG-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_kPJiR2-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_8SfOHw-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_52poUn-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2017/07/N0pl6fYyXeLoJKhMds.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_nP5qiq-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_52poUn-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_sgj9uc-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_kJqcFG-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_Of9wa5-360x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_8SfOHw-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_HZRzfQ-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_KQ9GWh-360x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://www.yamu.lk/wp-content/uploads/2014/07/IMG_2362-588x250.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/08/IMG_4106-588x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_sgj9uc-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_nP5qiq-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_Of9wa5-360x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/08/yimg_HZRzfQ-640x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}