{
  "name": "Uva Hotel",
  "address": "No.87, St. Micheals Road, Kollupitiya",
  "open_until": " Open until 08:00 PM",
  "telephone": "0112440140",
  "description": "A typical Saiwar place with good service and low costs. ",
  "reviews": "ඉර බැහැගෙන යන ජාමෙට කොළඹ වීදිවල ඇවිදිද්දී, පාර දෙපැත්තේ කඩවල්වලින් එන කෑම වල සුවඳ ම ඇති බඩ කට පිරෙන්න. ඉතින් ඒ වගේ වෙලාවට, අතේ තියෙන පොඩි ගාණකට වුණත් හොඳට බඩ පිරෙන්න කෑම වේලක් කන්න පුළුවන් තැනක් තමයි කොල්ලුපිටියේ ඌව හෝටලය.\nකොල්ලුපිටිය ශාන්ත මයිකල් පාරේ ගුණසිරි හෝටලය පහු කරපු ගමන්, පාර එහාපැත්තේ තමයි ඌව හෝටලය තියෙන්නේ. \"ඌව හෝටලය\" කියල සිංහලෙන් ගහලා, සුදු පාට නියොන් ලයිට් එකකිනුත් එළිය කරලා තියෙන නිසා, දුරට වුණත් මේක අඳුනගන්න පුළුවන්. පිටතින් බැලුවම වුණත් ගොඩක් පිරිසිදු පාටක් මේකේ පේන්න තියෙනවා.\nඌව හෝටලය හුඟක්ම ප්‍රසිද්ධ මේකේ හැදෙන කිරි මාළු කොත්තුවට. කිරට උයපු මාළු කෑලිත් එක්ක හැදෙන මේ කොත්තුව, ඒ  කිරි හොද්දෙන් එකතුවෙන ගොරකා වලින් එන ඇඹුල් රසය නිසා තවත් රසවත් වෙනවා. බොහොම ආසාවෙන් මේ කිරිමාළු කොත්තුව කන්න දත කට මැදන් හිටියත්, අපි ඌව හෝටලයට ගිය වේලාවේ ඒක ගන්න විදියක් තිබුණේ නැහැ . අපේ වෙලාවේ අවුලක් නිසාදෝ හෝ කිරි මාළු හොද්ද හැදෙන්නත් ටිකක් පරක්කු වෙනවා කියලයි අපට දැනගන්න ලැබුණේ.\nආව එකේ වෙන කෑම ටිකක රහ බලමු කියල හිතුණ නිසා, අපි ඕඩර් කළේ චිකන් කොත්තුවකුයි, පරාටායි, ආප්පයි, බිත්තර රෝල් එකකුයි, එළවලු රොටියකුයි. උණු උණුවෙම පිළිගැන්වුණ මේ කෑමත් එක්ක හොඳට යන්නේ හොඳට සීතල කරපු කොකාකෝලා එකක් නිසා, අපි එයින් එකකුත් ඕඩර් කළා.\nහොඳට ලුණු, ගම්මිරිස්, කුළුබඩු දාපු කොත්තුවක් තමයි ඌව හෝටලයේ හැදෙන්නේ. සමහර කඩවල්වලින් අපට ලැබෙන කොත්තුවල වගේ ඕනෙවට වඩා කැරට් ලීක්ස් මේකේ නැහැ. චිකන් කෑලිත් යහමින් දාලා, අතරින් පතර හැපෙන ලාවට බැදුණු කරපිංචා නිසා මේ කොත්තුව හුඟක් රසයි. ඒ විතරක් නෙවෙයි, නෝමල් සයිස් කොත්තුව වුණත් දෙන්නෙක්ට කන්න පුළුවන් තරමට ඇති.\nඅපි ගත්ත පරාටා එකේ වැඩියෙන්ම රස දැනුණේ, ඒකත් එක්ක අපට ලැබුණ මාළු හොද්ද නිසා. හොඳ සැර රසට හදලා තිබුණ මේ හොද්දත් ගානට කුළුබඩු දාලා හදලා උණුවෙන්ම තමයි පිළිගැන්වුණේ. මේකේ රස වැඩිකමටම පරාටා විතරක් නෙවෙයි, එළවළු රොටියයි, බිත්තර රෝල් එකයි අපි කෑවෙත් මේ හොද්දේ තවර ගෙන.\nලොකුවට අටුවා ටීකා ලියන්න දෙයක් නැතත්, බිත්තර රෝල් එකයි, එළවලු රොටියයි දෙකම හොඳට තිබුණ බව කියන්න ඕනේ. මේවා ඇත්තටම ඌව හෝටලයේ හවස් වරුවේ හැදෙන කෑම නිසා හොඳ අලුත් ගතියක් තියෙනවා.\nඌව හෝටලයේ ආප්ප හොඳටම හොඳයි. ආප්ප වල සාමාන්‍ය හැඩේ හැමවෙලේම මේ ආප්ප වල දැකගන්න නැතත්, බොහොම මතක හිටින රසක් මේවයේ තිබුණා. මෙහේ හැදෙන බිත්තර ආප්පවලට හොඳට බිත්තර යොදලා තියෙනවා වගේම, හොඳ පදමට ගම්මිරිස්, ලුණුත් එකතු කරලා තියෙනවා.\nගොඩක් වේගවත් සර්විස් එකක් අපට ඌව හෝටලයෙන් දැකගන්න ලැබුණා. අපේ කෑම ටික විනාඩි 5ක් වගේ කෙටි කාලෙකින් මේසෙට ගෙනල්ලා තියන්නත් එයාලා සමත් වුණා. අපි ඌව හෝටලයට ගොඩ වුණු වෙලේ සෙනඟ අඩු ගතියක් තමයි තිබුණේ. ඒත් ටිකෙන් ටික රෑ වෙද්දී අතුරු සිදුරු නැතුව කඩේ පිරිලා යන්න වුණත්, ඌව හෝටලයේ සර්විස් එකේ වේගය අඩුකමක් හෝ, සුහදශීලිත්වයේ මදකමක් පේන්නවත් තිබුණේ නැහැ.\nඌව හෝටලයේදී අපට කැපිලා පෙනුණු දෙයක් තමයි ඒකෙ තිබුණ පිරිසිදුකම. මූණ බලාගන්න පුළුවන් තරමට මැදපු බිමක තියෙන පිරිසිදුකමක් දැකගන්න නැතිවුණත්, පාර දෙපැත්තේ තියෙන මේ වගේ අනිත් කඩවල් එක්ක සංසන්දනය කරලා බැලුවාම බොහොම පිළිවෙල බවක් ඌව හෝටලයේ තියෙනවා. අනිත් දේ තමයි බයක් නැතුව අතේ පොඩි ගාණක් තියාගෙන ගිහින් වුණත් බඩ පිරෙන්න කන්න පුළුවන්කම. අපේ කෑම සේරටම බිල වුණේ රුපියල් 400ක් වගේ. ඒත් මදි නොකියන්න කන්න නම් හම්බවුණා.\nකොහොම වුණත්, අපි ඌව හෝටලෙන් එළියට බැස්සෙ, අපිට රස බලන්න බැරිවුණු කිරි මාළු කොත්තුවෙ රස බලන්න ආයෙත් දවසක අනිවා එනව කියන අදහසත් හිතේ තියාගෙනමයි.\n\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/uva-hotel/review-112557",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_OMR04i-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_QXmngb-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_OWvw3h-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_bjBdz3-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_DUdMQE-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_CxRMvN-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_U8dAVz-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2018/05/sIJAcEVxrFdIsRfn2v.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_DUdMQE-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_OMR04i-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_QXmngb-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_U8dAVz-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_OWvw3h-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_bjBdz3-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/02/yimg_LSBkrH-600x250.jpg",
    "https://www.yamu.lk/wp-content/uploads/2014/01/DSC07818-588x250.jpg",
    "https://www.yamu.lk/uploads/dp/2017/05/nTobdIdanKUUMvrSfv.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_OMR04i-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_QXmngb-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_OWvw3h-640x426.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/08/yimg_bjBdz3-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}