{
  "name": "Wayne's Junction",
  "address": "No. 304/4, Hokandara Road, Thalawathugoda.",
  "open_until": null,
  "telephone": "0114848455",
  "description": "A cafe that seems to have Australian inspired dishes, as well as local delicacies. Only on paper, as it turned out.",
  "reviews": "Vishvi had been telling me that we should check this place out for months but we always put it off cause honestly, it's very far. It took around Rs. 1400 in a cab going back and forth.\nI'm just gonna say right off the bat, this was probably the worst experience I have had in a cafe. You know those situations that are so bad that it's just funny. Like that.\nWe checked to see if it was open and on\nit said it's open from 11am-9pm. Great, so we left around 2.15 for a late lunch. So after 13km later, we arrived. It was closed, with a sign saying they're opening again at 3pm. Thankfully, it was almost 3 anyway so we waited. Not long before this dude came in a bike and let us in.\nWe took our seats and had to ask him for a menu cause he just stood there as if he had never served customers before. The menu looked really interesting with starters like fried mushrooms (which we were looking forward to), mains like pasta, burgers, wraps, rice etc. So after deciding what to order, Vishvi went to the counter. I'm gonna write the conversation because it was ridiculously funny!\nVishvi: Hi, can we get the Fried Mushrooms?\nWaiter: Hmmmmm... no. Not available.\nV: Okay, what starters are available?\nW: Hmm, nothing.\nV: Okay what about the pasta?\nW: *shakes his head* Nope.\nV: Alright, then we'll have the Falafel Burger.\nW: That's vegetarian.\nV: I know. Can we get it?\nW: This is vegetarian too (points to the Down Under Burger which is much easier to make)\nV: So is the Falafel not available?\nW: *shakes his head*\nV: Okay then we'll have the Down Under Burger.\nW: There are sandwiches!\nSo we decided on Chicken Ciabatta.\nV: What about drinks?\nW: Check the fridge.\nWhat's in the fridge? Water and a couple of soft drinks.\nV: We'll have water.\nSo yeah. First of all, what kinda place doesn't have pasta? It's like the easiest thing to make. It was very clear that this dude had no idea how to make anything that was on the menu except for the veggie burger and the sandwiches. The chef is a lady and she came as we were leaving the place. We also got a Chocolate Cake for dessert.\nIt gets worse.\nOur food took about good 20 minutes to arrive. He brought the sandwich first and kept it on the counter, made eye contact with me, gestured for me to come and get it, and went back into the kitchen. Yup, that happened. There was no sign that said it was self-service, but either way, you don't just leave food out like, what nonsense? There were flies around too. He did the same with the cake. The burger was served to us. Yay!\nThe funniest part was, at one point, he actually got on his bike and left the cafe entirely, leaving us in there. I'm not kidding.\nThe place is actually spacious, enough to hold at least 15-20 people at once. However, we weren't served any utensils until he brought them much later when we trying on the cake, so Vishvi got some from the other tables. They were clearly not washed properly, we had to wipe them with tissues. Same with the glasses.\nSo let's talk about the food.\nThe Chicken Ciabatta (Rs. 550) was actually the better of the two, but still not something we recommend. The bread was old and crumbly. So much so that it was falling off at our touch when we opened it to take a pic. The filling inside was precooked cause I highly doubt that dude made it. It was really good. Perfectly seasoned with lots of grilled chicken bits, caramelized mushrooms, and onions.\nHere's the magnificent burger, the Down Under (Rs. 550). It was supposed to come with a side of potato wedges, but, you know. Can't say I'm surprised. There was no patty so I honestly don't know how you could call this a burger. You can add a Falafel to it for an additional Rs. 300 but it \"wasn't available\". The veggies were so cold; straight out of the fridge. I mean, toss it on the pan for a bit, would ya? The bun wasn't anything special either.\nThe Chocolate Cake (Rs. 500) was a huge slice that we would have devoured in seconds if it hadn't been so sweet. The frosting was way too sweet. The cake was not that bad, it was quite dense but edible. The chef told us it was better tasted at room temperature so we brought it to the office and tried it. It did taste better because the cake was smoother but there wasn't a huge difference. I mean, cake always tastes better at room temperature.\nI'm sorry but there was absolutely nothing about this experience that impressed us. If you're planning to open your restaurant at a certain time, you have to be prepared. I'm sure the food is better when it's prepared by the chef but she wasn't there and after that horrendous experience, we don't think we would ever want to go back.\nYou know those situations that are so bad that it's just funny. Like that.\n\nතලවතුගොඩ පැත්තෙන් ආව වෙලාවක ගොඩ වුණොත් මිසක්, අපි වගේ තකහනියක් දුර ඉඳලා මෙහෙට යන්න එපා කියලා තමයි කියන්න තියෙන්නේ.\n",
  "yamu_rating": "This place makes us sad",
  "url": "https://www.yamu.lk/place/waynes-junction/review-222720",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_7nWc3Z-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_MJtzfr-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_nkK83B-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_msfMeF-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_AVbI9a-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_8iqYtO-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_rMdre4-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_4xtFFw-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_MPcebz-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_DciRlW-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2017/05/8ASFnC1F2g6DeTqofz.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_msfMeF-1024x576.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_7nWc3Z-640x392.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_MPcebz-1024x768.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_DciRlW-1024x768.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_MJtzfr-1024x576.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/10/yimg_HUDWRP-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/12/yimg_xpd4iq-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_7nWc3Z-640x392.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_MJtzfr-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_nkK83B-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_msfMeF-640x360.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}