{
  "name": "Wijaya Beach",
  "address": "Dalawella, Unawatuna, Galle",
  "open_until": null,
  "telephone": "912283610",
  "description": "An old favourite, Wijaya Beach continues to serve up fresh seafood, excellent pizza and a sun-dappled ocean view. ",
  "reviews": "Wijaya Beach has been a consistent favourite and is known for serving up some of the best pizzas in town. The restaurant is perched directly above the sea as well, with waves crashing just below the terrace and sand-coated tourists waltzing in and out at ease. It's a typical beach resto with simple and delicious food, and, best of all, service that doesn't discriminate between locals and tourists.\nI haven't been here before, and was expecting something large and rather jungle-beach-ish from everything I'd heard about it: I mean, tables set on sand, marquees, long tables and benches and all that\n. What I didn't expect was to walk in through an unobtrusive doorway and see a packed yet cosy building filled with loud music, chatter, and the smattering of waves.\nIt's surprisingly not as crowded as you'd expect, but I reckon that's probably because this strip of sea isn't accessible off the road, so you'd have to be a guest of one of the beach houses or restaurants lining the shores.\nWe sat around and waited for a while and then realized that we'd probably have to place our orders at the counter. It didn't seem like menus would be brought to the table; so we did it ourselves. When the waitstaff noticed me standing awkwardly around waiting to place my order (and noticed other people sort of go ahead of me), they waved me across and took down my orders: which I thought was pretty nice given how they didn't prioritize tourists like most touristy beach spots. They also made zero fuss when I changed my mind about the drinks, and were overall very brisk and friendly with service.\nWe opted for a half-and-half pizza with one side being feta and olives, the other being smoked chicken. The pizza was Rs. 1400.\nStrangely, they also offer Sashimi (Rs. 800) so we got that too. Along with a side of Garlic Bread (Rs. 300).\nI say 'strangely', because that's pretty much the only Japanese dish in a place of pizzas and drinks. For the price, you get a plateful of tuna slivers, fresh and delicious with a sprinkling of lime and a quick, light dip in soya sauce that accompanies it. If you want some added heat, dab a bit of wasabi on as well.\nOne of the things I like most about this place is the lack of pretentiousness. The old building, the simple furniture, the presentation of the food and drink. Like for example, instead of mason jars, these guys simply recycle old bottles and jars for drinks and condiments. Like so:\nThat is my Virgin Mojito (Rs. 500) in a jam or chutney jar, topped off with a couple of fresh and tiny flowers for what I assume is a cute effect. Those aren't the most edible of flowers though, so I put them away before drinking it. The soda to everything else ratio was a bit off though, as the lime and mint flavours were submerged by the former. Even after stirring thoroughly.\nWe loved the garlic bread, nothing fancy but wonderfully executed. If food could be called rustic, I'd say this is it: chunks of your regular loaf of bread slathered with garlic butter and garnished with what I presume is some parsley. Despite its rather bland appearance, it was surprisingly flavoursome and crispy.\nFinally, Wijaya Beach's signature dish: the pizza. The toppings were balanced on chappati-thin dough that was quite soft overall except for the crispiness around the edges.\nI wasn't a huge fan of the chicken half because the meat was sparse: except for one slice which had a generous bit topping it. The other slices were quite bare, so the other flavours (of cheese and dough) overpowered it. On the other hand, the feta and olive half was on point: I loved the mix of green and black olives, especially as the pickled green ones added a nice tang to it. Also, there was a whole lot more cheese on this, which made for an overall satisfying and fulfilling meal. Between two of us, we didn't have any trouble finishing this off. They're all surprisingly light (or maybe we were just ravenous).\nWhenever you head down south and aren't sure where to dine out, make your way to Wijeya. Friendly staff, great views, and superb beach vibes are what you can expect.\nA typical beach resto perched above the sea, dishing up simple and delicious food with a side of great service.\nIt's hard to find fault with the superb seafood, crisp pizza and chilled-out beach vibe at Wijaya Beach.\nLovely whitewashed wood, colourful bunting lining the rafters, sun beds overlooking an emerald sea and warm wafts of air emanating from a large wood fire oven: Wijaya Beach is a delicious slice of island life serving the island's most delicious slices of pizza.\n\nලස්සන සුදු පාටින් වර්ණ ගැන්වූ ලී, තද කොළ පාට සමුද්‍රය දෙසට හැරවූ අව්ව තපින ඇඳන් සහ උණුසුම් වාතය පිටවෙන විශාල දරලිපෙන් පත්තුවන අවන: විජය බීච් කියන්නේ දිවයිනේ රසම පීට්සා හදන අවන්හලයි.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/wijaya-beach/review-157361",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_tKkCAX-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_CkepTM-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_XgPWtV-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_JyqUHO-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_tMbaLN-150x100.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/12/Wijaya-Beach-Beach-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2012/12/Wijaya-Beach-Pizza-150x105.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_NeZ7hd-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_XBEctg-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_LLyrRO-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_yYH7d5-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_ygAcTT-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_S1KmCp-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_clLTWQ-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/01/yimg_3oOwSA-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/01/yimg_jnhppz-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/01/yimg_dK4GSg-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/01/yimg_A4ubg9-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/01/yimg_vofNGu-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/01/yimg_2xXS6x-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/01/yimg_jagJWn-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/01/yimg_mtIxJz-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/01/yimg_BvPPM2-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/01/yimg_JtIypO-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/08/bf9TdKPSlnqFHMaZrC.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/01/yimg_BvPPM2-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/01/yimg_2xXS6x-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/01/yimg_jagJWn-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/01/yimg_dK4GSg-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/01/yimg_jnhppz-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/01/yimg_vofNGu-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/01/yimg_3oOwSA-640x427.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_XgPWtV-640x442.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://www.yamu.lk/uploads/files/2015/07/yimg_5YTlbU-600x250.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/12/yimg_sw6ktP-600x250.JPG",
    "https://www.yamu.lk/uploads/dp/2016/08/XeyiyT47QP0lwSxe3a.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_tKkCAX-640x464.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_CkepTM-640x345.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_XgPWtV-640x442.jpg",
    "https://www.yamu.lk/uploads/files/2015/09/yimg_JyqUHO-640x436.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}