{
  "name": "Wonderbar",
  "address": "14, Reid Avenue, Colombo 7",
  "open_until": " Open 8.00 AM to 8.00 PM",
  "telephone": "0779158442",
  "description": "Wonderbar is a sweet-toothed vegan's dream come true. They offer you gluten, sugar, and dairy-free desserts and smoothies,",
  "reviews": "We went all-out healthy today, and ordered a bunch of desserts from Wonderbar (at like 11.30 AM) to the YAMU office. In spite of its brand name, this isn't the Elephant House ice cream we're all accustomed to. The Wonderbar outlet is all about smoothies and puddings — very healthy smoothies and puddings, to be precise.\nWhile they don't have an outlet of their own at the moment, they do have an FB page and market their produce at the Good Market Shop on Reid Avenue. That's right opposite the Colombo Racecourse, within the Lakpahana premises.\n\nWonderbar is a very-healthy-and-vegan person's dream come true, as the food and drinks are gluten, dairy, AND sugar free (seriously, how much healthier could you get?). Instead of sugar, they use local\n, and dates in some instances.  We were told that the yogi pudding line is flavoured using\nwhereas other puddings like the Basil Seed and Mango Pudding are sweetened using dates. The puddings also come with these really cool spoons fashioned out of coconut shells. We found them fascinating and a lot of fun to eat with — for some reason, it's a lot more fun scooping pudding out of coconut shells than it is to use boring ol' plastic or metal spoons.\nWe went for the Strawberry Dazzle, the Basil Seed and Mango Pudding and the Passion Lover. All three were very creamy and slightly gelatinous in texture. Where flavour was concerned, we all unanimously agreed that the Strawberry Dazzle 'tasted very healthy' — and that isn't always the best thing, flavour-wise. Someone also noticed that it tasted more of coconut than strawberry. I'd rate this dessert a 2/5.\nThe Basil Seed and Mango Pudding describes itself as a 'guiltless coconut dessert', and it does taste pretty guiltless. Luscious and creamy, the mango flavour is very subtle in this one. This is the sort of dessert that doesn't ruin your diet and makes you feel good, too.\nThe group's favourite, though, was Passion Lover. This feisty little dessert packed a punch, and also had a slight crunchy texture to it. The passion fruit flavour came out nicely, and added a little zest to our day.\nI say 'the drinks' but we just had a couple of drinks, really. And they were milk — cashew milk! A bit of intense research (ok, I kid. I just Googled it) tells me that cashew milk is non-dairy and easily digestible by the lactose intolerant.\nWe ordered the Mochanut cashew milk and the strawberry-flavoured cashew milk. I basically run on coffee, but the Mochanut didn't really cut ice with me. I found the drink's texture a bit too chalky, and the taste a tad too light. It didn't have the kick that a caffeinated drink should ideally provide, but that's just my personal taste. On the other hand, the strawberry cashew milk was much better — it didn't have the grainy texture the Mochanut had. It was light, subtle and smooth, and also tasted much better than its puddingy counterpart.\nGo for it. If you're really health-conscious and trying to maintain a diet (or if you're trying to cut down on those gloriously unhealthy sugary goodies), this is the perfect substitute for mainstream desserts. Switching over to the healthy side isn't going to kill anyone, except maybe a bit of your soul. Just kidding.\nThe prices are slightly on the higher side, especially since the portions aren't very large. The puddings were for Rs. 465 (except the mango and basil one, which was priced at Rs. 435), and the cashew milk was for Rs. 320. However, given the fact that you'd be hard-pressed to find sugar, gluten, and dairy-free produce over here, I'd say that this is a good deal overall.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/wonderbar/review-51961",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_Rl1wjx-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_Fy9Dhb-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_ymFgPb-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_eomGP4-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_LP1PnE-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_Hnp2xl-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_M7zfo5-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_SElDn7-150x100.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_GikwFI-150x100.JPG",
    "https://www.yamu.lk/uploads/dp/2015/08/bf9TdKPSlnqFHMaZrC.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_Rl1wjx-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_SElDn7-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_ymFgPb-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_eomGP4-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_Fy9Dhb-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://www.yamu.lk/wp-content/uploads/2014/09/DSCF9962-588x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/11/yimg_xITP8F-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_Rl1wjx-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_Fy9Dhb-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_ymFgPb-640x426.JPG",
    "https://www.yamu.lk/uploads/files/2015/08/yimg_eomGP4-640x426.JPG",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}