{
  "name": "Yue Chuan (Kingsbury)",
  "address": "48 Janadhipathi Mawatha, Colombo 1",
  "open_until": " Open 11.30 AM to 2.30 PM, 6 PM to 11.30 PM",
  "telephone": "0771087720",
  "description": "Yue Chuan is a fine dining Chinese restaurant located at the Kingsbury hotel. The food is good, but not excellent.",
  "reviews": "Yue Chuan at The Kingsbury is one of the few fine dining Chinese restaurants in Colombo. The food is decent and the prices are pretty reasonable, but we weren't blown away.\nUnlike most of the other Chineses restaurants in Colombo, Yue Chuan doesn't have a massive 100 page menu. That being said, they still offer a good variety of dish types with pretty much all the essentials covered. When it comes to prices at Chinese restaurants, we've noticed that there's actually only a bit of a difference between the regulars and the fine dining. While certain dish types like duck and scallop are a bit higher in price, the usual meats, veges and carbs are pretty reasonable with small portions priced between Rs. 450 and Rs. 950. They've also got a few set menus priced at around Rs. 3000 which cover a range of dish types.\nFor starters we had the pork and celery dumplings (Rs. 700). These were soft and smooth in texture, with ample filling. The filling itself was lightly seasoned with the diced celery adding a bit of texture. These taste fine on their own but dipping them in the soy sauce really does add greatly to the flavour.\nThe Szechuan style fried noodles with seafood (Rs. 650) was unremarkable. When it said \"fried\" noodles we were expecting crispy noodles, but these are fried in the same sense as a fried rice, as in more along the lines of cooked in oil. The positives here was that the portion was easily enough for three with a good amount of seafood. On the flip side, it lacked balance of flavour with it tasting mostly of chilli.\nThe roast pork with honey (Rs. 870) was good, but not exceptional. You get a decent amount of thinly sliced roast pork on a bed lettuce. While the pork was roasted and seasoned well, we would have liked to see a bit more of that honey sauce. Since the other pork dishes are priced at Rs. 550, we think those might be better value for money.\nThe sweet and sour bean curd (Rs 800) was surprisingly tasty. It's prepared in the usual sweet and sour sauce, but it works quite nicely with the fried been curd, which is crispy on the on the outside and soft in the center.\nThe best of the dishes we tried was easily their pan-fried tuna steak in black bean sauce (Rs. 800). The fish itself was cooked perfectly soft with the sauce binding to it beautifully. While the fish was the base, the sauce is what really added the flavour and heat. It can be quite intense with both green chillies and black bean, so have it judiciously.\nFor dessert we tried the deep-fried ice cream in strawberry sauce (Rs. 400) which didn't look like much, but was actually quite nice. You get two scoops of ice cream, fried in a light batter which adds a nice crunch. The strawberry sauce also works well here, but there just wasn't enough of it.\nThe deep-fried banana roll with ice cream (Rs. 400) can be best described as a banana spring roll. This one works well because it has that mix of warmth from the banana roll and the coolness of the ice cream.\nThe ambience at Yue Chuan is classical if a bit dated. They've gone with some soft lighting which is easy on the eyes but at times just isn't enough. That being said, the restaurant is spacious and seems to be quite popular among foreigners in particular. The Chinese oriental music was also something we quite enjoyed.\nService was pretty good overall, but did have room for improvement. They did quite well in terms of preparation times with the food being ready in under 15 minutes. The waiters carry themselves professionally and seem to know the menu well. However, certain little things like bringing the tea and menus took too long and we found ourselves reminding them about it a few times.\nYue Chuan is a good chinese restaurant with it's merits, but we wouldn't say that it's exceptional. At the end of the day, we'd go there again.\nYue Chuan at The Kingsbury is one of the few fine dining Chinese restaurants in Colombo. The food is decent and the prices are pretty reasonable, but we weren't blown away.\nYue Chuan is a fine dining Chinese restaurant located at the Kingsbury hotel. The food is good, but not excellent.\n\nයූ චුවාං කියන්නේ කිංස්බරි හෝටලයේ පිහිටි චීන අවන්හලක්. කෑම හොඳ වුණාට ඇති විශිෂ්ට කියා කිව නොහැකියි.\n",
  "yamu_rating": "It's alright",
  "url": "https://www.yamu.lk/place/yue-chuan/review-43541",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_cqG6xx-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_FCWq7C-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_i8x4Iv-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_YzFEMi-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_ObWdwp-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_qsacR3-150x100.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/08/IMG_1824-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/08/IMG_1821-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/08/IMG_1820-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/08/IMG_1817-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/08/IMG_1816-150x105.jpg",
    "https://www.yamu.lk/wp-content/uploads/2013/08/IMG_1809-150x105.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_l6My32-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_YX9p3o-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_BFIS44-150x100.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_jvNAnC-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_BFIS44-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_YX9p3o-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_cqG6xx-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_FCWq7C-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_l6My32-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_ObWdwp-318x480.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_jvNAnC-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_i8x4Iv-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_qsacR3-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_YzFEMi-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://www.yamu.lk/wp-content/uploads/2013/11/DSCF5296-588x250.jpg",
    "https://www.yamu.lk/uploads/files/2014/11/yimg_AZZCPm-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_cqG6xx-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_FCWq7C-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_i8x4Iv-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2015/03/yimg_YzFEMi-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}