{
  "name": "Zen (Zylan Boutique Hotel)",
  "address": "115, Rosmead Place, Colombo 7",
  "open_until": " Open 11.30 AM–10.30 PM",
  "telephone": "0112686883",
  "description": "Zen is Zylan boutique hotel's hidden gem of a Japanese restaurant. They made a great first impression on our visit, and we love their new bento boxes.",
  "reviews": "Zen is Zylan boutique hotel's hidden gem of a Japanese restaurant. They made a great first impression on our first visit, and this time around they've taken it a step further with their new bento boxes.\nWhen it comes to Japanese restaurants in Colombo, everyone's well acquainted with\n,\nand even the lower priced likes of\nand\n. However, similar to\n, Zen has managed to fly under the radar, only known to a select few. That shouldn't be the case since they do a darn good job of the cuisine. The menu at Zen has remained relatively unchanged over the past year with the exception of their newly introduced range of lunch bento boxes. Compared to its contemporaries, Zen is priced quite reasonably – the price per head came to under Rs. 2,000 in our case.\nTo start off, we got the nigiri platter (Rs. 450) which comes with one each of tuna, salmon and ebi nigiri. Since most places generally charge around Rs. 200 per nigiri, this is a decent deal. Before even taking the first bite, we had a good feeling about our plate, going by the presentation, knifemanship and structure of the nigiri. The rice was cooked just right, so it held its form well. We got a hint of wasabi first, followed by the the fresh seafood that left no fishy aftertaste. Each element was fresh and came through beautifully.\nWe followed it up with the Philadelphia maki (Rs. 850) which is an uramaki or inside-out maki with avocado, cream cheese and salmon, topped with black sesame. The addition of cream cheese separates this one from usual makis, but it also adds an element of personal preference. We were satisfied with the overall flavour, but felt that the combination of both avocado and cream cheese made it a tad too creamy. However, we can see others liking it for just that reason. Adding a bit of wasabi and soy helped cut through the creaminess, though, and we'd gladly have this again.\nAround a week ago, Zen introduced a new range of bentos for lunch with a varied selection. They've got 12 options that cover all the essential meats and seafood, priced between Rs. 1,100 and Rs. 2,150. Since we had already tried the sushi separately, we went for the shogiyaki bento (Rs. 1,350 nett), which comes with shogiyaki pork or fried pork in ginger sauce, crumb-fried prawns, tuna and salmon sashimi, steamed rice and miso soup. Encased in a well-seasoned, thin yet crispy batter, the prawns were cooked just right. The sauce and mayo dip added a bit of sweetness and creaminess. When it came to the sashimi, they used an\ncut of tuna (one with very little fat), which tasted super fresh, along with a slightly fatty cut of salmon that added a nice contrast. Despite using thinner cuts of lean meat, the shogiyaki pork was not overcooked, and doused in a well-balanced sauce that wasn't too heavy on ginger. This worked well with the steamed rice.\nWe had some leftover rice, and seeing as how we were still within our budget, we also got the teriyaki pork (Rs. 750). This time, the pork had a bit more fat but we didn't feel too guilty about what we'd had up until this point, so it was all good. While on the sweeter side, the teriyaki sauce was still appealing with a slightly thick consistency that made for a good glaze over the well-cooked, lightly caramelised pork.\nZen is somewhat hidden away at The Zylan Luxury Hotel on Rosmead Place. Being a boutique hotel, the interior decor and overall look of the space is quite tasteful with polished cement floors, large paintings, a beautiful grand piano and a tiny, well-maintained bamboo garden. This is honestly a great place for a private meal considering the fact that it's rarely ever crowded. Since we dropped in for lunch, we sat on the ground floor but they've also got rooftop seating that is perfect for dinner.\nThe service was one area we weren't too impressed with on our previous visit, but now the staff seems to be far more familiar with the menu and better trained in general. We were seated in one of two ocuppied tables at the time so the food arrived quite quickly. But Japanese food requires relatively little cooking time, so we don't anticipate long delays even when the restaurant is more crowded.\nDespite being quite underrated, Zen remains one of the better Japanese restaurants in Colombo. If you're a fan of Japanese cuisine and you prefer a private meal in a peaceful setting, Zen is definitely worth a visit.\nZen is Zylan boutique hotel's hidden gem of a Japanese restaurant. They made a great first impression on our visit, and this time around they've taken it a step further with their new bento boxes.\nZEN is a brand new Japanese restaurant on Rosmead Place. While their menu is a bit limited, the food was good and pretty authentic. Their service however, needs a bit of work.\n",
  "yamu_rating": "We like this",
  "url": "https://www.yamu.lk/place/zen/review-59009",
  "img_urls": [
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_oarYI3.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_iCGWqc.png",
    "https://www.yamu.lk/l/assets/img/fork.svg",
    "https://www.yamu.lk/l/assets/img/culture.svg",
    "https://www.yamu.lk/l/assets/img/yamu_logo.svg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/06/yimg_amrU6R.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_I6p3li-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_I6p3li-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_dKQabr-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_seKN7u-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_6zbN4V-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_A000aK-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_2jbAG6-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_FuR7fZ-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_gp8BT2-150x100.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/09/yimg_Gl81WY-150x100.jpg",
    "https://www.yamu.lk/uploads/dp/2015/06/PAkQ7xCZ7qH2IkrvEI.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_I6p3li-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_seKN7u-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_dKQabr-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_6zbN4V-640x425.jpg",
    "https://www.yamu.lk/uploads/files/2014/12/yimg_wQlw0o-640x180.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_t2WNK6-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_B3qSnm-318x480.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2017/03/yimg_DWnStO.png",
    "https://www.yamu.lk/uploads/files/2015/04/yimg_sG0SqX-600x250.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2016/05/yimg_Z9mUmz-600x250.jpg",
    "https://www.yamu.lk/uploads/dp/2017/10/CQqYnYAZJa2ySSUK5I.jpg",
    "https://www.yamu.lk/uploads/dp/2017/10/CQqYnYAZJa2ySSUK5I.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/03/yimg_V9gegf.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_I6p3li-640x427.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_dKQabr-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_seKN7u-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2015/10/yimg_6zbN4V-640x425.jpg",
    "https://d3dz4rogqkqh6r.cloudfront.net/uploads/files/2018/01/yimg_sl08gd.gif",
    "https://www.facebook.com/tr?id=609408732574388&ev=PageView&noscript=1"
  ]
}